[Killed] BlockStatement
src/app/AppProviders.tsx:36:63
 
 type AppProvidersProps = PropsWithChildren
 
-export function AppProviders({ children }: AppProvidersProps) {
-  return (
-    <AppConfigProvider>
-      <AppProvidersInner>{children}</AppProvidersInner>
-    </AppConfigProvider>
-  )
-}
+export function AppProviders({ children }: AppProvidersProps) {}
 
 function AppProvidersInner({ children }: AppProvidersProps) {
killedBy: AppProviders renders the dashboard heading by default
statusReason: Unable to find an element with the text: Operational overview. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
src/app/AppProviders.tsx:46:26
 
 function AppProvidersInner({ children }: AppProvidersProps) {
   const appConfig = useAppConfig()
-  const logger = useMemo(() => createAppLogger(appConfig), [appConfig])
+  const logger = useMemo(() => undefined, [appConfig])
   const trackingClient = useMemo(() => createTrackingClient(), [])
   const queryEvents = useMemo(() => createQueryEventBus(), [])
killedBy: AppProviders renders the dashboard heading by default
statusReason: Logger context is unavailable

[Killed] ArrowFunction
src/app/AppProviders.tsx:47:34
 function AppProvidersInner({ children }: AppProvidersProps) {
   const appConfig = useAppConfig()
   const logger = useMemo(() => createAppLogger(appConfig), [appConfig])
-  const trackingClient = useMemo(() => createTrackingClient(), [])
+  const trackingClient = useMemo(() => undefined, [])
   const queryEvents = useMemo(() => createQueryEventBus(), [])
   const queryClient = useMemo(() => createAppQueryClient(logger, queryEvents), [logger, queryEvents])
killedBy: AppProviders renders the dashboard heading by default
statusReason: Tracking context is unavailable

[Killed] ArrowFunction
src/app/AppProviders.tsx:48:31
   const appConfig = useAppConfig()
   const logger = useMemo(() => createAppLogger(appConfig), [appConfig])
   const trackingClient = useMemo(() => createTrackingClient(), [])
-  const queryEvents = useMemo(() => createQueryEventBus(), [])
+  const queryEvents = useMemo(() => undefined, [])
   const queryClient = useMemo(() => createAppQueryClient(logger, queryEvents), [logger, queryEvents])
   const enableCachePersistence = useFeatureFlag('enableQueryCachePersistence')
killedBy: AppProviders renders the dashboard heading by default
statusReason: Cannot read properties of undefined (reading 'on')

[Survived] ArrayDeclaration
src/app/AppProviders.tsx:48:60
   const appConfig = useAppConfig()
   const logger = useMemo(() => createAppLogger(appConfig), [appConfig])
   const trackingClient = useMemo(() => createTrackingClient(), [])
-  const queryEvents = useMemo(() => createQueryEventBus(), [])
+  const queryEvents = useMemo(() => createQueryEventBus(), ["Stryker was here"])
   const queryClient = useMemo(() => createAppQueryClient(logger, queryEvents), [logger, queryEvents])
   const enableCachePersistence = useFeatureFlag('enableQueryCachePersistence')

[Killed] ArrowFunction
src/app/AppProviders.tsx:49:31
   const logger = useMemo(() => createAppLogger(appConfig), [appConfig])
   const trackingClient = useMemo(() => createTrackingClient(), [])
   const queryEvents = useMemo(() => createQueryEventBus(), [])
-  const queryClient = useMemo(() => createAppQueryClient(logger, queryEvents), [logger, queryEvents])
+  const queryClient = useMemo(() => undefined, [logger, queryEvents])
   const enableCachePersistence = useFeatureFlag('enableQueryCachePersistence')
 
killedBy: AppProviders renders the dashboard heading by default
statusReason: Cannot read properties of undefined (reading 'mount')

[Killed] BlockStatement
src/app/AppProviders.tsx:52:19
   const queryClient = useMemo(() => createAppQueryClient(logger, queryEvents), [logger, queryEvents])
   const enableCachePersistence = useFeatureFlag('enableQueryCachePersistence')
 
-  useEffect(() => {
-    if (!enableCachePersistence) {
-      return
-    }
-    const cleanup = enableQueryCachePersistence(queryClient)
-    return cleanup ?? undefined
-  }, [enableCachePersistence, queryClient])
+  useEffect(() => {}, [enableCachePersistence, queryClient])
 
   return (
killedBy: AppProviders feature flags activates query cache persistence when enabled
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/app/AppProviders.tsx:53:9
   const enableCachePersistence = useFeatureFlag('enableQueryCachePersistence')
 
   useEffect(() => {
-    if (!enableCachePersistence) {
+    if (enableCachePersistence) {
       return
     }
killedBy: AppProviders feature flags activates query cache persistence when enabled
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/app/AppProviders.tsx:53:9
   const enableCachePersistence = useFeatureFlag('enableQueryCachePersistence')
 
   useEffect(() => {
-    if (!enableCachePersistence) {
+    if (false) {
       return
     }
killedBy: AppProviders feature flags skips persistence when the flag is disabled
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      QueryClient {},

[Killed] LogicalOperator
src/app/AppProviders.tsx:57:12
       return
     }
     const cleanup = enableQueryCachePersistence(queryClient)
-    return cleanup ?? undefined
+    return cleanup && undefined
   }, [enableCachePersistence, queryClient])
 
killedBy: AppProviders feature flags activates query cache persistence when enabled
statusReason: expected "vi.fn()" to be called at least once

[Killed] LogicalOperator
src/app/AppProviders.tsx:75:42
                       <QueryErrorNotifierBridge />
                       <QueryErrorObserver queryEvents={queryEvents} />
                       <ToastProvider />
-                      <AppErrorBoundary>{children ?? <RouterProvider router={router} />}</AppErrorBoundary>
+                      <AppErrorBoundary>{children && <RouterProvider router={router} />}</AppErrorBoundary>
                     </NotificationBusProvider>
                   </AuthorizationProvider>
killedBy: AppProviders renders the dashboard heading by default
statusReason: Unable to find an element with the text: Operational overview. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div>

[Killed] BlockStatement
src/app/AppProviders.tsx:88:77
   )
 }
 
-function RouterContextBridge({ queryClient }: { queryClient: QueryClient }) {
-  const { isAuthenticated } = useAuth()
-  const permissions = usePermissions()
-
-  router.update({
-    context: {
-      queryClient,
-      authState: {
-        isAuthenticated,
-        permissions,
-      },
-    },
-  })
-
-  return null
-}
+function RouterContextBridge({ queryClient }: { queryClient: QueryClient }) {}
 
 function QueryErrorNotifierBridge() {
killedBy: AppProviders renders the dashboard heading by default
statusReason: Unable to find an element with the text: Operational overview. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div>

[Survived] BlockStatement
src/app/AppProviders.tsx:105:37
   return null
 }
 
-function QueryErrorNotifierBridge() {
-  const bus = useNotificationBus()
-
-  useEffect(() => {
-    return registerQueryErrorNotifier((payload) => {
-      bus.emit(NOTIFICATION_EVENT_TOAST, payload)
-    })
-  }, [bus])
-
-  return null
-}
+function QueryErrorNotifierBridge() {}
 
 

[Survived] BlockStatement
src/app/AppProviders.tsx:108:19
 function QueryErrorNotifierBridge() {
   const bus = useNotificationBus()
 
-  useEffect(() => {
-    return registerQueryErrorNotifier((payload) => {
-      bus.emit(NOTIFICATION_EVENT_TOAST, payload)
-    })
-  }, [bus])
+  useEffect(() => {}, [bus])
 
   return null

[NoCoverage] BlockStatement
src/app/AppProviders.tsx:109:52
   const bus = useNotificationBus()
 
   useEffect(() => {
-    return registerQueryErrorNotifier((payload) => {
-      bus.emit(NOTIFICATION_EVENT_TOAST, payload)
-    })
+    return registerQueryErrorNotifier((payload) => {})
   }, [bus])
 
