[Killed] BlockStatement
src/app/abilities/IfCan.tsx:23:94
   mode?: IfCanMode
 }>
 
-const resolveFallback = (fallback: FallbackType | undefined, allowed: boolean): ReactNode => {
-  if (!fallback) {
-    return null
-  }
-  if (typeof fallback === 'function') {
-    return fallback(allowed)
-  }
-  return fallback
-}
+const resolveFallback = (fallback: FallbackType | undefined, allowed: boolean): ReactNode => {}
 
 const disableChild = (child: ReactNode): ReactNode => {
killedBy: IfCan renders fallback when ability is denied
statusReason: Unable to find an element by: [data-testid="fallback"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/app/abilities/IfCan.tsx:24:7
 }>
 
 const resolveFallback = (fallback: FallbackType | undefined, allowed: boolean): ReactNode => {
-  if (!fallback) {
+  if (fallback) {
     return null
   }
killedBy: Ability pipeline integration denies manage license ability to viewers via provider stack
statusReason: Unable to find an element by: [data-testid="no-access"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/app/abilities/IfCan.tsx:24:7
 }>
 
 const resolveFallback = (fallback: FallbackType | undefined, allowed: boolean): ReactNode => {
-  if (!fallback) {
+  if (true) {
     return null
   }
killedBy: IfCan renders fallback when ability is denied
statusReason: Unable to find an element by: [data-testid="fallback"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/app/abilities/IfCan.tsx:27:7
   if (!fallback) {
     return null
   }
-  if (typeof fallback === 'function') {
+  if (true) {
     return fallback(allowed)
   }
killedBy: IfCan renders fallback when ability is denied
statusReason: fallback is not a function

[Killed] EqualityOperator
src/app/abilities/IfCan.tsx:27:7
   if (!fallback) {
     return null
   }
-  if (typeof fallback === 'function') {
+  if (typeof fallback !== 'function') {
     return fallback(allowed)
   }
killedBy: IfCan renders fallback when ability is denied
statusReason: fallback is not a function

[Killed] BlockStatement
src/app/abilities/IfCan.tsx:33:55
   return fallback
 }
 
-const disableChild = (child: ReactNode): ReactNode => {
-  if (!isValidElement(child)) {
-    return null
-  }
-
-  const element = child as ReactElement<{ disabled?: boolean; 'aria-disabled'?: boolean }>
-
-  return cloneElement(element, {
-    disabled: true,
-    'aria-disabled': true,
-  })
-}
+const disableChild = (child: ReactNode): ReactNode => {}
 
 export function IfCan({ action, subject, fallback, mode = 'hide', children }: IfCanProps) {
killedBy: IfCan disables child when mode is disable
statusReason: Unable to find an element by: [data-testid="action"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/app/abilities/IfCan.tsx:34:7
 }
 
 const disableChild = (child: ReactNode): ReactNode => {
-  if (!isValidElement(child)) {
+  if (isValidElement(child)) {
     return null
   }
killedBy: IfCan disables child when mode is disable
statusReason: Unable to find an element by: [data-testid="action"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/app/abilities/IfCan.tsx:34:7
 }
 
 const disableChild = (child: ReactNode): ReactNode => {
-  if (!isValidElement(child)) {
+  if (true) {
     return null
   }
killedBy: IfCan disables child when mode is disable
statusReason: Unable to find an element by: [data-testid="action"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ObjectLiteral
src/app/abilities/IfCan.tsx:40:32
 
   const element = child as ReactElement<{ disabled?: boolean; 'aria-disabled'?: boolean }>
 
-  return cloneElement(element, {
-    disabled: true,
-    'aria-disabled': true,
-  })
+  return cloneElement(element, {})
 }
 
killedBy: IfCan disables child when mode is disable
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  data-testid="action"
  type="button"
/>

[Killed] BooleanLiteral
src/app/abilities/IfCan.tsx:41:15
   const element = child as ReactElement<{ disabled?: boolean; 'aria-disabled'?: boolean }>
 
   return cloneElement(element, {
-    disabled: true,
+    disabled: false,
     'aria-disabled': true,
   })
killedBy: IfCan disables child when mode is disable
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  aria-disabled="true"
  data-testid="action"
  type="button"
/>

[Killed] BooleanLiteral
src/app/abilities/IfCan.tsx:42:22
 
   return cloneElement(element, {
     disabled: true,
-    'aria-disabled': true,
+    'aria-disabled': false,
   })
 }
killedBy: IfCan disables child when mode is disable
statusReason: expect(element).toHaveAttribute("aria-disabled", "true") // element.getAttribute("aria-disabled") === "true"

Expected the element to have attribute:
  aria-disabled="true"
Received:
  aria-disabled="false"

[Killed] BlockStatement
src/app/abilities/IfCan.tsx:46:91
   })
 }
 
-export function IfCan({ action, subject, fallback, mode = 'hide', children }: IfCanProps) {
-  return (
-    <ContextualCan I={action} a={subject} passThrough>
-      {(isAllowed: boolean) => {
-        if (isAllowed) {
-          return children
-        }
-
-        if (mode === 'disable') {
-          return disableChild(children) ?? resolveFallback(fallback, isAllowed)
-        }
-
-        return resolveFallback(fallback, isAllowed)
-      }}
-    </ContextualCan>
-  )
-}
+export function IfCan({ action, subject, fallback, mode = 'hide', children }: IfCanProps) {}
 
 
killedBy: IfCan renders children when ability is allowed
statusReason: Unable to find an element by: [data-testid="allowed"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] StringLiteral
src/app/abilities/IfCan.tsx:46:59
   })
 }
 
-export function IfCan({ action, subject, fallback, mode = 'hide', children }: IfCanProps) {
+export function IfCan({ action, subject, fallback, mode = "", children }: IfCanProps) {
   return (
     <ContextualCan I={action} a={subject} passThrough>

[Killed] BlockStatement
src/app/abilities/IfCan.tsx:49:32
 export function IfCan({ action, subject, fallback, mode = 'hide', children }: IfCanProps) {
   return (
     <ContextualCan I={action} a={subject} passThrough>
-      {(isAllowed: boolean) => {
-        if (isAllowed) {
-          return children
-        }
-
-        if (mode === 'disable') {
-          return disableChild(children) ?? resolveFallback(fallback, isAllowed)
-        }
-
-        return resolveFallback(fallback, isAllowed)
-      }}
+      {(isAllowed: boolean) => {}}
     </ContextualCan>
   )
killedBy: IfCan renders children when ability is allowed
statusReason: Unable to find an element by: [data-testid="allowed"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/app/abilities/IfCan.tsx:50:13
   return (
     <ContextualCan I={action} a={subject} passThrough>
       {(isAllowed: boolean) => {
-        if (isAllowed) {
+        if (true) {
           return children
         }
killedBy: IfCan renders fallback when ability is denied
statusReason: expected <span data-testid="denied-child"></span> to be null

[Killed] ConditionalExpression
src/app/abilities/IfCan.tsx:50:13
   return (
     <ContextualCan I={action} a={subject} passThrough>
       {(isAllowed: boolean) => {
-        if (isAllowed) {
+        if (false) {
           return children
         }
killedBy: IfCan renders children when ability is allowed
statusReason: Unable to find an element by: [data-testid="allowed"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/app/abilities/IfCan.tsx:54:33
           return children
         }
 
-        if (mode === 'disable') {
-          return disableChild(children) ?? resolveFallback(fallback, isAllowed)
-        }
+        if (mode === 'disable') {}
 
         return resolveFallback(fallback, isAllowed)
killedBy: IfCan disables child when mode is disable
statusReason: Unable to find an element by: [data-testid="action"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/app/abilities/IfCan.tsx:54:13
           return children
         }
 
-        if (mode === 'disable') {
+        if (true) {
           return disableChild(children) ?? resolveFallback(fallback, isAllowed)
         }
killedBy: IfCan renders fallback when ability is denied
statusReason: expected <span …(3)></span> to be null

[Killed] LogicalOperator
src/app/abilities/IfCan.tsx:55:18
         }
 
         if (mode === 'disable') {
-          return disableChild(children) ?? resolveFallback(fallback, isAllowed)
+          return disableChild(children) && resolveFallback(fallback, isAllowed)
         }
 
killedBy: IfCan disables child when mode is disable
statusReason: Unable to find an element by: [data-testid="action"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
