[Killed] BlockStatement
src/app/abilities/IfPermission.tsx:13:79
   fallback?: FallbackRenderer
 }>
 
-const renderFallback = (fallback: FallbackRenderer | undefined): ReactNode => {
-  if (!fallback) {
-    return null
-  }
-  if (typeof fallback === 'function') {
-    return fallback()
-  }
-  return fallback
-}
+const renderFallback = (fallback: FallbackRenderer | undefined): ReactNode => {}
 
 export function IfPermission({ permission, children, fallback }: IfPermissionProps) {
killedBy: IfPermission renders fallback when permission is missing
statusReason: Unable to find an element by: [data-testid="perm-fallback"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/app/abilities/IfPermission.tsx:14:7
 }>
 
 const renderFallback = (fallback: FallbackRenderer | undefined): ReactNode => {
-  if (!fallback) {
+  if (true) {
     return null
   }
killedBy: IfPermission renders fallback when permission is missing
statusReason: Unable to find an element by: [data-testid="perm-fallback"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/app/abilities/IfPermission.tsx:14:7
 }>
 
 const renderFallback = (fallback: FallbackRenderer | undefined): ReactNode => {
-  if (!fallback) {
+  if (fallback) {
     return null
   }
killedBy: IfPermission renders fallback when permission is missing
statusReason: Unable to find an element by: [data-testid="perm-fallback"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/app/abilities/IfPermission.tsx:17:39
   if (!fallback) {
     return null
   }
-  if (typeof fallback === 'function') {
-    return fallback()
-  }
+  if (typeof fallback === 'function') {}
   return fallback
 }
killedBy: IfPermission supports fallback render functions for permissions
statusReason: Unable to find an element by: [data-testid="perm-fn-fallback"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/app/abilities/IfPermission.tsx:23:85
   return fallback
 }
 
-export function IfPermission({ permission, children, fallback }: IfPermissionProps) {
-  const allowed = useCan(permission)
-
-  if (allowed) {
-    return <>{children}</>
-  }
-
-  return <>{renderFallback(fallback)}</>
-}
+export function IfPermission({ permission, children, fallback }: IfPermissionProps) {}
 
 
killedBy: IfPermission renders children when permission is granted
statusReason: Unable to find an element by: [data-testid="permission-allowed"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/app/abilities/IfPermission.tsx:26:16
 export function IfPermission({ permission, children, fallback }: IfPermissionProps) {
   const allowed = useCan(permission)
 
-  if (allowed) {
-    return <>{children}</>
-  }
+  if (allowed) {}
 
   return <>{renderFallback(fallback)}</>
killedBy: IfPermission renders children when permission is granted
statusReason: Unable to find an element by: [data-testid="permission-allowed"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/app/abilities/IfPermission.tsx:26:7
 export function IfPermission({ permission, children, fallback }: IfPermissionProps) {
   const allowed = useCan(permission)
 
-  if (allowed) {
+  if (false) {
     return <>{children}</>
   }
killedBy: IfPermission renders children when permission is granted
statusReason: Unable to find an element by: [data-testid="permission-allowed"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
