[Killed] ObjectLiteral
src/app/abilities/abilityMap.ts:30:62
 
 type PermissionAbilityMap = Record<PermissionKey, AbilityTuple[]>
 
-export const PERMISSION_TO_ABILITIES: PermissionAbilityMap = {
-  viewDashboard: [[ABILITY_ACTION_VIEW, ABILITY_SUBJECT_DASHBOARD]],
-  manageLicenses: [
-    [ABILITY_ACTION_VIEW, ABILITY_SUBJECT_LICENSE],
-    [ABILITY_ACTION_MANAGE, ABILITY_SUBJECT_LICENSE],
-  ],
-  manageProducts: [
-    [ABILITY_ACTION_VIEW, ABILITY_SUBJECT_PRODUCT],
-    [ABILITY_ACTION_MANAGE, ABILITY_SUBJECT_PRODUCT],
-  ],
-  manageTenants: [
-    [ABILITY_ACTION_VIEW, ABILITY_SUBJECT_TENANT],
-    [ABILITY_ACTION_MANAGE, ABILITY_SUBJECT_TENANT],
-  ],
-  manageUsers: [
-    [ABILITY_ACTION_VIEW, ABILITY_SUBJECT_USER],
-    [ABILITY_ACTION_MANAGE, ABILITY_SUBJECT_USER],
-  ],
-  viewAnalytics: [[ABILITY_ACTION_VIEW, ABILITY_SUBJECT_ANALYTICS]],
-}
+export const PERMISSION_TO_ABILITIES: PermissionAbilityMap = {}
 
 export const getAbilitiesForPermission = (permission: PermissionKey): readonly AbilityTuple[] => {
killedBy: useAbility returns an ability instance when wrapped in AbilityProvider
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/app/abilities/abilityMap.ts:31:18
 type PermissionAbilityMap = Record<PermissionKey, AbilityTuple[]>
 
 export const PERMISSION_TO_ABILITIES: PermissionAbilityMap = {
-  viewDashboard: [[ABILITY_ACTION_VIEW, ABILITY_SUBJECT_DASHBOARD]],
+  viewDashboard: [],
   manageLicenses: [
     [ABILITY_ACTION_VIEW, ABILITY_SUBJECT_LICENSE],
killedBy: useAbility returns an ability instance when wrapped in AbilityProvider
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/app/abilities/abilityMap.ts:37:5
     [ABILITY_ACTION_MANAGE, ABILITY_SUBJECT_LICENSE],
   ],
   manageProducts: [
-    [ABILITY_ACTION_VIEW, ABILITY_SUBJECT_PRODUCT],
+    [],
     [ABILITY_ACTION_MANAGE, ABILITY_SUBJECT_PRODUCT],
   ],
killedBy: permission to ability mapping maps manageProducts to manage product abilities
statusReason: expected [ [], [ 'manage', 'product' ] ] to deep equally contain [ 'view', 'product' ]

[Killed] ArrayDeclaration
src/app/abilities/abilityMap.ts:42:5
   ],
   manageTenants: [
     [ABILITY_ACTION_VIEW, ABILITY_SUBJECT_TENANT],
-    [ABILITY_ACTION_MANAGE, ABILITY_SUBJECT_TENANT],
+    [],
   ],
   manageUsers: [
killedBy: permission to ability mapping maps manageTenants to manage tenant abilities
statusReason: expected [ [ 'view', 'tenant' ], [] ] to deep equally contain [ 'manage', 'tenant' ]

[Killed] ArrayDeclaration
src/app/abilities/abilityMap.ts:48:19
     [ABILITY_ACTION_VIEW, ABILITY_SUBJECT_USER],
     [ABILITY_ACTION_MANAGE, ABILITY_SUBJECT_USER],
   ],
-  viewAnalytics: [[ABILITY_ACTION_VIEW, ABILITY_SUBJECT_ANALYTICS]],
+  viewAnalytics: [[]],
 }
 
killedBy: permission to ability mapping maps viewAnalytics to analytics view ability
statusReason: expected [ [] ] to deep equally contain [ 'view', 'analytics' ]

[Killed] ArrayDeclaration
src/app/abilities/abilityMap.ts:48:18
     [ABILITY_ACTION_VIEW, ABILITY_SUBJECT_USER],
     [ABILITY_ACTION_MANAGE, ABILITY_SUBJECT_USER],
   ],
-  viewAnalytics: [[ABILITY_ACTION_VIEW, ABILITY_SUBJECT_ANALYTICS]],
+  viewAnalytics: [],
 }
 
killedBy: permission to ability mapping covers every permission key with at least one ability tuple
statusReason: expected [] to not have a length of +0

[Killed] BlockStatement
src/app/abilities/abilityMap.ts:51:98
   viewAnalytics: [[ABILITY_ACTION_VIEW, ABILITY_SUBJECT_ANALYTICS]],
 }
 
-export const getAbilitiesForPermission = (permission: PermissionKey): readonly AbilityTuple[] => {
-  return PERMISSION_TO_ABILITIES[permission] ?? []
-}
+export const getAbilitiesForPermission = (permission: PermissionKey): readonly AbilityTuple[] => {}
 
 
killedBy: IfCan renders children when ability is allowed
statusReason: Cannot read properties of undefined (reading 'forEach')

[Killed] LogicalOperator
src/app/abilities/abilityMap.ts:52:10
 }
 
 export const getAbilitiesForPermission = (permission: PermissionKey): readonly AbilityTuple[] => {
-  return PERMISSION_TO_ABILITIES[permission] ?? []
+  return PERMISSION_TO_ABILITIES[permission] && []
 }
 
killedBy: IfCan renders children when ability is allowed
statusReason: Unable to find an element by: [data-testid="allowed"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
