[Killed] EqualityOperator
src/app/auth/AuthProvider.tsx:17:19
 import type { AuthStatus, AuthContextValue } from './types'
 import { persistAuth, persistAuthUser, readPersistedAuth, readPersistedUser, type PersistedAuth } from './persistedAuth'
 
-const isBrowser = typeof window !== 'undefined'
+const isBrowser = typeof window === 'undefined'
 
 const setTokenOnClient = (client: SimpleLicenseClient, token: string | null, expiresAt: number | null): void => {
killedBy: AuthProvider refreshes the user when authenticated
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Killed] ConditionalExpression
src/app/auth/AuthProvider.tsx:17:19
 import type { AuthStatus, AuthContextValue } from './types'
 import { persistAuth, persistAuthUser, readPersistedAuth, readPersistedUser, type PersistedAuth } from './persistedAuth'
 
-const isBrowser = typeof window !== 'undefined'
+const isBrowser = false
 
 const setTokenOnClient = (client: SimpleLicenseClient, token: string | null, expiresAt: number | null): void => {
killedBy: AuthProvider refreshes the user when authenticated
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Survived] BlockStatement
src/app/auth/AuthProvider.tsx:19:113
 
 const isBrowser = typeof window !== 'undefined'
 
-const setTokenOnClient = (client: SimpleLicenseClient, token: string | null, expiresAt: number | null): void => {
-  client.setToken(token, expiresAt)
-}
+const setTokenOnClient = (client: SimpleLicenseClient, token: string | null, expiresAt: number | null): void => {}
 
 export function AuthProvider({ children }: PropsWithChildren) {

[Killed] ArrowFunction
src/app/auth/AuthProvider.tsx:25:31
 
 export function AuthProvider({ children }: PropsWithChildren) {
   const client = useApiClient()
-  const initialAuth = useMemo(() => readPersistedAuth(), [])
+  const initialAuth = useMemo(() => undefined, [])
   const initialUser = useMemo(() => (initialAuth.token ? readPersistedUser() : null), [initialAuth.token])
   const [authState, setAuthState] = useState<PersistedAuth>(initialAuth)
killedBy: AppProviders renders the dashboard heading by default
statusReason: Cannot read properties of undefined (reading 'token')

[Timeout] ArrowFunction
src/app/auth/AuthProvider.tsx:26:31
 export function AuthProvider({ children }: PropsWithChildren) {
   const client = useApiClient()
   const initialAuth = useMemo(() => readPersistedAuth(), [])
-  const initialUser = useMemo(() => (initialAuth.token ? readPersistedUser() : null), [initialAuth.token])
+  const initialUser = useMemo(() => undefined, [initialAuth.token])
   const [authState, setAuthState] = useState<PersistedAuth>(initialAuth)
   const { token, expiresAt } = authState

[Survived] BlockStatement
src/app/auth/AuthProvider.tsx:32:19
   const [status, setStatus] = useState<AuthStatus>(AUTH_STATUS_IDLE)
   const [currentUser, setCurrentUser] = useState<User | null>(initialUser)
 
-  useEffect(() => {
-    if (!initialAuth.token) {
-      persistAuthUser(null)
-    }
-  }, [initialAuth.token])
+  useEffect(() => {}, [initialAuth.token])
 
   useEffect(() => {

[Survived] BooleanLiteral
src/app/auth/AuthProvider.tsx:33:9
   const [currentUser, setCurrentUser] = useState<User | null>(initialUser)
 
   useEffect(() => {
-    if (!initialAuth.token) {
+    if (initialAuth.token) {
       persistAuthUser(null)
     }

[Survived] ConditionalExpression
src/app/auth/AuthProvider.tsx:33:9
   const [currentUser, setCurrentUser] = useState<User | null>(initialUser)
 
   useEffect(() => {
-    if (!initialAuth.token) {
+    if (true) {
       persistAuthUser(null)
     }

[Survived] BlockStatement
src/app/auth/AuthProvider.tsx:38:19
     }
   }, [initialAuth.token])
 
-  useEffect(() => {
-    setTokenOnClient(client, token, expiresAt)
-  }, [client, token, expiresAt])
+  useEffect(() => {}, [client, token, expiresAt])
 
   const refreshCurrentUser = useCallback(async (): Promise<User | null> => {

[Survived] ArrayDeclaration
src/app/auth/AuthProvider.tsx:40:6
 
   useEffect(() => {
     setTokenOnClient(client, token, expiresAt)
-  }, [client, token, expiresAt])
+  }, [])
 
   const refreshCurrentUser = useCallback(async (): Promise<User | null> => {

[Killed] BlockStatement
src/app/auth/AuthProvider.tsx:42:76
     setTokenOnClient(client, token, expiresAt)
   }, [client, token, expiresAt])
 
-  const refreshCurrentUser = useCallback(async (): Promise<User | null> => {
-    if (!token) {
-      setCurrentUser(null)
-      return null
-    }
-
-    try {
-      setStatus(AUTH_STATUS_LOADING)
-      const response = await client.getCurrentUser()
-      setCurrentUser(response.user)
-      persistAuthUser(response.user)
-      setStatus(AUTH_STATUS_IDLE)
-      return response.user
-    } catch {
-      setCurrentUser(null)
-      persistAuthUser(null)
-      setStatus(AUTH_STATUS_IDLE)
-      return null
-    }
-  }, [client, token])
+  const refreshCurrentUser = useCallback(async (): Promise<User | null> => {}, [client, token])
 
   useEffect(() => {
killedBy: AuthProvider refreshes the user when authenticated
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Killed] BlockStatement
src/app/auth/AuthProvider.tsx:43:17
   }, [client, token, expiresAt])
 
   const refreshCurrentUser = useCallback(async (): Promise<User | null> => {
-    if (!token) {
-      setCurrentUser(null)
-      return null
-    }
+    if (!token) {}
 
     try {
killedBy: AuthProvider skips network calls when refreshing without a token
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array []

[Killed] BooleanLiteral
src/app/auth/AuthProvider.tsx:43:9
   }, [client, token, expiresAt])
 
   const refreshCurrentUser = useCallback(async (): Promise<User | null> => {
-    if (!token) {
+    if (token) {
       setCurrentUser(null)
       return null
killedBy: AuthProvider refreshes the user when authenticated
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Killed] BlockStatement
src/app/auth/AuthProvider.tsx:48:9
       return null
     }
 
-    try {
-      setStatus(AUTH_STATUS_LOADING)
-      const response = await client.getCurrentUser()
-      setCurrentUser(response.user)
-      persistAuthUser(response.user)
-      setStatus(AUTH_STATUS_IDLE)
-      return response.user
-    } catch {
+    try {} catch {
       setCurrentUser(null)
       persistAuthUser(null)
killedBy: AuthProvider refreshes the user when authenticated
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Survived] BlockStatement
src/app/auth/AuthProvider.tsx:55:13
       persistAuthUser(response.user)
       setStatus(AUTH_STATUS_IDLE)
       return response.user
-    } catch {
-      setCurrentUser(null)
-      persistAuthUser(null)
-      setStatus(AUTH_STATUS_IDLE)
-      return null
-    }
+    } catch {}
   }, [client, token])
 

[Killed] BlockStatement
src/app/auth/AuthProvider.tsx:63:19
     }
   }, [client, token])
 
-  useEffect(() => {
-    if (!token || !isBrowser) {
-      return
-    }
-    const timeoutId = window.setTimeout(() => {
-      void refreshCurrentUser()
-    }, 0)
-    return () => {
-      window.clearTimeout(timeoutId)
-    }
-  }, [token, refreshCurrentUser])
+  useEffect(() => {}, [token, refreshCurrentUser])
 
   const login = useCallback(
killedBy: AuthProvider refreshes the user when authenticated
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Killed] BooleanLiteral
src/app/auth/AuthProvider.tsx:64:9
   }, [client, token])
 
   useEffect(() => {
-    if (!token || !isBrowser) {
+    if (token || !isBrowser) {
       return
     }
killedBy: AuthProvider logs in and exposes authenticated user details
statusReason: expected '' to be truthy

[Killed] BooleanLiteral
src/app/auth/AuthProvider.tsx:64:19
   }, [client, token])
 
   useEffect(() => {
-    if (!token || !isBrowser) {
+    if (!token || isBrowser) {
       return
     }
killedBy: AuthProvider refreshes the user when authenticated
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Killed] BlockStatement
src/app/auth/AuthProvider.tsx:67:47
     if (!token || !isBrowser) {
       return
     }
-    const timeoutId = window.setTimeout(() => {
-      void refreshCurrentUser()
-    }, 0)
+    const timeoutId = window.setTimeout(() => {}, 0)
     return () => {
       window.clearTimeout(timeoutId)
killedBy: AuthProvider refreshes the user when authenticated
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Killed] BlockStatement
src/app/auth/AuthProvider.tsx:70:18
     const timeoutId = window.setTimeout(() => {
       void refreshCurrentUser()
     }, 0)
-    return () => {
-      window.clearTimeout(timeoutId)
-    }
+    return () => {}
   }, [token, refreshCurrentUser])
 
killedBy: AuthProvider logs out and clears the user state
statusReason: expected 'admin@example.com' to be '' // Object.is equality

[Killed] BlockStatement
src/app/auth/AuthProvider.tsx:76:75
   }, [token, refreshCurrentUser])
 
   const login = useCallback(
-    async (username: string, password: string): Promise<LoginResponse> => {
-      setStatus(AUTH_STATUS_LOADING)
-      const response = await client.login(username, password)
-      const expiresAt = Date.now() + response.expires_in * 1_000
-      persistAuth(response.token, expiresAt)
-      persistAuthUser(response.user)
-      setAuthState({ token: response.token, expiresAt })
-      setCurrentUser(response.user)
-      setStatus(AUTH_STATUS_IDLE)
-      return response
-    },
+    async (username: string, password: string): Promise<LoginResponse> => {},
     [client],
   )
killedBy: AuthProvider logs in and exposes authenticated user details
statusReason: expected 'anonymous' to be 'authenticated' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Survived] ArithmeticOperator
src/app/auth/AuthProvider.tsx:79:25
     async (username: string, password: string): Promise<LoginResponse> => {
       setStatus(AUTH_STATUS_LOADING)
       const response = await client.login(username, password)
-      const expiresAt = Date.now() + response.expires_in * 1_000
+      const expiresAt = Date.now() - response.expires_in * 1_000
       persistAuth(response.token, expiresAt)
       persistAuthUser(response.user)

[Survived] ArithmeticOperator
src/app/auth/AuthProvider.tsx:79:38
     async (username: string, password: string): Promise<LoginResponse> => {
       setStatus(AUTH_STATUS_LOADING)
       const response = await client.login(username, password)
-      const expiresAt = Date.now() + response.expires_in * 1_000
+      const expiresAt = Date.now() + response.expires_in / 1_000
       persistAuth(response.token, expiresAt)
       persistAuthUser(response.user)

[Killed] ObjectLiteral
src/app/auth/AuthProvider.tsx:82:20
       const expiresAt = Date.now() + response.expires_in * 1_000
       persistAuth(response.token, expiresAt)
       persistAuthUser(response.user)
-      setAuthState({ token: response.token, expiresAt })
+      setAuthState({})
       setCurrentUser(response.user)
       setStatus(AUTH_STATUS_IDLE)
killedBy: AuthProvider logs in and exposes authenticated user details
statusReason: expected 'anonymous' to be 'authenticated' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Killed] BlockStatement
src/app/auth/AuthProvider.tsx:90:36
     [client],
   )
 
-  const logout = useCallback(() => {
-    persistAuth(null, null)
-    persistAuthUser(null)
-    setAuthState({ token: null, expiresAt: null })
-    setCurrentUser(null)
-    setStatus(AUTH_STATUS_IDLE)
-  }, [])
+  const logout = useCallback(() => {}, [])
 
   useEffect(() => {
killedBy: AuthProvider logs out and clears the user state
statusReason: expected 'authenticated' to be 'anonymous' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Survived] ObjectLiteral
src/app/auth/AuthProvider.tsx:93:18
   const logout = useCallback(() => {
     persistAuth(null, null)
     persistAuthUser(null)
-    setAuthState({ token: null, expiresAt: null })
+    setAuthState({})
     setCurrentUser(null)
     setStatus(AUTH_STATUS_IDLE)

[Killed] BlockStatement
src/app/auth/AuthProvider.tsx:102:52
     if (typeof window === 'undefined') {
       return
     }
-    const handleStorage = (event: StorageEvent) => {
-      if (event.key === STORAGE_KEY_AUTH_TOKEN && event.newValue === null) {
-        logout()
-        return
-      }
-      if (event.key === STORAGE_KEY_AUTH_USER) {
-        if (event.newValue) {
-          try {
-            const parsedUser = JSON.parse(event.newValue) as User
-            setCurrentUser(parsedUser)
-          } catch {
-            setCurrentUser(null)
-          }
-        } else {
-          setCurrentUser(null)
-        }
-      }
-    }
+    const handleStorage = (event: StorageEvent) => {}
     window.addEventListener('storage', handleStorage)
     return () => {
killedBy: AuthProvider logs out when another tab clears the auth token
statusReason: expected 'authenticated' to be 'anonymous' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Killed] ConditionalExpression
src/app/auth/AuthProvider.tsx:103:11
       return
     }
     const handleStorage = (event: StorageEvent) => {
-      if (event.key === STORAGE_KEY_AUTH_TOKEN && event.newValue === null) {
+      if (true) {
         logout()
         return
killedBy: AuthProvider updates the current user when storage events provide a new user snapshot
statusReason: expected '' to be 'external-user' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Killed] ConditionalExpression
src/app/auth/AuthProvider.tsx:103:11
       return
     }
     const handleStorage = (event: StorageEvent) => {
-      if (event.key === STORAGE_KEY_AUTH_TOKEN && event.newValue === null) {
+      if (false) {
         logout()
         return
killedBy: AuthProvider logs out when another tab clears the auth token
statusReason: expected 'authenticated' to be 'anonymous' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Killed] BlockStatement
src/app/auth/AuthProvider.tsx:107:48
         logout()
         return
       }
-      if (event.key === STORAGE_KEY_AUTH_USER) {
-        if (event.newValue) {
-          try {
-            const parsedUser = JSON.parse(event.newValue) as User
-            setCurrentUser(parsedUser)
-          } catch {
-            setCurrentUser(null)
-          }
-        } else {
-          setCurrentUser(null)
-        }
-      }
+      if (event.key === STORAGE_KEY_AUTH_USER) {}
     }
     window.addEventListener('storage', handleStorage)
killedBy: AuthProvider updates the current user when storage events provide a new user snapshot
statusReason: expected 'admin@example.com' to be 'external-user' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Killed] ConditionalExpression
src/app/auth/AuthProvider.tsx:107:11
         logout()
         return
       }
-      if (event.key === STORAGE_KEY_AUTH_USER) {
+      if (false) {
         if (event.newValue) {
           try {
killedBy: AuthProvider updates the current user when storage events provide a new user snapshot
statusReason: expected 'admin@example.com' to be 'external-user' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Killed] BlockStatement
src/app/auth/AuthProvider.tsx:108:29
         return
       }
       if (event.key === STORAGE_KEY_AUTH_USER) {
-        if (event.newValue) {
-          try {
-            const parsedUser = JSON.parse(event.newValue) as User
-            setCurrentUser(parsedUser)
-          } catch {
-            setCurrentUser(null)
-          }
-        } else {
+        if (event.newValue) {} else {
           setCurrentUser(null)
         }
killedBy: AuthProvider updates the current user when storage events provide a new user snapshot
statusReason: expected 'admin@example.com' to be 'external-user' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Killed] ConditionalExpression
src/app/auth/AuthProvider.tsx:108:13
         return
       }
       if (event.key === STORAGE_KEY_AUTH_USER) {
-        if (event.newValue) {
+        if (false) {
           try {
             const parsedUser = JSON.parse(event.newValue) as User
killedBy: AuthProvider updates the current user when storage events provide a new user snapshot
statusReason: expected 'admin@example.com' to be 'external-user' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[Killed] BlockStatement
src/app/auth/AuthProvider.tsx:109:15
       }
       if (event.key === STORAGE_KEY_AUTH_USER) {
         if (event.newValue) {
-          try {
-            const parsedUser = JSON.parse(event.newValue) as User
-            setCurrentUser(parsedUser)
-          } catch {
+          try {} catch {
             setCurrentUser(null)
           }
killedBy: AuthProvider updates the current user when storage events provide a new user snapshot
statusReason: expected 'admin@example.com' to be 'external-user' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="theme-light"
    data-app-theme="light"

[NoCoverage] BlockStatement
src/app/auth/AuthProvider.tsx:112:19
           try {
             const parsedUser = JSON.parse(event.newValue) as User
             setCurrentUser(parsedUser)
-          } catch {
-            setCurrentUser(null)
-          }
+          } catch {}
         } else {
           setCurrentUser(null)

[NoCoverage] BlockStatement
src/app/auth/AuthProvider.tsx:115:16
           } catch {
             setCurrentUser(null)
           }
-        } else {
-          setCurrentUser(null)
-        }
+        } else {}
       }
     }

[Survived] BlockStatement
src/app/auth/AuthProvider.tsx:121:18
       }
     }
     window.addEventListener('storage', handleStorage)
-    return () => {
-      window.removeEventListener('storage', handleStorage)
-    }
+    return () => {}
   }, [logout])
 

[Killed] ArrowFunction
src/app/auth/AuthProvider.tsx:127:5
   }, [logout])
 
   const contextValue = useMemo<AuthContextValue>(
-    () => ({
-      token,
-      currentUser,
-      status,
-      isAuthenticated: Boolean(token),
-      login,
-      logout,
-      refreshCurrentUser,
-    }),
+    () => undefined,
     [token, currentUser, status, login, logout, refreshCurrentUser],
   )
killedBy: AppProviders renders the dashboard heading by default
statusReason: Auth context is unavailable
