[Survived] StringLiteral
src/app/auth/SessionManager.tsx:21:79
 import type { NotificationEventMap } from '../../notifications/types'
 import { useTracking } from '../analytics/trackingContext'
 
-const ACTIVITY_EVENTS: Array<keyof WindowEventMap> = ['mousemove', 'keydown', 'click', 'scroll']
+const ACTIVITY_EVENTS: Array<keyof WindowEventMap> = ['mousemove', 'keydown', "", 'scroll']
 
 export const SessionManager = () => {

[Killed] BooleanLiteral
src/app/auth/SessionManager.tsx:29:34
   const tracking = useTracking()
   const warningTimerRef = useRef<number | null>(null)
   const timeoutTimerRef = useRef<number | null>(null)
-  const warningShownRef = useRef(false)
+  const warningShownRef = useRef(true)
 
   const clearTimers = useCallback(() => {
killedBy: SessionManager emits a warning toast after the idle warning threshold
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
src/app/auth/SessionManager.tsx:31:41
   const timeoutTimerRef = useRef<number | null>(null)
   const warningShownRef = useRef(false)
 
-  const clearTimers = useCallback(() => {
-    if (warningTimerRef.current) {
-      window.clearTimeout(warningTimerRef.current)
-      warningTimerRef.current = null
-    }
-    if (timeoutTimerRef.current) {
-      window.clearTimeout(timeoutTimerRef.current)
-      timeoutTimerRef.current = null
-    }
-  }, [])
+  const clearTimers = useCallback(() => {}, [])
 
   const publishToast = useCallback(
killedBy: SessionManager resets timers when user activity is detected
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] BlockStatement
src/app/auth/SessionManager.tsx:32:34
   const warningShownRef = useRef(false)
 
   const clearTimers = useCallback(() => {
-    if (warningTimerRef.current) {
-      window.clearTimeout(warningTimerRef.current)
-      warningTimerRef.current = null
-    }
+    if (warningTimerRef.current) {}
     if (timeoutTimerRef.current) {
       window.clearTimeout(timeoutTimerRef.current)
killedBy: SessionManager resets timers when user activity is detected
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] ConditionalExpression
src/app/auth/SessionManager.tsx:32:9
   const warningShownRef = useRef(false)
 
   const clearTimers = useCallback(() => {
-    if (warningTimerRef.current) {
+    if (false) {
       window.clearTimeout(warningTimerRef.current)
       warningTimerRef.current = null
killedBy: SessionManager resets timers when user activity is detected
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Survived] ConditionalExpression
src/app/auth/SessionManager.tsx:36:9
       window.clearTimeout(warningTimerRef.current)
       warningTimerRef.current = null
     }
-    if (timeoutTimerRef.current) {
+    if (false) {
       window.clearTimeout(timeoutTimerRef.current)
       timeoutTimerRef.current = null

[Survived] ConditionalExpression
src/app/auth/SessionManager.tsx:36:9
       window.clearTimeout(warningTimerRef.current)
       warningTimerRef.current = null
     }
-    if (timeoutTimerRef.current) {
+    if (true) {
       window.clearTimeout(timeoutTimerRef.current)
       timeoutTimerRef.current = null

[Killed] BlockStatement
src/app/auth/SessionManager.tsx:43:73
   }, [])
 
   const publishToast = useCallback(
-    (payload: NotificationEventMap[typeof NOTIFICATION_EVENT_TOAST]) => {
-      bus.emit(NOTIFICATION_EVENT_TOAST, payload)
-    },
+    (payload: NotificationEventMap[typeof NOTIFICATION_EVENT_TOAST]) => {},
     [bus],
   )
killedBy: SessionManager emits a warning toast after the idle warning threshold
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
src/app/auth/SessionManager.tsx:49:44
     [bus],
   )
 
-  const scheduleTimers = useCallback(() => {
-    clearTimers()
-    warningTimerRef.current = window.setTimeout(() => {
-      if (warningShownRef.current) {
-        return
-      }
-      warningShownRef.current = true
-      tracking.track(TRACKING_EVENT_SESSION_WARNING)
-      publishToast({
-        titleKey: I18N_KEY_SESSION_WARNING_TITLE,
-        descriptionKey: I18N_KEY_SESSION_WARNING_BODY,
-        variant: NOTIFICATION_VARIANT_WARNING,
-      })
-    }, SESSION_IDLE_WARNING_MS)
-
-    timeoutTimerRef.current = window.setTimeout(() => {
-      publishToast({
-        titleKey: I18N_KEY_SESSION_EXPIRED_TITLE,
-        descriptionKey: I18N_KEY_SESSION_EXPIRED_BODY,
-        variant: NOTIFICATION_VARIANT_ERROR,
-      })
-      tracking.track(TRACKING_EVENT_SESSION_TIMEOUT)
-      logout()
-    }, SESSION_IDLE_TIMEOUT_MS)
-  }, [clearTimers, logout, publishToast, tracking])
+  const scheduleTimers = useCallback(() => {}, [clearTimers, logout, publishToast, tracking])
 
   useEffect(() => {
killedBy: SessionManager emits a warning toast after the idle warning threshold
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
src/app/auth/SessionManager.tsx:51:55
 
   const scheduleTimers = useCallback(() => {
     clearTimers()
-    warningTimerRef.current = window.setTimeout(() => {
-      if (warningShownRef.current) {
-        return
-      }
-      warningShownRef.current = true
-      tracking.track(TRACKING_EVENT_SESSION_WARNING)
-      publishToast({
-        titleKey: I18N_KEY_SESSION_WARNING_TITLE,
-        descriptionKey: I18N_KEY_SESSION_WARNING_BODY,
-        variant: NOTIFICATION_VARIANT_WARNING,
-      })
-    }, SESSION_IDLE_WARNING_MS)
+    warningTimerRef.current = window.setTimeout(() => {}, SESSION_IDLE_WARNING_MS)
 
     timeoutTimerRef.current = window.setTimeout(() => {
killedBy: SessionManager emits a warning toast after the idle warning threshold
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
src/app/auth/SessionManager.tsx:52:11
   const scheduleTimers = useCallback(() => {
     clearTimers()
     warningTimerRef.current = window.setTimeout(() => {
-      if (warningShownRef.current) {
+      if (true) {
         return
       }
killedBy: SessionManager emits a warning toast after the idle warning threshold
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[NoCoverage] BlockStatement
src/app/auth/SessionManager.tsx:52:36
   const scheduleTimers = useCallback(() => {
     clearTimers()
     warningTimerRef.current = window.setTimeout(() => {
-      if (warningShownRef.current) {
-        return
-      }
+      if (warningShownRef.current) {}
       warningShownRef.current = true
       tracking.track(TRACKING_EVENT_SESSION_WARNING)

[Survived] BooleanLiteral
src/app/auth/SessionManager.tsx:55:33
       if (warningShownRef.current) {
         return
       }
-      warningShownRef.current = true
+      warningShownRef.current = false
       tracking.track(TRACKING_EVENT_SESSION_WARNING)
       publishToast({

[Killed] BlockStatement
src/app/auth/SessionManager.tsx:64:55
       })
     }, SESSION_IDLE_WARNING_MS)
 
-    timeoutTimerRef.current = window.setTimeout(() => {
-      publishToast({
-        titleKey: I18N_KEY_SESSION_EXPIRED_TITLE,
-        descriptionKey: I18N_KEY_SESSION_EXPIRED_BODY,
-        variant: NOTIFICATION_VARIANT_ERROR,
-      })
-      tracking.track(TRACKING_EVENT_SESSION_TIMEOUT)
-      logout()
-    }, SESSION_IDLE_TIMEOUT_MS)
+    timeoutTimerRef.current = window.setTimeout(() => {}, SESSION_IDLE_TIMEOUT_MS)
   }, [clearTimers, logout, publishToast, tracking])
 
killedBy: SessionManager logs out and notifies when the idle timeout expires
statusReason: expected "vi.fn()" to be called at least once

[Killed] ObjectLiteral
src/app/auth/SessionManager.tsx:65:20
     }, SESSION_IDLE_WARNING_MS)
 
     timeoutTimerRef.current = window.setTimeout(() => {
-      publishToast({
-        titleKey: I18N_KEY_SESSION_EXPIRED_TITLE,
-        descriptionKey: I18N_KEY_SESSION_EXPIRED_BODY,
-        variant: NOTIFICATION_VARIANT_ERROR,
-      })
+      publishToast({})
       tracking.track(TRACKING_EVENT_SESSION_TIMEOUT)
       logout()
killedBy: SessionManager logs out and notifies when the idle timeout expires
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/app/auth/SessionManager.tsx:75:19
     }, SESSION_IDLE_TIMEOUT_MS)
   }, [clearTimers, logout, publishToast, tracking])
 
-  useEffect(() => {
-    if (!isAuthenticated) {
-      clearTimers()
-      return
-    }
-
-    const handleActivity = () => {
-      warningShownRef.current = false
-      scheduleTimers()
-    }
-
-    ACTIVITY_EVENTS.forEach((eventName) => {
-      window.addEventListener(eventName, handleActivity, { passive: true })
-    })
-    document.addEventListener('visibilitychange', handleActivity)
-    scheduleTimers()
-
-    return () => {
-      clearTimers()
-      ACTIVITY_EVENTS.forEach((eventName) => {
-        window.removeEventListener(eventName, handleActivity)
-      })
-      document.removeEventListener('visibilitychange', handleActivity)
-    }
-  }, [clearTimers, isAuthenticated, scheduleTimers])
+  useEffect(() => {}, [clearTimers, isAuthenticated, scheduleTimers])
 
   return null
killedBy: SessionManager emits a warning toast after the idle warning threshold
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
src/app/auth/SessionManager.tsx:76:9
   }, [clearTimers, logout, publishToast, tracking])
 
   useEffect(() => {
-    if (!isAuthenticated) {
+    if (false) {
       clearTimers()
       return
killedBy: SessionManager does nothing when the user is not authenticated
statusReason: expected "vi.fn()" to not be called at all, but actually been called 2 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] BlockStatement
src/app/auth/SessionManager.tsx:76:27
   }, [clearTimers, logout, publishToast, tracking])
 
   useEffect(() => {
-    if (!isAuthenticated) {
-      clearTimers()
-      return
-    }
+    if (!isAuthenticated) {}
 
     const handleActivity = () => {
killedBy: SessionManager does nothing when the user is not authenticated
statusReason: expected "vi.fn()" to not be called at all, but actually been called 2 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] BlockStatement
src/app/auth/SessionManager.tsx:81:34
       return
     }
 
-    const handleActivity = () => {
-      warningShownRef.current = false
-      scheduleTimers()
-    }
+    const handleActivity = () => {}
 
     ACTIVITY_EVENTS.forEach((eventName) => {
killedBy: SessionManager resets timers when user activity is detected
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Survived] BooleanLiteral
src/app/auth/SessionManager.tsx:82:33
     }
 
     const handleActivity = () => {
-      warningShownRef.current = false
+      warningShownRef.current = true
       scheduleTimers()
     }

[Killed] BlockStatement
src/app/auth/SessionManager.tsx:86:44
       scheduleTimers()
     }
 
-    ACTIVITY_EVENTS.forEach((eventName) => {
-      window.addEventListener(eventName, handleActivity, { passive: true })
-    })
+    ACTIVITY_EVENTS.forEach((eventName) => {})
     document.addEventListener('visibilitychange', handleActivity)
     scheduleTimers()
killedBy: SessionManager resets timers when user activity is detected
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Survived] BooleanLiteral
src/app/auth/SessionManager.tsx:87:69
     }
 
     ACTIVITY_EVENTS.forEach((eventName) => {
-      window.addEventListener(eventName, handleActivity, { passive: true })
+      window.addEventListener(eventName, handleActivity, { passive: false })
     })
     document.addEventListener('visibilitychange', handleActivity)

[Survived] StringLiteral
src/app/auth/SessionManager.tsx:89:31
     ACTIVITY_EVENTS.forEach((eventName) => {
       window.addEventListener(eventName, handleActivity, { passive: true })
     })
-    document.addEventListener('visibilitychange', handleActivity)
+    document.addEventListener("", handleActivity)
     scheduleTimers()
 

[Survived] BlockStatement
src/app/auth/SessionManager.tsx:92:18
     document.addEventListener('visibilitychange', handleActivity)
     scheduleTimers()
 
-    return () => {
-      clearTimers()
-      ACTIVITY_EVENTS.forEach((eventName) => {
-        window.removeEventListener(eventName, handleActivity)
-      })
-      document.removeEventListener('visibilitychange', handleActivity)
-    }
+    return () => {}
   }, [clearTimers, isAuthenticated, scheduleTimers])
 

[Survived] BlockStatement
src/app/auth/SessionManager.tsx:94:46
 
     return () => {
       clearTimers()
-      ACTIVITY_EVENTS.forEach((eventName) => {
-        window.removeEventListener(eventName, handleActivity)
-      })
+      ACTIVITY_EVENTS.forEach((eventName) => {})
       document.removeEventListener('visibilitychange', handleActivity)
     }
