[Killed] ArrowFunction
src/app/auth/permissions.ts:16:36
 
 export type Permissions = Record<PermissionKey, boolean>
 
-export const createPermissionSet = (overrides: Partial<Permissions> = {}): Permissions => ({
-  viewDashboard: false,
-  manageLicenses: false,
-  manageProducts: false,
-  manageTenants: false,
-  manageUsers: false,
-  viewAnalytics: false,
-  ...overrides,
-})
+export const createPermissionSet = () => undefined
 
 const ALL_PERMISSIONS = createPermissionSet(
killedBy: AuthorizationProvider exposes derived permissions for the current user
statusReason: expected undefined to be true // Object.is equality

[Killed] ObjectLiteral
src/app/auth/permissions.ts:16:92
 
 export type Permissions = Record<PermissionKey, boolean>
 
-export const createPermissionSet = (overrides: Partial<Permissions> = {}): Permissions => ({
-  viewDashboard: false,
-  manageLicenses: false,
-  manageProducts: false,
-  manageTenants: false,
-  manageUsers: false,
-  viewAnalytics: false,
-  ...overrides,
-})
+export const createPermissionSet = (overrides: Partial<Permissions> = {}): Permissions => ({})
 
 const ALL_PERMISSIONS = createPermissionSet(
killedBy: AuthorizationProvider exposes derived permissions for the current user
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/app/auth/permissions.ts:17:18
 export type Permissions = Record<PermissionKey, boolean>
 
 export const createPermissionSet = (overrides: Partial<Permissions> = {}): Permissions => ({
-  viewDashboard: false,
+  viewDashboard: true,
   manageLicenses: false,
   manageProducts: false,
killedBy: derivePermissionsFromUser returns all permissions disabled for anonymous users
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/app/auth/permissions.ts:18:19
 
 export const createPermissionSet = (overrides: Partial<Permissions> = {}): Permissions => ({
   viewDashboard: false,
-  manageLicenses: false,
+  manageLicenses: true,
   manageProducts: false,
   manageTenants: false,
killedBy: derivePermissionsFromUser returns all permissions disabled for anonymous users
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/app/auth/permissions.ts:19:19
 export const createPermissionSet = (overrides: Partial<Permissions> = {}): Permissions => ({
   viewDashboard: false,
   manageLicenses: false,
-  manageProducts: false,
+  manageProducts: true,
   manageTenants: false,
   manageUsers: false,
killedBy: derivePermissionsFromUser returns all permissions disabled for anonymous users
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/app/auth/permissions.ts:20:18
   viewDashboard: false,
   manageLicenses: false,
   manageProducts: false,
-  manageTenants: false,
+  manageTenants: true,
   manageUsers: false,
   viewAnalytics: false,
killedBy: derivePermissionsFromUser returns all permissions disabled for anonymous users
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/app/auth/permissions.ts:21:16
   manageLicenses: false,
   manageProducts: false,
   manageTenants: false,
-  manageUsers: false,
+  manageUsers: true,
   viewAnalytics: false,
   ...overrides,
killedBy: derivePermissionsFromUser returns all permissions disabled for anonymous users
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/app/auth/permissions.ts:22:18
   manageProducts: false,
   manageTenants: false,
   manageUsers: false,
-  viewAnalytics: false,
+  viewAnalytics: true,
   ...overrides,
 })
killedBy: derivePermissionsFromUser returns all permissions disabled for anonymous users
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/app/auth/permissions.ts:27:62
 })
 
 const ALL_PERMISSIONS = createPermissionSet(
-  PERMISSION_KEYS.reduce<Partial<Permissions>>((acc, key) => {
-    acc[key] = true
-    return acc
-  }, {}),
+  PERMISSION_KEYS.reduce<Partial<Permissions>>((acc, key) => {}, {}),
 )
 
killedBy: derivePermissionsFromUser grants all permissions to privileged roles
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/app/auth/permissions.ts:28:16
 
 const ALL_PERMISSIONS = createPermissionSet(
   PERMISSION_KEYS.reduce<Partial<Permissions>>((acc, key) => {
-    acc[key] = true
+    acc[key] = false
     return acc
   }, {}),
killedBy: derivePermissionsFromUser grants all permissions to privileged roles
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/app/auth/permissions.ts:37:20
   SUPERUSER: ALL_PERMISSIONS,
   ADMIN: ALL_PERMISSIONS,
   VENDOR_MANAGER: createPermissionSet({
-    viewDashboard: true,
+    viewDashboard: false,
     manageLicenses: true,
     manageProducts: true,
killedBy: derivePermissionsFromUser grants scoped permissions to vendor roles
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/app/auth/permissions.ts:38:21
   ADMIN: ALL_PERMISSIONS,
   VENDOR_MANAGER: createPermissionSet({
     viewDashboard: true,
-    manageLicenses: true,
+    manageLicenses: false,
     manageProducts: true,
     manageTenants: true,

[Survived] BooleanLiteral
src/app/auth/permissions.ts:39:21
   VENDOR_MANAGER: createPermissionSet({
     viewDashboard: true,
     manageLicenses: true,
-    manageProducts: true,
+    manageProducts: false,
     manageTenants: true,
     viewAnalytics: true,

[Killed] BooleanLiteral
src/app/auth/permissions.ts:40:20
     viewDashboard: true,
     manageLicenses: true,
     manageProducts: true,
-    manageTenants: true,
+    manageTenants: false,
     viewAnalytics: true,
   }),
killedBy: derivePermissionsFromUser grants scoped permissions to vendor roles
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/app/auth/permissions.ts:41:20
     manageLicenses: true,
     manageProducts: true,
     manageTenants: true,
-    viewAnalytics: true,
+    viewAnalytics: false,
   }),
   VENDOR_ADMIN: createPermissionSet({

[Killed] ObjectLiteral
src/app/auth/permissions.ts:43:37
     manageTenants: true,
     viewAnalytics: true,
   }),
-  VENDOR_ADMIN: createPermissionSet({
-    viewDashboard: true,
-    manageLicenses: true,
-    manageProducts: true,
-    viewAnalytics: true,
-  }),
+  VENDOR_ADMIN: createPermissionSet({}),
   VIEWER: createPermissionSet({
     viewDashboard: true,
killedBy: derivePermissionsFromUser grants scoped permissions to vendor roles
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/app/auth/permissions.ts:44:20
     viewAnalytics: true,
   }),
   VENDOR_ADMIN: createPermissionSet({
-    viewDashboard: true,
+    viewDashboard: false,
     manageLicenses: true,
     manageProducts: true,

[Survived] BooleanLiteral
src/app/auth/permissions.ts:47:20
     viewDashboard: true,
     manageLicenses: true,
     manageProducts: true,
-    viewAnalytics: true,
+    viewAnalytics: false,
   }),
   VIEWER: createPermissionSet({

[Killed] BooleanLiteral
src/app/auth/permissions.ts:50:20
     viewAnalytics: true,
   }),
   VIEWER: createPermissionSet({
-    viewDashboard: true,
+    viewDashboard: false,
     viewAnalytics: true,
   }),
killedBy: AuthorizationProvider allows conditional permission checks
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/app/auth/permissions.ts:51:20
   }),
   VIEWER: createPermissionSet({
     viewDashboard: true,
-    viewAnalytics: true,
+    viewAnalytics: false,
   }),
 }
killedBy: derivePermissionsFromUser only allows read-only access for viewer role
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/app/auth/permissions.ts:57:104
 
 const DEFAULT_PERMISSIONS = createPermissionSet()
 
-export const derivePermissionsFromUser = (user: Pick<User, 'role'> | null | undefined): Permissions => {
-  if (!user?.role) {
-    return { ...DEFAULT_PERMISSIONS }
-  }
-  const rolePermissions = ROLE_PERMISSION_MATRIX[user.role]
-  if (!rolePermissions) {
-    return { ...DEFAULT_PERMISSIONS }
-  }
-  return { ...rolePermissions }
-}
+export const derivePermissionsFromUser = (user: Pick<User, 'role'> | null | undefined): Permissions => {}
 
 export const hasPermission = (permissions: Permissions, permission: PermissionKey): boolean => {
killedBy: AppProviders renders the dashboard heading by default
statusReason: Authorization context is unavailable

[Killed] BlockStatement
src/app/auth/permissions.ts:58:20
 const DEFAULT_PERMISSIONS = createPermissionSet()
 
 export const derivePermissionsFromUser = (user: Pick<User, 'role'> | null | undefined): Permissions => {
-  if (!user?.role) {
-    return { ...DEFAULT_PERMISSIONS }
-  }
+  if (!user?.role) {}
   const rolePermissions = ROLE_PERMISSION_MATRIX[user.role]
   if (!rolePermissions) {
killedBy: AuthProvider logs in and exposes authenticated user details
statusReason: Cannot read properties of null (reading 'role')

[Killed] ConditionalExpression
src/app/auth/permissions.ts:58:7
 const DEFAULT_PERMISSIONS = createPermissionSet()
 
 export const derivePermissionsFromUser = (user: Pick<User, 'role'> | null | undefined): Permissions => {
-  if (!user?.role) {
+  if (false) {
     return { ...DEFAULT_PERMISSIONS }
   }
killedBy: AuthProvider logs in and exposes authenticated user details
statusReason: Cannot read properties of null (reading 'role')

[Killed] ConditionalExpression
src/app/auth/permissions.ts:62:7
     return { ...DEFAULT_PERMISSIONS }
   }
   const rolePermissions = ROLE_PERMISSION_MATRIX[user.role]
-  if (!rolePermissions) {
+  if (true) {
     return { ...DEFAULT_PERMISSIONS }
   }
killedBy: derivePermissionsFromUser grants all permissions to privileged roles
statusReason: expected false to be true // Object.is equality

[Timeout] BooleanLiteral
src/app/auth/permissions.ts:62:7
     return { ...DEFAULT_PERMISSIONS }
   }
   const rolePermissions = ROLE_PERMISSION_MATRIX[user.role]
-  if (!rolePermissions) {
+  if (rolePermissions) {
     return { ...DEFAULT_PERMISSIONS }
   }

[Killed] BlockStatement
src/app/auth/permissions.ts:68:96
   return { ...rolePermissions }
 }
 
-export const hasPermission = (permissions: Permissions, permission: PermissionKey): boolean => {
-  return Boolean(permissions[permission])
-}
+export const hasPermission = (permissions: Permissions, permission: PermissionKey): boolean => {}
 
 
killedBy: hasPermission checks individual permission flags
statusReason: expected undefined to be true // Object.is equality
