[Killed] BlockStatement
src/app/auth/persistedAuth.ts:20:55
 
 export type PersistedAuthUser = User
 
-export const readPersistedAuth = (): PersistedAuth => {
-  if (!isBrowser) {
-    return { token: null, expiresAt: null }
-  }
-  const token = window.localStorage.getItem(STORAGE_KEY_AUTH_TOKEN)
-  const expiresAtRaw = window.localStorage.getItem(STORAGE_KEY_AUTH_EXPIRY)
-  const expiresAt = expiresAtRaw ? Number.parseInt(expiresAtRaw, 10) : null
-
-  if (expiresAt && expiresAt < Date.now()) {
-    window.localStorage.removeItem(STORAGE_KEY_AUTH_TOKEN)
-    window.localStorage.removeItem(STORAGE_KEY_AUTH_EXPIRY)
-    window.localStorage.removeItem(STORAGE_KEY_AUTH_USER)
-    return { token: null, expiresAt: null }
-  }
-
-  return { token, expiresAt }
-}
+export const readPersistedAuth = (): PersistedAuth => {}
 
 export const persistAuth = (token: string | null, expiresAt: number | null): void => {
killedBy: AppProviders renders the dashboard heading by default
statusReason: Cannot read properties of undefined (reading 'token')

[Killed] ConditionalExpression
src/app/auth/persistedAuth.ts:21:7
 export type PersistedAuthUser = User
 
 export const readPersistedAuth = (): PersistedAuth => {
-  if (!isBrowser) {
+  if (true) {
     return { token: null, expiresAt: null }
   }
killedBy: AppProviders renders the dashboard heading by default
statusReason: Unable to find an element with the text: Operational overview. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div>

[Killed] BooleanLiteral
src/app/auth/persistedAuth.ts:21:7
 export type PersistedAuthUser = User
 
 export const readPersistedAuth = (): PersistedAuth => {
-  if (!isBrowser) {
+  if (isBrowser) {
     return { token: null, expiresAt: null }
   }
killedBy: AppProviders renders the dashboard heading by default
statusReason: Unable to find an element with the text: Operational overview. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div>

[Killed] BlockStatement
src/app/auth/persistedAuth.ts:28:44
   const expiresAtRaw = window.localStorage.getItem(STORAGE_KEY_AUTH_EXPIRY)
   const expiresAt = expiresAtRaw ? Number.parseInt(expiresAtRaw, 10) : null
 
-  if (expiresAt && expiresAt < Date.now()) {
-    window.localStorage.removeItem(STORAGE_KEY_AUTH_TOKEN)
-    window.localStorage.removeItem(STORAGE_KEY_AUTH_EXPIRY)
-    window.localStorage.removeItem(STORAGE_KEY_AUTH_USER)
-    return { token: null, expiresAt: null }
-  }
+  if (expiresAt && expiresAt < Date.now()) {}
 
   return { token, expiresAt }
killedBy: AuthProvider removes expired persisted tokens during initialization
statusReason: expected 'authenticated' to be 'anonymous' // Object.is equality

[Killed] LogicalOperator
src/app/auth/persistedAuth.ts:28:7
   const expiresAtRaw = window.localStorage.getItem(STORAGE_KEY_AUTH_EXPIRY)
   const expiresAt = expiresAtRaw ? Number.parseInt(expiresAtRaw, 10) : null
 
-  if (expiresAt && expiresAt < Date.now()) {
+  if (expiresAt || expiresAt < Date.now()) {
     window.localStorage.removeItem(STORAGE_KEY_AUTH_TOKEN)
     window.localStorage.removeItem(STORAGE_KEY_AUTH_EXPIRY)
killedBy: AppProviders renders the dashboard heading by default
statusReason: Unable to find an element with the text: Operational overview. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div>

[Survived] ObjectLiteral
src/app/auth/persistedAuth.ts:32:12
     window.localStorage.removeItem(STORAGE_KEY_AUTH_TOKEN)
     window.localStorage.removeItem(STORAGE_KEY_AUTH_EXPIRY)
     window.localStorage.removeItem(STORAGE_KEY_AUTH_USER)
-    return { token: null, expiresAt: null }
+    return {}
   }
 

[Survived] BlockStatement
src/app/auth/persistedAuth.ts:38:86
   return { token, expiresAt }
 }
 
-export const persistAuth = (token: string | null, expiresAt: number | null): void => {
-  if (!isBrowser) {
-    return
-  }
-
-  if (token) {
-    window.localStorage.setItem(STORAGE_KEY_AUTH_TOKEN, token)
-  } else {
-    window.localStorage.removeItem(STORAGE_KEY_AUTH_TOKEN)
-  }
-
-  if (expiresAt) {
-    window.localStorage.setItem(STORAGE_KEY_AUTH_EXPIRY, `${expiresAt}`)
-  } else {
-    window.localStorage.removeItem(STORAGE_KEY_AUTH_EXPIRY)
-  }
-}
+export const persistAuth = (token: string | null, expiresAt: number | null): void => {}
 
 export const readPersistedUser = (): PersistedAuthUser | null => {

[Survived] ConditionalExpression
src/app/auth/persistedAuth.ts:39:7
 }
 
 export const persistAuth = (token: string | null, expiresAt: number | null): void => {
-  if (!isBrowser) {
+  if (false) {
     return
   }

[NoCoverage] BlockStatement
src/app/auth/persistedAuth.ts:39:19
 }
 
 export const persistAuth = (token: string | null, expiresAt: number | null): void => {
-  if (!isBrowser) {
-    return
-  }
+  if (!isBrowser) {}
 
   if (token) {

[Survived] BlockStatement
src/app/auth/persistedAuth.ts:43:14
     return
   }
 
-  if (token) {
-    window.localStorage.setItem(STORAGE_KEY_AUTH_TOKEN, token)
-  } else {
+  if (token) {} else {
     window.localStorage.removeItem(STORAGE_KEY_AUTH_TOKEN)
   }

[Survived] BlockStatement
src/app/auth/persistedAuth.ts:45:10
 
   if (token) {
     window.localStorage.setItem(STORAGE_KEY_AUTH_TOKEN, token)
-  } else {
-    window.localStorage.removeItem(STORAGE_KEY_AUTH_TOKEN)
-  }
+  } else {}
 
   if (expiresAt) {

[Killed] ConditionalExpression
src/app/auth/persistedAuth.ts:49:7
     window.localStorage.removeItem(STORAGE_KEY_AUTH_TOKEN)
   }
 
-  if (expiresAt) {
+  if (true) {
     window.localStorage.setItem(STORAGE_KEY_AUTH_EXPIRY, `${expiresAt}`)
   } else {
killedBy: devScenarios clears all stored auth state
statusReason: expected 'null' to be null

[Survived] BlockStatement
src/app/auth/persistedAuth.ts:49:18
     window.localStorage.removeItem(STORAGE_KEY_AUTH_TOKEN)
   }
 
-  if (expiresAt) {
-    window.localStorage.setItem(STORAGE_KEY_AUTH_EXPIRY, `${expiresAt}`)
-  } else {
+  if (expiresAt) {} else {
     window.localStorage.removeItem(STORAGE_KEY_AUTH_EXPIRY)
   }

[Survived] BlockStatement
src/app/auth/persistedAuth.ts:51:10
 
   if (expiresAt) {
     window.localStorage.setItem(STORAGE_KEY_AUTH_EXPIRY, `${expiresAt}`)
-  } else {
-    window.localStorage.removeItem(STORAGE_KEY_AUTH_EXPIRY)
-  }
+  } else {}
 }
 

[Timeout] BlockStatement
src/app/auth/persistedAuth.ts:56:66
   }
 }
 
-export const readPersistedUser = (): PersistedAuthUser | null => {
-  if (!isBrowser) {
-    return null
-  }
-  const raw = window.localStorage.getItem(STORAGE_KEY_AUTH_USER)
-  if (!raw) {
-    return null
-  }
-  try {
-    return JSON.parse(raw) as PersistedAuthUser
-  } catch {
-    window.localStorage.removeItem(STORAGE_KEY_AUTH_USER)
-    return null
-  }
-}
+export const readPersistedUser = (): PersistedAuthUser | null => {}
 
 export const persistAuthUser = (user: PersistedAuthUser | null): void => {

[Timeout] BooleanLiteral
src/app/auth/persistedAuth.ts:57:7
 }
 
 export const readPersistedUser = (): PersistedAuthUser | null => {
-  if (!isBrowser) {
+  if (isBrowser) {
     return null
   }

[Timeout] ConditionalExpression
src/app/auth/persistedAuth.ts:57:7
 }
 
 export const readPersistedUser = (): PersistedAuthUser | null => {
-  if (!isBrowser) {
+  if (true) {
     return null
   }

[Survived] ConditionalExpression
src/app/auth/persistedAuth.ts:61:7
     return null
   }
   const raw = window.localStorage.getItem(STORAGE_KEY_AUTH_USER)
-  if (!raw) {
+  if (false) {
     return null
   }

[NoCoverage] BlockStatement
src/app/auth/persistedAuth.ts:61:13
     return null
   }
   const raw = window.localStorage.getItem(STORAGE_KEY_AUTH_USER)
-  if (!raw) {
-    return null
-  }
+  if (!raw) {}
   try {
     return JSON.parse(raw) as PersistedAuthUser

[Timeout] BlockStatement
src/app/auth/persistedAuth.ts:64:7
   if (!raw) {
     return null
   }
-  try {
-    return JSON.parse(raw) as PersistedAuthUser
-  } catch {
+  try {} catch {
     window.localStorage.removeItem(STORAGE_KEY_AUTH_USER)
     return null

[NoCoverage] BlockStatement
src/app/auth/persistedAuth.ts:66:11
   }
   try {
     return JSON.parse(raw) as PersistedAuthUser
-  } catch {
-    window.localStorage.removeItem(STORAGE_KEY_AUTH_USER)
-    return null
-  }
+  } catch {}
 }
 

[Survived] BlockStatement
src/app/auth/persistedAuth.ts:72:74
   }
 }
 
-export const persistAuthUser = (user: PersistedAuthUser | null): void => {
-  if (!isBrowser) {
-    return
-  }
-  if (user) {
-    window.localStorage.setItem(STORAGE_KEY_AUTH_USER, JSON.stringify(user))
-  } else {
-    window.localStorage.removeItem(STORAGE_KEY_AUTH_USER)
-  }
-}
+export const persistAuthUser = (user: PersistedAuthUser | null): void => {}
 
 

[Survived] BooleanLiteral
src/app/auth/persistedAuth.ts:73:7
 }
 
 export const persistAuthUser = (user: PersistedAuthUser | null): void => {
-  if (!isBrowser) {
+  if (isBrowser) {
     return
   }

[Survived] ConditionalExpression
src/app/auth/persistedAuth.ts:73:7
 }
 
 export const persistAuthUser = (user: PersistedAuthUser | null): void => {
-  if (!isBrowser) {
+  if (true) {
     return
   }

[Survived] BlockStatement
src/app/auth/persistedAuth.ts:76:13
   if (!isBrowser) {
     return
   }
-  if (user) {
-    window.localStorage.setItem(STORAGE_KEY_AUTH_USER, JSON.stringify(user))
-  } else {
+  if (user) {} else {
     window.localStorage.removeItem(STORAGE_KEY_AUTH_USER)
   }

[Survived] BlockStatement
src/app/auth/persistedAuth.ts:78:10
   }
   if (user) {
     window.localStorage.setItem(STORAGE_KEY_AUTH_USER, JSON.stringify(user))
-  } else {
-    window.localStorage.removeItem(STORAGE_KEY_AUTH_USER)
-  }
+  } else {}
 }
 
