[Killed] BlockStatement
src/app/auth/useAuthorization.ts:7:50
 import { AuthorizationContext } from './authorizationContext'
 import type { PermissionKey, Permissions } from './permissions'
 
-export const usePermissions = (): Permissions => {
-  const context = useContext(AuthorizationContext)
-  if (!context) {
-    throw new Error(ERROR_MESSAGE_AUTHORIZATION_CONTEXT_UNAVAILABLE)
-  }
-  return context
-}
+export const usePermissions = (): Permissions => {}
 
 export const useCan = (permission: PermissionKey): boolean => {
killedBy: useAbility returns an ability instance when wrapped in AbilityProvider
statusReason: Cannot read properties of undefined (reading 'viewDashboard')

[Killed] BlockStatement
src/app/auth/useAuthorization.ts:9:17
 
 export const usePermissions = (): Permissions => {
   const context = useContext(AuthorizationContext)
-  if (!context) {
-    throw new Error(ERROR_MESSAGE_AUTHORIZATION_CONTEXT_UNAVAILABLE)
-  }
+  if (!context) {}
   return context
 }
killedBy: AuthorizationProvider throws when hooks are used outside the provider
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/app/auth/useAuthorization.ts:9:7
 
 export const usePermissions = (): Permissions => {
   const context = useContext(AuthorizationContext)
-  if (!context) {
+  if (context) {
     throw new Error(ERROR_MESSAGE_AUTHORIZATION_CONTEXT_UNAVAILABLE)
   }
killedBy: useAbility returns an ability instance when wrapped in AbilityProvider
statusReason: Authorization context is unavailable

[Killed] BlockStatement
src/app/auth/useAuthorization.ts:15:63
   return context
 }
 
-export const useCan = (permission: PermissionKey): boolean => {
-  const permissions = usePermissions()
-  return permissions[permission] ?? false
-}
+export const useCan = (permission: PermissionKey): boolean => {}
 
 
killedBy: AuthorizationProvider allows conditional permission checks
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/app/auth/useAuthorization.ts:17:10
 
 export const useCan = (permission: PermissionKey): boolean => {
   const permissions = usePermissions()
-  return permissions[permission] ?? false
+  return permissions[permission] && false
 }
 
killedBy: AuthorizationProvider allows conditional permission checks
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/app/auth/useAuthorization.ts:17:37
 
 export const useCan = (permission: PermissionKey): boolean => {
   const permissions = usePermissions()
-  return permissions[permission] ?? false
+  return permissions[permission] ?? true
 }
 
