[Survived] ObjectLiteral
src/app/dev/devScenarios.ts:36:28
 }
 
 const DEV_PERSONAS: Record<DevPersonaKey, DevPersona> = {
-  [DEV_PERSONA_SUPERUSER]: {
-    token: DEV_PERSONA_SUPERUSER_TOKEN,
-    expiresInHours: 12,
-    user: {
-      id: DEV_PERSONA_SUPERUSER_ID,
-      username: DEV_PERSONA_SUPERUSER_USERNAME,
-      email: DEV_PERSONA_SUPERUSER_EMAIL,
-      role: 'SUPERUSER',
-    },
-  },
+  [DEV_PERSONA_SUPERUSER]: {},
   [DEV_PERSONA_SUPPORT]: {
     token: DEV_PERSONA_SUPPORT_TOKEN,

[Survived] StringLiteral
src/app/dev/devScenarios.ts:43:13
       id: DEV_PERSONA_SUPERUSER_ID,
       username: DEV_PERSONA_SUPERUSER_USERNAME,
       email: DEV_PERSONA_SUPERUSER_EMAIL,
-      role: 'SUPERUSER',
+      role: "",
     },
   },

[Killed] ConditionalExpression
src/app/dev/devScenarios.ts:68:76
   },
 }
 
-const isDevEnvironment = (mode: string = import.meta.env.MODE): boolean => mode !== 'production'
+const isDevEnvironment = (mode: string = import.meta.env.MODE): boolean => true
 
 export const DEV_PERSONA_KEYS: DevPersonaKey[] = [
killedBy: devScenarios does not persist persona data outside dev environments
statusReason: expected "persistAuth" to not be called at all, but actually been called 1 times

Received: 

  1st persistAuth call:

    Array [
      "dev-token-superuser",

[Killed] ArrowFunction
src/app/dev/devScenarios.ts:68:26
   },
 }
 
-const isDevEnvironment = (mode: string = import.meta.env.MODE): boolean => mode !== 'production'
+const isDevEnvironment = () => undefined
 
 export const DEV_PERSONA_KEYS: DevPersonaKey[] = [
killedBy: devScenarios persists auth artifacts for a selected persona
statusReason: expected "persistAuth" to be called 1 times, but got 0 times

[Killed] ArrayDeclaration
src/app/dev/devScenarios.ts:70:50
 
 const isDevEnvironment = (mode: string = import.meta.env.MODE): boolean => mode !== 'production'
 
-export const DEV_PERSONA_KEYS: DevPersonaKey[] = [
-  DEV_PERSONA_SUPERUSER,
-  DEV_PERSONA_SUPPORT,
-  DEV_PERSONA_VIEWER,
-]
+export const DEV_PERSONA_KEYS: DevPersonaKey[] = []
 
 export const applyDevPersona = (persona: DevPersonaKey, mode?: string): void => {
killedBy: devScenarios lists all supported persona keys
statusReason: expected [] to include 'dev.persona.superuser'

[Killed] BlockStatement
src/app/dev/devScenarios.ts:76:81
   DEV_PERSONA_VIEWER,
 ]
 
-export const applyDevPersona = (persona: DevPersonaKey, mode?: string): void => {
-  if (!isDevEnvironment(mode)) {
-    return
-  }
-  const definition = DEV_PERSONAS[persona]
-  if (!definition) {
-    return
-  }
-  const expiresAt = Date.now() + definition.expiresInHours * 60 * 60 * 1_000
-  persistAuth(definition.token, expiresAt)
-  persistAuthUser(definition.user)
-}
+export const applyDevPersona = (persona: DevPersonaKey, mode?: string): void => {}
 
 export const clearDevPersona = (): void => {
killedBy: devScenarios persists auth artifacts for a selected persona
statusReason: expected "persistAuth" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/app/dev/devScenarios.ts:77:7
 ]
 
 export const applyDevPersona = (persona: DevPersonaKey, mode?: string): void => {
-  if (!isDevEnvironment(mode)) {
+  if (false) {
     return
   }
killedBy: devScenarios does not persist persona data outside dev environments
statusReason: expected "persistAuth" to not be called at all, but actually been called 1 times

Received: 

  1st persistAuth call:

    Array [
      "dev-token-superuser",

[Killed] BooleanLiteral
src/app/dev/devScenarios.ts:77:7
 ]
 
 export const applyDevPersona = (persona: DevPersonaKey, mode?: string): void => {
-  if (!isDevEnvironment(mode)) {
+  if (isDevEnvironment(mode)) {
     return
   }
killedBy: devScenarios persists auth artifacts for a selected persona
statusReason: expected "persistAuth" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/app/dev/devScenarios.ts:81:7
     return
   }
   const definition = DEV_PERSONAS[persona]
-  if (!definition) {
+  if (definition) {
     return
   }
killedBy: devScenarios persists auth artifacts for a selected persona
statusReason: expected "persistAuth" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/app/dev/devScenarios.ts:81:7
     return
   }
   const definition = DEV_PERSONAS[persona]
-  if (!definition) {
+  if (false) {
     return
   }
killedBy: devScenarios ignores unknown persona keys gracefully
statusReason: Cannot read properties of undefined (reading 'expiresInHours')

[Survived] ArithmeticOperator
src/app/dev/devScenarios.ts:84:34
   if (!definition) {
     return
   }
-  const expiresAt = Date.now() + definition.expiresInHours * 60 * 60 * 1_000
+  const expiresAt = Date.now() + definition.expiresInHours * 60 / 60 * 1_000
   persistAuth(definition.token, expiresAt)
   persistAuthUser(definition.user)

[Survived] ArithmeticOperator
src/app/dev/devScenarios.ts:84:21
   if (!definition) {
     return
   }
-  const expiresAt = Date.now() + definition.expiresInHours * 60 * 60 * 1_000
+  const expiresAt = Date.now() - definition.expiresInHours * 60 * 60 * 1_000
   persistAuth(definition.token, expiresAt)
   persistAuthUser(definition.user)

[Killed] BlockStatement
src/app/dev/devScenarios.ts:89:44
   persistAuthUser(definition.user)
 }
 
-export const clearDevPersona = (): void => {
-  if (typeof window === 'undefined') {
-    return
-  }
-  window.localStorage.removeItem(STORAGE_KEY_AUTH_TOKEN)
-  window.localStorage.removeItem(STORAGE_KEY_AUTH_EXPIRY)
-  window.localStorage.removeItem(STORAGE_KEY_AUTH_USER)
-  persistAuth(null, null)
-  persistAuthUser(null)
-}
+export const clearDevPersona = (): void => {}
 
 export const canUseDevTools = (flagEnabled: boolean, mode?: string): boolean => {
killedBy: devScenarios clears all stored auth state
statusReason: expected 'token' to be null

[Killed] EqualityOperator
src/app/dev/devScenarios.ts:90:7
 }
 
 export const clearDevPersona = (): void => {
-  if (typeof window === 'undefined') {
+  if (typeof window !== 'undefined') {
     return
   }
killedBy: devScenarios clears all stored auth state
statusReason: expected 'token' to be null

[Killed] ConditionalExpression
src/app/dev/devScenarios.ts:90:7
 }
 
 export const clearDevPersona = (): void => {
-  if (typeof window === 'undefined') {
+  if (true) {
     return
   }
killedBy: devScenarios clears all stored auth state
statusReason: expected 'token' to be null

[Killed] BlockStatement
src/app/dev/devScenarios.ts:100:81
   persistAuthUser(null)
 }
 
-export const canUseDevTools = (flagEnabled: boolean, mode?: string): boolean => {
-  return flagEnabled && isDevEnvironment(mode)
-}
+export const canUseDevTools = (flagEnabled: boolean, mode?: string): boolean => {}
 
 
killedBy: devScenarios enables dev tools only when flag and mode allow
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/app/dev/devScenarios.ts:101:10
 }
 
 export const canUseDevTools = (flagEnabled: boolean, mode?: string): boolean => {
-  return flagEnabled && isDevEnvironment(mode)
+  return flagEnabled || isDevEnvironment(mode)
 }
 
killedBy: devScenarios enables dev tools only when flag and mode allow
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/app/dev/devScenarios.ts:101:10
 }
 
 export const canUseDevTools = (flagEnabled: boolean, mode?: string): boolean => {
-  return flagEnabled && isDevEnvironment(mode)
+  return false
 }
 
killedBy: devScenarios enables dev tools only when flag and mode allow
statusReason: expected false to be true // Object.is equality
