[Survived] BlockStatement
src/app/i18n/I18nProvider.tsx:16:38
 } from '../constants'
 import { defaultResources } from './resources'
 
-const createI18nClient = (): i18n => {
-  const client = i18next.createInstance({
-    lng: APP_DEFAULT_LANGUAGE,
-    fallbackLng: APP_I18N_FALLBACK_NAMESPACE,
-    supportedLngs: APP_SUPPORTED_LANGUAGES,
-    defaultNS: APP_I18N_DEFAULT_NAMESPACE,
-    ns: [APP_I18N_DEFAULT_NAMESPACE],
-    load: 'languageOnly',
-    interpolation: {
-      escapeValue: false,
-    },
-    resources: defaultResources,
-  })
-
-  client.use(initReactI18next)
-
-  return client
-}
+const createI18nClient = (): i18n => {}
 
 const i18nClient = createI18nClient()

[Survived] ArrayDeclaration
src/app/i18n/I18nProvider.tsx:22:9
     fallbackLng: APP_I18N_FALLBACK_NAMESPACE,
     supportedLngs: APP_SUPPORTED_LANGUAGES,
     defaultNS: APP_I18N_DEFAULT_NAMESPACE,
-    ns: [APP_I18N_DEFAULT_NAMESPACE],
+    ns: [],
     load: 'languageOnly',
     interpolation: {

[Survived] StringLiteral
src/app/i18n/I18nProvider.tsx:23:11
     supportedLngs: APP_SUPPORTED_LANGUAGES,
     defaultNS: APP_I18N_DEFAULT_NAMESPACE,
     ns: [APP_I18N_DEFAULT_NAMESPACE],
-    load: 'languageOnly',
+    load: "",
     interpolation: {
       escapeValue: false,

[Killed] BlockStatement
src/app/i18n/I18nProvider.tsx:42:73
   language?: SupportedLanguage
 }>
 
-export function I18nProvider({ children, language }: I18nProviderProps) {
-  const [isReady, setIsReady] = useState(i18nClient.isInitialized)
-
-  useEffect(() => {
-    if (!isReady) {
-      void initializationPromise.then(() => {
-        setIsReady(true)
-      })
-    }
-  }, [isReady])
-
-  useEffect(() => {
-    if (language && language !== i18nClient.language) {
-      void i18nClient.changeLanguage(language)
-    }
-  }, [language])
-
-  const contextValue = useMemo(() => i18nClient, [])
-
-  if (!isReady) {
-    return null
-  }
-
-  return <I18nextProvider i18n={contextValue}>{children}</I18nextProvider>
-}
+export function I18nProvider({ children, language }: I18nProviderProps) {}
 
 
killedBy: SelectField renders localized options and placeholder text
statusReason: Unable to find an accessible element with the role "option" and name "Select a tenant"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] BlockStatement
src/app/i18n/I18nProvider.tsx:45:19
 export function I18nProvider({ children, language }: I18nProviderProps) {
   const [isReady, setIsReady] = useState(i18nClient.isInitialized)
 
-  useEffect(() => {
-    if (!isReady) {
-      void initializationPromise.then(() => {
-        setIsReady(true)
-      })
-    }
-  }, [isReady])
+  useEffect(() => {}, [isReady])
 
   useEffect(() => {

[Survived] BooleanLiteral
src/app/i18n/I18nProvider.tsx:46:9
   const [isReady, setIsReady] = useState(i18nClient.isInitialized)
 
   useEffect(() => {
-    if (!isReady) {
+    if (isReady) {
       void initializationPromise.then(() => {
         setIsReady(true)

[Survived] ConditionalExpression
src/app/i18n/I18nProvider.tsx:46:9
   const [isReady, setIsReady] = useState(i18nClient.isInitialized)
 
   useEffect(() => {
-    if (!isReady) {
+    if (false) {
       void initializationPromise.then(() => {
         setIsReady(true)

[NoCoverage] BlockStatement
src/app/i18n/I18nProvider.tsx:47:45
 
   useEffect(() => {
     if (!isReady) {
-      void initializationPromise.then(() => {
-        setIsReady(true)
-      })
+      void initializationPromise.then(() => {})
     }
   }, [isReady])

[NoCoverage] BooleanLiteral
src/app/i18n/I18nProvider.tsx:48:20
   useEffect(() => {
     if (!isReady) {
       void initializationPromise.then(() => {
-        setIsReady(true)
+        setIsReady(false)
       })
     }

[Survived] BlockStatement
src/app/i18n/I18nProvider.tsx:53:19
     }
   }, [isReady])
 
-  useEffect(() => {
-    if (language && language !== i18nClient.language) {
-      void i18nClient.changeLanguage(language)
-    }
-  }, [language])
+  useEffect(() => {}, [language])
 
   const contextValue = useMemo(() => i18nClient, [])

[Survived] ConditionalExpression
src/app/i18n/I18nProvider.tsx:54:9
   }, [isReady])
 
   useEffect(() => {
-    if (language && language !== i18nClient.language) {
+    if (true) {
       void i18nClient.changeLanguage(language)
     }

[Survived] ConditionalExpression
src/app/i18n/I18nProvider.tsx:54:9
   }, [isReady])
 
   useEffect(() => {
-    if (language && language !== i18nClient.language) {
+    if (false) {
       void i18nClient.changeLanguage(language)
     }

[Survived] ArrayDeclaration
src/app/i18n/I18nProvider.tsx:57:6
     if (language && language !== i18nClient.language) {
       void i18nClient.changeLanguage(language)
     }
-  }, [language])
+  }, [])
 
   const contextValue = useMemo(() => i18nClient, [])

[Survived] ArrowFunction
src/app/i18n/I18nProvider.tsx:59:32
     }
   }, [language])
 
-  const contextValue = useMemo(() => i18nClient, [])
+  const contextValue = useMemo(() => undefined, [])
 
   if (!isReady) {

[Survived] ArrayDeclaration
src/app/i18n/I18nProvider.tsx:59:50
     }
   }, [language])
 
-  const contextValue = useMemo(() => i18nClient, [])
+  const contextValue = useMemo(() => i18nClient, ["Stryker was here"])
 
   if (!isReady) {

[Killed] BooleanLiteral
src/app/i18n/I18nProvider.tsx:61:7
 
   const contextValue = useMemo(() => i18nClient, [])
 
-  if (!isReady) {
+  if (isReady) {
     return null
   }
killedBy: AppForm renders validation errors when fields are missing
statusReason: Unable to find an element with the text: submit. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/app/i18n/I18nProvider.tsx:61:7
 
   const contextValue = useMemo(() => i18nClient, [])
 
-  if (!isReady) {
+  if (true) {
     return null
   }
killedBy: AppForm renders validation errors when fields are missing
statusReason: Unable to find an element with the text: submit. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
