[Killed] BlockStatement
src/app/lists/listState.ts:17:68
 import type { ListFilterState, ListPaginationState, ListSortDirection, ListState } from './listTypes'
 import { DEFAULT_LIST_STATE } from './listTypes'
 
-const clamp = (value: number, min: number, max: number): number => {
-  if (Number.isNaN(value)) {
-    return min
-  }
-  return Math.min(Math.max(value, min), max)
-}
+const clamp = (value: number, min: number, max: number): number => {}
 
 const normalizePage = (page?: number): number => {
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected 'undefined' to be '3' // Object.is equality

[Killed] ConditionalExpression
src/app/lists/listState.ts:18:7
 import { DEFAULT_LIST_STATE } from './listTypes'
 
 const clamp = (value: number, min: number, max: number): number => {
-  if (Number.isNaN(value)) {
+  if (true) {
     return min
   }
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected '1' to be '3' // Object.is equality

[NoCoverage] BlockStatement
src/app/lists/listState.ts:18:28
 import { DEFAULT_LIST_STATE } from './listTypes'
 
 const clamp = (value: number, min: number, max: number): number => {
-  if (Number.isNaN(value)) {
-    return min
-  }
+  if (Number.isNaN(value)) {}
   return Math.min(Math.max(value, min), max)
 }

[Killed] MethodExpression
src/app/lists/listState.ts:21:19
   if (Number.isNaN(value)) {
     return min
   }
-  return Math.min(Math.max(value, min), max)
+  return Math.min(Math.min(value, min), max)
 }
 
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected '1' to be '3' // Object.is equality

[Killed] MethodExpression
src/app/lists/listState.ts:21:10
   if (Number.isNaN(value)) {
     return min
   }
-  return Math.min(Math.max(value, min), max)
+  return Math.max(Math.max(value, min), max)
 }
 
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected '9007199254740991' to be '3' // Object.is equality

[Killed] BlockStatement
src/app/lists/listState.ts:24:50
   return Math.min(Math.max(value, min), max)
 }
 
-const normalizePage = (page?: number): number => {
-  if (typeof page !== 'number' || Number.isNaN(page)) {
-    return LIST_DEFAULT_PAGE
-  }
-  return clamp(Math.floor(page), LIST_DEFAULT_PAGE, Number.MAX_SAFE_INTEGER)
-}
+const normalizePage = (page?: number): number => {}
 
 const normalizePageSize = (pageSize?: number): number => {
killedBy: list state helpers creates a list state with defaults
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/app/lists/listState.ts:25:7
 }
 
 const normalizePage = (page?: number): number => {
-  if (typeof page !== 'number' || Number.isNaN(page)) {
+  if (true) {
     return LIST_DEFAULT_PAGE
   }
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected '1' to be '3' // Object.is equality

[Killed] EqualityOperator
src/app/lists/listState.ts:25:7
 }
 
 const normalizePage = (page?: number): number => {
-  if (typeof page !== 'number' || Number.isNaN(page)) {
+  if (typeof page === 'number' || Number.isNaN(page)) {
     return LIST_DEFAULT_PAGE
   }
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected '1' to be '3' // Object.is equality

[Killed] BlockStatement
src/app/lists/listState.ts:31:58
   return clamp(Math.floor(page), LIST_DEFAULT_PAGE, Number.MAX_SAFE_INTEGER)
 }
 
-const normalizePageSize = (pageSize?: number): number => {
-  if (typeof pageSize !== 'number' || Number.isNaN(pageSize)) {
-    return LIST_DEFAULT_PAGE_SIZE
-  }
-  return clamp(Math.floor(pageSize), 1, LIST_MAX_PAGE_SIZE)
-}
+const normalizePageSize = (pageSize?: number): number => {}
 
 const isValidDirection = (direction?: string): direction is ListSortDirection =>
killedBy: list state helpers creates a list state with defaults
statusReason: expected undefined to be 25 // Object.is equality

[Killed] ConditionalExpression
src/app/lists/listState.ts:32:7
 }
 
 const normalizePageSize = (pageSize?: number): number => {
-  if (typeof pageSize !== 'number' || Number.isNaN(pageSize)) {
+  if (true) {
     return LIST_DEFAULT_PAGE_SIZE
   }
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected '25' to be '50' // Object.is equality

[Killed] BlockStatement
src/app/lists/listState.ts:32:63
 }
 
 const normalizePageSize = (pageSize?: number): number => {
-  if (typeof pageSize !== 'number' || Number.isNaN(pageSize)) {
-    return LIST_DEFAULT_PAGE_SIZE
-  }
+  if (typeof pageSize !== 'number' || Number.isNaN(pageSize)) {}
   return clamp(Math.floor(pageSize), 1, LIST_MAX_PAGE_SIZE)
 }
killedBy: list state helpers creates a list state with defaults
statusReason: expected 1 to be 25 // Object.is equality

[Killed] ArrowFunction
src/app/lists/listState.ts:38:26
   return clamp(Math.floor(pageSize), 1, LIST_MAX_PAGE_SIZE)
 }
 
-const isValidDirection = (direction?: string): direction is ListSortDirection =>
-  direction === LIST_SORT_DIRECTION_ASC || direction === LIST_SORT_DIRECTION_DESC
+const isValidDirection = () => undefined
 
 export const createListState = (partial: Partial<ListState> = {}): ListState => {
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] ConditionalExpression
src/app/lists/listState.ts:39:3
 }
 
 const isValidDirection = (direction?: string): direction is ListSortDirection =>
-  direction === LIST_SORT_DIRECTION_ASC || direction === LIST_SORT_DIRECTION_DESC
+  false
 
 export const createListState = (partial: Partial<ListState> = {}): ListState => {
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] EqualityOperator
src/app/lists/listState.ts:39:44
 }
 
 const isValidDirection = (direction?: string): direction is ListSortDirection =>
-  direction === LIST_SORT_DIRECTION_ASC || direction === LIST_SORT_DIRECTION_DESC
+  direction === LIST_SORT_DIRECTION_ASC || direction !== LIST_SORT_DIRECTION_DESC
 
 export const createListState = (partial: Partial<ListState> = {}): ListState => {
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] BlockStatement
src/app/lists/listState.ts:41:81
 const isValidDirection = (direction?: string): direction is ListSortDirection =>
   direction === LIST_SORT_DIRECTION_ASC || direction === LIST_SORT_DIRECTION_DESC
 
-export const createListState = (partial: Partial<ListState> = {}): ListState => {
-  const paginationOverride: Partial<ListPaginationState> = partial.pagination ?? {}
-  const page = normalizePage(paginationOverride.page)
-  const pageSize = normalizePageSize(paginationOverride.pageSize)
-  const sort = partial.sort ?? null
-  const search = partial.search?.trim() ? partial.search.trim() : null
-
-  return {
-    pagination: {
-      page,
-      pageSize,
-    },
-    sort,
-    search,
-    filters: partial.filters ?? {},
-  }
-}
+export const createListState = (partial: Partial<ListState> = {}): ListState => {}
 
 export const serializeListState = (state: ListState): URLSearchParams => {
killedBy: list state helpers creates a list state with defaults
statusReason: Cannot read properties of undefined (reading 'pagination')

[Killed] LogicalOperator
src/app/lists/listState.ts:42:60
   direction === LIST_SORT_DIRECTION_ASC || direction === LIST_SORT_DIRECTION_DESC
 
 export const createListState = (partial: Partial<ListState> = {}): ListState => {
-  const paginationOverride: Partial<ListPaginationState> = partial.pagination ?? {}
+  const paginationOverride: Partial<ListPaginationState> = partial.pagination && {}
   const page = normalizePage(paginationOverride.page)
   const pageSize = normalizePageSize(paginationOverride.pageSize)
killedBy: list state helpers creates a list state with defaults
statusReason: Cannot read properties of undefined (reading 'page')

[Killed] LogicalOperator
src/app/lists/listState.ts:45:16
   const paginationOverride: Partial<ListPaginationState> = partial.pagination ?? {}
   const page = normalizePage(paginationOverride.page)
   const pageSize = normalizePageSize(paginationOverride.pageSize)
-  const sort = partial.sort ?? null
+  const sort = partial.sort && null
   const search = partial.search?.trim() ? partial.search.trim() : null
 
killedBy: list state helpers creates a list state with defaults
statusReason: expected undefined to be null

[Killed] OptionalChaining
src/app/lists/listState.ts:46:18
   const page = normalizePage(paginationOverride.page)
   const pageSize = normalizePageSize(paginationOverride.pageSize)
   const sort = partial.sort ?? null
-  const search = partial.search?.trim() ? partial.search.trim() : null
+  const search = partial.search.trim() ? partial.search.trim() : null
 
   return {
killedBy: list state helpers creates a list state with defaults
statusReason: Cannot read properties of undefined (reading 'trim')

[Survived] MethodExpression
src/app/lists/listState.ts:46:18
   const page = normalizePage(paginationOverride.page)
   const pageSize = normalizePageSize(paginationOverride.pageSize)
   const sort = partial.sort ?? null
-  const search = partial.search?.trim() ? partial.search.trim() : null
+  const search = partial.search ? partial.search.trim() : null
 
   return {

[Killed] LogicalOperator
src/app/lists/listState.ts:55:14
     },
     sort,
     search,
-    filters: partial.filters ?? {},
+    filters: partial.filters && {},
   }
 }
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected null to be 'ACTIVE,SUSPENDED' // Object.is equality

[Killed] StringLiteral
src/app/lists/listState.ts:62:42
 export const serializeListState = (state: ListState): URLSearchParams => {
   const params = new URLSearchParams()
   params.set(LIST_QUERY_PARAM_PAGE, `${state.pagination.page}`)
-  params.set(LIST_QUERY_PARAM_PAGE_SIZE, `${state.pagination.pageSize}`)
+  params.set(LIST_QUERY_PARAM_PAGE_SIZE, ``)
 
   if (state.sort?.field) {
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected '' to be '50' // Object.is equality

[Killed] ConditionalExpression
src/app/lists/listState.ts:64:7
   params.set(LIST_QUERY_PARAM_PAGE, `${state.pagination.page}`)
   params.set(LIST_QUERY_PARAM_PAGE_SIZE, `${state.pagination.pageSize}`)
 
-  if (state.sort?.field) {
+  if (true) {
     params.set(LIST_QUERY_PARAM_SORT, state.sort.field)
     params.set(
killedBy: list state helpers omits filters with empty keys or values during serialization
statusReason: Cannot read properties of null (reading 'field')

[Killed] ConditionalExpression
src/app/lists/listState.ts:64:7
   params.set(LIST_QUERY_PARAM_PAGE, `${state.pagination.page}`)
   params.set(LIST_QUERY_PARAM_PAGE_SIZE, `${state.pagination.pageSize}`)
 
-  if (state.sort?.field) {
+  if (false) {
     params.set(LIST_QUERY_PARAM_SORT, state.sort.field)
     params.set(
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected null to be 'name' // Object.is equality

[Killed] LogicalOperator
src/app/lists/listState.ts:68:7
     params.set(LIST_QUERY_PARAM_SORT, state.sort.field)
     params.set(
       LIST_QUERY_PARAM_DIRECTION,
-      state.sort.direction ?? LIST_SORT_DIRECTION_ASC,
+      state.sort.direction && LIST_SORT_DIRECTION_ASC,
     )
   }
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected 'asc' to be 'desc' // Object.is equality

[Killed] ConditionalExpression
src/app/lists/listState.ts:72:7
     )
   }
 
-  if (state.search) {
+  if (false) {
     params.set(LIST_QUERY_PARAM_SEARCH, state.search)
   }
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected null to be 'alpha' // Object.is equality

[Killed] BlockStatement
src/app/lists/listState.ts:72:21
     )
   }
 
-  if (state.search) {
-    params.set(LIST_QUERY_PARAM_SEARCH, state.search)
-  }
+  if (state.search) {}
 
   const filters = state.filters ?? {}
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected null to be 'alpha' // Object.is equality

[Killed] LogicalOperator
src/app/lists/listState.ts:76:19
     params.set(LIST_QUERY_PARAM_SEARCH, state.search)
   }
 
-  const filters = state.filters ?? {}
+  const filters = state.filters && {}
   Object.entries(filters).forEach(([key, value]) => {
     if (value === undefined || value === null || key.length === 0) {
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected null to be 'ACTIVE,SUSPENDED' // Object.is equality

[Killed] BlockStatement
src/app/lists/listState.ts:77:53
   }
 
   const filters = state.filters ?? {}
-  Object.entries(filters).forEach(([key, value]) => {
-    if (value === undefined || value === null || key.length === 0) {
-      return
-    }
-    const paramKey = `${LIST_FILTER_PARAM_PREFIX}${key}`
-    if (Array.isArray(value)) {
-      params.set(paramKey, value.join(','))
-      return
-    }
-    params.set(paramKey, `${value}`)
-  })
+  Object.entries(filters).forEach(([key, value]) => {})
 
   return params
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected null to be 'ACTIVE,SUSPENDED' // Object.is equality

[Killed] ConditionalExpression
src/app/lists/listState.ts:78:50
 
   const filters = state.filters ?? {}
   Object.entries(filters).forEach(([key, value]) => {
-    if (value === undefined || value === null || key.length === 0) {
+    if (value === undefined || value === null || false) {
       return
     }
killedBy: list state helpers omits filters with empty keys or values during serialization
statusReason: expected 'ignored' to be null

[Killed] EqualityOperator
src/app/lists/listState.ts:78:50
 
   const filters = state.filters ?? {}
   Object.entries(filters).forEach(([key, value]) => {
-    if (value === undefined || value === null || key.length === 0) {
+    if (value === undefined || value === null || key.length !== 0) {
       return
     }
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected null to be 'ACTIVE,SUSPENDED' // Object.is equality

[Killed] ConditionalExpression
src/app/lists/listState.ts:82:9
       return
     }
     const paramKey = `${LIST_FILTER_PARAM_PREFIX}${key}`
-    if (Array.isArray(value)) {
+    if (true) {
       params.set(paramKey, value.join(','))
       return
killedBy: list state helpers serializes and parses roundtrip
statusReason: value.join is not a function

[Survived] BlockStatement
src/app/lists/listState.ts:82:31
       return
     }
     const paramKey = `${LIST_FILTER_PARAM_PREFIX}${key}`
-    if (Array.isArray(value)) {
-      params.set(paramKey, value.join(','))
-      return
-    }
+    if (Array.isArray(value)) {}
     params.set(paramKey, `${value}`)
   })

[Killed] BlockStatement
src/app/lists/listState.ts:92:68
   return params
 }
 
-const parseFilters = (params: URLSearchParams): ListFilterState => {
-  const result: ListFilterState = {}
-  params.forEach((value, key) => {
-    if (!key.startsWith(LIST_FILTER_PARAM_PREFIX)) {
-      return
-    }
-    const filterKey = key.slice(LIST_FILTER_PARAM_PREFIX.length)
-    if (!filterKey) {
-      return
-    }
-    if (value.includes(',')) {
-      result[filterKey] = value.split(',').map((entry) => entry.trim()).filter(Boolean)
-      return
-    }
-    result[filterKey] = value
-  })
-  return result
-}
+const parseFilters = (params: URLSearchParams): ListFilterState => {}
 
 export const parseListState = (
killedBy: list state helpers serializes and parses roundtrip
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/app/lists/listState.ts:94:34
 
 const parseFilters = (params: URLSearchParams): ListFilterState => {
   const result: ListFilterState = {}
-  params.forEach((value, key) => {
-    if (!key.startsWith(LIST_FILTER_PARAM_PREFIX)) {
-      return
-    }
-    const filterKey = key.slice(LIST_FILTER_PARAM_PREFIX.length)
-    if (!filterKey) {
-      return
-    }
-    if (value.includes(',')) {
-      result[filterKey] = value.split(',').map((entry) => entry.trim()).filter(Boolean)
-      return
-    }
-    result[filterKey] = value
-  })
+  params.forEach((value, key) => {})
   return result
 }
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] ConditionalExpression
src/app/lists/listState.ts:95:9
 const parseFilters = (params: URLSearchParams): ListFilterState => {
   const result: ListFilterState = {}
   params.forEach((value, key) => {
-    if (!key.startsWith(LIST_FILTER_PARAM_PREFIX)) {
+    if (false) {
       return
     }
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] BooleanLiteral
src/app/lists/listState.ts:95:9
 const parseFilters = (params: URLSearchParams): ListFilterState => {
   const result: ListFilterState = {}
   params.forEach((value, key) => {
-    if (!key.startsWith(LIST_FILTER_PARAM_PREFIX)) {
+    if (key.startsWith(LIST_FILTER_PARAM_PREFIX)) {
       return
     }
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] MethodExpression
src/app/lists/listState.ts:98:23
     if (!key.startsWith(LIST_FILTER_PARAM_PREFIX)) {
       return
     }
-    const filterKey = key.slice(LIST_FILTER_PARAM_PREFIX.length)
+    const filterKey = key
     if (!filterKey) {
       return
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] BooleanLiteral
src/app/lists/listState.ts:99:9
       return
     }
     const filterKey = key.slice(LIST_FILTER_PARAM_PREFIX.length)
-    if (!filterKey) {
+    if (filterKey) {
       return
     }
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] ConditionalExpression
src/app/lists/listState.ts:99:9
       return
     }
     const filterKey = key.slice(LIST_FILTER_PARAM_PREFIX.length)
-    if (!filterKey) {
+    if (false) {
       return
     }
killedBy: list state helpers ignores filter params without keys when parsing
statusReason: expected { '': 'value' } to deeply equal {}

[Killed] ConditionalExpression
src/app/lists/listState.ts:102:9
     if (!filterKey) {
       return
     }
-    if (value.includes(',')) {
+    if (false) {
       result[filterKey] = value.split(',').map((entry) => entry.trim()).filter(Boolean)
       return
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] ConditionalExpression
src/app/lists/listState.ts:102:9
     if (!filterKey) {
       return
     }
-    if (value.includes(',')) {
+    if (true) {
       result[filterKey] = value.split(',').map((entry) => entry.trim()).filter(Boolean)
       return
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] ArrowFunction
src/app/lists/listState.ts:103:48
       return
     }
     if (value.includes(',')) {
-      result[filterKey] = value.split(',').map((entry) => entry.trim()).filter(Boolean)
+      result[filterKey] = value.split(',').map(() => undefined).filter(Boolean)
       return
     }
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Survived] MethodExpression
src/app/lists/listState.ts:103:27
       return
     }
     if (value.includes(',')) {
-      result[filterKey] = value.split(',').map((entry) => entry.trim()).filter(Boolean)
+      result[filterKey] = value.split(',').map(entry => entry.trim())
       return
     }

[Killed] BlockStatement
src/app/lists/listState.ts:114:17
 export const parseListState = (
   params: URLSearchParams,
   defaults: ListState = DEFAULT_LIST_STATE,
-): ListState => {
-  const page = normalizePage(Number.parseInt(params.get(LIST_QUERY_PARAM_PAGE) ?? '', 10))
-  const pageSize = normalizePageSize(
-    Number.parseInt(params.get(LIST_QUERY_PARAM_PAGE_SIZE) ?? '', 10),
-  )
-  const sortField = params.get(LIST_QUERY_PARAM_SORT)
-  const directionParam = params.get(LIST_QUERY_PARAM_DIRECTION) ?? LIST_SORT_DIRECTION_ASC
-  const direction = isValidDirection(directionParam)
-    ? directionParam
-    : LIST_SORT_DIRECTION_ASC
-  const search = params.get(LIST_QUERY_PARAM_SEARCH)
-  const filters = parseFilters(params)
-
-  return {
-    pagination: {
-      page: page || defaults.pagination.page,
-      pageSize: pageSize || defaults.pagination.pageSize,
-    },
-    sort: sortField ? { field: sortField, direction } : defaults.sort ?? null,
-    search: search ? search.trim() : defaults.search ?? null,
-    filters: Object.keys(filters).length > 0 ? filters : defaults.filters ?? {},
-  }
-}
+): ListState => {}
 
 export const buildListQueryOptions = (state: ListState) => {
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected undefined to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] LogicalOperator
src/app/lists/listState.ts:115:46
   params: URLSearchParams,
   defaults: ListState = DEFAULT_LIST_STATE,
 ): ListState => {
-  const page = normalizePage(Number.parseInt(params.get(LIST_QUERY_PARAM_PAGE) ?? '', 10))
+  const page = normalizePage(Number.parseInt(params.get(LIST_QUERY_PARAM_PAGE) && '', 10))
   const pageSize = normalizePageSize(
     Number.parseInt(params.get(LIST_QUERY_PARAM_PAGE_SIZE) ?? '', 10),
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 1, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Survived] StringLiteral
src/app/lists/listState.ts:115:83
   params: URLSearchParams,
   defaults: ListState = DEFAULT_LIST_STATE,
 ): ListState => {
-  const page = normalizePage(Number.parseInt(params.get(LIST_QUERY_PARAM_PAGE) ?? '', 10))
+  const page = normalizePage(Number.parseInt(params.get(LIST_QUERY_PARAM_PAGE) ?? "Stryker was here!", 10))
   const pageSize = normalizePageSize(
     Number.parseInt(params.get(LIST_QUERY_PARAM_PAGE_SIZE) ?? '', 10),

[Killed] LogicalOperator
src/app/lists/listState.ts:117:21
 ): ListState => {
   const page = normalizePage(Number.parseInt(params.get(LIST_QUERY_PARAM_PAGE) ?? '', 10))
   const pageSize = normalizePageSize(
-    Number.parseInt(params.get(LIST_QUERY_PARAM_PAGE_SIZE) ?? '', 10),
+    Number.parseInt(params.get(LIST_QUERY_PARAM_PAGE_SIZE) && '', 10),
   )
   const sortField = params.get(LIST_QUERY_PARAM_SORT)
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] LogicalOperator
src/app/lists/listState.ts:120:26
     Number.parseInt(params.get(LIST_QUERY_PARAM_PAGE_SIZE) ?? '', 10),
   )
   const sortField = params.get(LIST_QUERY_PARAM_SORT)
-  const directionParam = params.get(LIST_QUERY_PARAM_DIRECTION) ?? LIST_SORT_DIRECTION_ASC
+  const directionParam = params.get(LIST_QUERY_PARAM_DIRECTION) && LIST_SORT_DIRECTION_ASC
   const direction = isValidDirection(directionParam)
     ? directionParam
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] ConditionalExpression
src/app/lists/listState.ts:129:13
 
   return {
     pagination: {
-      page: page || defaults.pagination.page,
+      page: false,
       pageSize: pageSize || defaults.pagination.pageSize,
     },
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { …(4) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] ConditionalExpression
src/app/lists/listState.ts:129:13
 
   return {
     pagination: {
-      page: page || defaults.pagination.page,
+      page: true,
       pageSize: pageSize || defaults.pagination.pageSize,
     },
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { …(4) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] LogicalOperator
src/app/lists/listState.ts:130:17
   return {
     pagination: {
       page: page || defaults.pagination.page,
-      pageSize: pageSize || defaults.pagination.pageSize,
+      pageSize: pageSize && defaults.pagination.pageSize,
     },
     sort: sortField ? { field: sortField, direction } : defaults.sort ?? null,
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] ConditionalExpression
src/app/lists/listState.ts:130:17
   return {
     pagination: {
       page: page || defaults.pagination.page,
-      pageSize: pageSize || defaults.pagination.pageSize,
+      pageSize: false,
     },
     sort: sortField ? { field: sortField, direction } : defaults.sort ?? null,
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Survived] LogicalOperator
src/app/lists/listState.ts:132:57
       page: page || defaults.pagination.page,
       pageSize: pageSize || defaults.pagination.pageSize,
     },
-    sort: sortField ? { field: sortField, direction } : defaults.sort ?? null,
+    sort: sortField ? { field: sortField, direction } : defaults.sort && null,
     search: search ? search.trim() : defaults.search ?? null,
     filters: Object.keys(filters).length > 0 ? filters : defaults.filters ?? {},

[Killed] ObjectLiteral
src/app/lists/listState.ts:132:23
       page: page || defaults.pagination.page,
       pageSize: pageSize || defaults.pagination.pageSize,
     },
-    sort: sortField ? { field: sortField, direction } : defaults.sort ?? null,
+    sort: sortField ? {} : defaults.sort ?? null,
     search: search ? search.trim() : defaults.search ?? null,
     filters: Object.keys(filters).length > 0 ? filters : defaults.filters ?? {},
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] MethodExpression
src/app/lists/listState.ts:133:22
       pageSize: pageSize || defaults.pagination.pageSize,
     },
     sort: sortField ? { field: sortField, direction } : defaults.sort ?? null,
-    search: search ? search.trim() : defaults.search ?? null,
+    search: search ? search : defaults.search ?? null,
     filters: Object.keys(filters).length > 0 ? filters : defaults.filters ?? {},
   }
killedBy: list state helpers parses search params with invalid values gracefully
statusReason: expected '  echo  ' to be 'echo' // Object.is equality

[Survived] LogicalOperator
src/app/lists/listState.ts:133:38
       pageSize: pageSize || defaults.pagination.pageSize,
     },
     sort: sortField ? { field: sortField, direction } : defaults.sort ?? null,
-    search: search ? search.trim() : defaults.search ?? null,
+    search: search ? search.trim() : defaults.search && null,
     filters: Object.keys(filters).length > 0 ? filters : defaults.filters ?? {},
   }

[Killed] EqualityOperator
src/app/lists/listState.ts:134:14
     },
     sort: sortField ? { field: sortField, direction } : defaults.sort ?? null,
     search: search ? search.trim() : defaults.search ?? null,
-    filters: Object.keys(filters).length > 0 ? filters : defaults.filters ?? {},
+    filters: Object.keys(filters).length <= 0 ? filters : defaults.filters ?? {},
   }
 }
killedBy: list state helpers serializes and parses roundtrip
statusReason: expected { pagination: { page: 3, …(1) }, …(3) } to deeply equal { pagination: { page: 3, …(1) }, …(3) }

[Killed] EqualityOperator
src/app/lists/listState.ts:134:14
     },
     sort: sortField ? { field: sortField, direction } : defaults.sort ?? null,
     search: search ? search.trim() : defaults.search ?? null,
-    filters: Object.keys(filters).length > 0 ? filters : defaults.filters ?? {},
+    filters: Object.keys(filters).length >= 0 ? filters : defaults.filters ?? {},
   }
 }
killedBy: list state helpers returns default filters when none provided
statusReason: expected {} to deeply equal { status: 'ACTIVE' }

[Killed] BlockStatement
src/app/lists/listState.ts:138:60
   }
 }
 
-export const buildListQueryOptions = (state: ListState) => {
-  const page = normalizePage(state.pagination.page)
-  const pageSize = normalizePageSize(state.pagination.pageSize)
-  const offset = (page - 1) * pageSize
-
-  return {
-    limit: pageSize,
-    offset,
-    sortField: state.sort?.field ?? null,
-    sortDirection: state.sort?.direction ?? null,
-    search: state.search ?? null,
-    filters: state.filters ?? {},
-  }
-}
+export const buildListQueryOptions = (state: ListState) => {}
 
 
killedBy: list state helpers builds query options for API consumption
statusReason: expected undefined to deeply equal { limit: 40, offset: 40, …(4) }
