[Killed] ArithmeticOperator
src/app/lists/listState.ts:141:18
 export const buildListQueryOptions = (state: ListState) => {
   const page = normalizePage(state.pagination.page)
   const pageSize = normalizePageSize(state.pagination.pageSize)
-  const offset = (page - 1) * pageSize
+  const offset = (page - 1) / pageSize
 
   return {
killedBy: list state helpers builds query options for API consumption
statusReason: expected { limit: 40, offset: 0.025, …(4) } to deeply equal { limit: 40, offset: 40, …(4) }

[Killed] ArithmeticOperator
src/app/lists/listState.ts:141:19
 export const buildListQueryOptions = (state: ListState) => {
   const page = normalizePage(state.pagination.page)
   const pageSize = normalizePageSize(state.pagination.pageSize)
-  const offset = (page - 1) * pageSize
+  const offset = (page + 1) * pageSize
 
   return {
killedBy: list state helpers builds query options for API consumption
statusReason: expected { limit: 40, offset: 120, …(4) } to deeply equal { limit: 40, offset: 40, …(4) }

[Killed] LogicalOperator
src/app/lists/listState.ts:146:16
   return {
     limit: pageSize,
     offset,
-    sortField: state.sort?.field ?? null,
+    sortField: state.sort?.field && null,
     sortDirection: state.sort?.direction ?? null,
     search: state.search ?? null,
killedBy: list state helpers builds query options for API consumption
statusReason: expected { limit: 40, offset: 40, …(4) } to deeply equal { limit: 40, offset: 40, …(4) }

[Killed] OptionalChaining
src/app/lists/listState.ts:146:16
   return {
     limit: pageSize,
     offset,
-    sortField: state.sort?.field ?? null,
+    sortField: state.sort.field ?? null,
     sortDirection: state.sort?.direction ?? null,
     search: state.search ?? null,
killedBy: list state helpers clamps invalid page values when building query options
statusReason: Cannot read properties of null (reading 'field')

[Killed] LogicalOperator
src/app/lists/listState.ts:147:20
     limit: pageSize,
     offset,
     sortField: state.sort?.field ?? null,
-    sortDirection: state.sort?.direction ?? null,
+    sortDirection: state.sort?.direction && null,
     search: state.search ?? null,
     filters: state.filters ?? {},
killedBy: list state helpers builds query options for API consumption
statusReason: expected { limit: 40, offset: 40, …(4) } to deeply equal { limit: 40, offset: 40, …(4) }

[Killed] OptionalChaining
src/app/lists/listState.ts:147:20
     limit: pageSize,
     offset,
     sortField: state.sort?.field ?? null,
-    sortDirection: state.sort?.direction ?? null,
+    sortDirection: state.sort.direction ?? null,
     search: state.search ?? null,
     filters: state.filters ?? {},
killedBy: list state helpers clamps invalid page values when building query options
statusReason: Cannot read properties of null (reading 'direction')

[Killed] LogicalOperator
src/app/lists/listState.ts:148:13
     offset,
     sortField: state.sort?.field ?? null,
     sortDirection: state.sort?.direction ?? null,
-    search: state.search ?? null,
+    search: state.search && null,
     filters: state.filters ?? {},
   }
killedBy: list state helpers builds query options for API consumption
statusReason: expected { limit: 40, offset: 40, …(4) } to deeply equal { limit: 40, offset: 40, …(4) }

[Killed] LogicalOperator
src/app/lists/listState.ts:149:14
     sortField: state.sort?.field ?? null,
     sortDirection: state.sort?.direction ?? null,
     search: state.search ?? null,
-    filters: state.filters ?? {},
+    filters: state.filters && {},
   }
 }
killedBy: list state helpers builds query options for API consumption
statusReason: expected { limit: 40, offset: 40, …(4) } to deeply equal { limit: 40, offset: 40, …(4) }
