[Survived] BooleanLiteral
src/app/logging/sentryLogger.ts:6:25
 
 import type { Logger } from './logger'
 
-let sentryInitialized = false
+let sentryInitialized = true
 
 const ensureSentryInitialized = (dsn: string) => {

[NoCoverage] BlockStatement
src/app/logging/sentryLogger.ts:8:50
 
 let sentryInitialized = false
 
-const ensureSentryInitialized = (dsn: string) => {
-  if (sentryInitialized) {
-    return
-  }
-  Sentry.init({
-    dsn,
-    integrations: [],
-  })
-  sentryInitialized = true
-}
+const ensureSentryInitialized = (dsn: string) => {}
 
 export const createSentryLogger = (dsn: string): Logger => {

[NoCoverage] ConditionalExpression
src/app/logging/sentryLogger.ts:9:7
 let sentryInitialized = false
 
 const ensureSentryInitialized = (dsn: string) => {
-  if (sentryInitialized) {
+  if (true) {
     return
   }

[NoCoverage] ConditionalExpression
src/app/logging/sentryLogger.ts:9:7
 let sentryInitialized = false
 
 const ensureSentryInitialized = (dsn: string) => {
-  if (sentryInitialized) {
+  if (false) {
     return
   }

[NoCoverage] ArrayDeclaration
src/app/logging/sentryLogger.ts:14:19
   }
   Sentry.init({
     dsn,
-    integrations: [],
+    integrations: ["Stryker was here"],
   })
   sentryInitialized = true

[NoCoverage] BooleanLiteral
src/app/logging/sentryLogger.ts:16:23
     dsn,
     integrations: [],
   })
-  sentryInitialized = true
+  sentryInitialized = false
 }
 

[NoCoverage] BlockStatement
src/app/logging/sentryLogger.ts:23:35
   ensureSentryInitialized(dsn)
 
   return {
-    debug: (message, metadata) => {
-      Sentry.addBreadcrumb({
-        level: 'debug',
-        message,
-        data: metadata,
-      })
-    },
+    debug: (message, metadata) => {},
     info: (message, metadata) => {
       Sentry.captureMessage(message, {

[NoCoverage] BlockStatement
src/app/logging/sentryLogger.ts:30:34
         data: metadata,
       })
     },
-    info: (message, metadata) => {
-      Sentry.captureMessage(message, {
-        level: 'info',
-        extra: metadata,
-      })
-    },
+    info: (message, metadata) => {},
     warn: (message, metadata) => {
       Sentry.captureMessage(message, {

[NoCoverage] BlockStatement
src/app/logging/sentryLogger.ts:36:34
         extra: metadata,
       })
     },
-    warn: (message, metadata) => {
-      Sentry.captureMessage(message, {
-        level: 'warning',
-        extra: metadata,
-      })
-    },
+    warn: (message, metadata) => {},
     error: (error, metadata) => {
       if (error instanceof Error) {

[NoCoverage] BlockStatement
src/app/logging/sentryLogger.ts:42:33
         extra: metadata,
       })
     },
-    error: (error, metadata) => {
-      if (error instanceof Error) {
-        Sentry.captureException(error, {
-          extra: metadata,
-        })
-        return
-      }
-
-      Sentry.captureMessage(typeof error === 'string' ? error : 'Unknown error', {
-        level: 'error',
-        extra: {
-          error,
-          ...metadata,
-        },
-      })
-    },
+    error: (error, metadata) => {},
   }
 }

[NoCoverage] ConditionalExpression
src/app/logging/sentryLogger.ts:43:11
       })
     },
     error: (error, metadata) => {
-      if (error instanceof Error) {
+      if (false) {
         Sentry.captureException(error, {
           extra: metadata,

[NoCoverage] ConditionalExpression
src/app/logging/sentryLogger.ts:43:11
       })
     },
     error: (error, metadata) => {
-      if (error instanceof Error) {
+      if (true) {
         Sentry.captureException(error, {
           extra: metadata,

[NoCoverage] ConditionalExpression
src/app/logging/sentryLogger.ts:50:29
         return
       }
 
-      Sentry.captureMessage(typeof error === 'string' ? error : 'Unknown error', {
+      Sentry.captureMessage(true ? error : 'Unknown error', {
         level: 'error',
         extra: {

[NoCoverage] EqualityOperator
src/app/logging/sentryLogger.ts:50:29
         return
       }
 
-      Sentry.captureMessage(typeof error === 'string' ? error : 'Unknown error', {
+      Sentry.captureMessage(typeof error !== 'string' ? error : 'Unknown error', {
         level: 'error',
         extra: {
