[Killed] StringLiteral
src/app/query/errorHandling.ts:6:40
 import type { ToastNotificationPayload } from '../../notifications/constants'
 import { mapApiException, mapErrorToNotification } from '../../errors/mappers'
 
-const RETRYABLE_ERROR_CODES = new Set(['err_network', 'network_error', 'econnaborted'])
+const RETRYABLE_ERROR_CODES = new Set(["", 'network_error', 'econnaborted'])
 const MAX_NETWORK_RETRIES = 2
 
killedBy: isNetworkError detects axios-style network errors
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/app/query/errorHandling.ts:9:58
 const RETRYABLE_ERROR_CODES = new Set(['err_network', 'network_error', 'econnaborted'])
 const MAX_NETWORK_RETRIES = 2
 
-const normalizeCode = (value: unknown): string | null => {
-  if (typeof value !== 'string') {
-    return null
-  }
-  return value.trim().toLowerCase()
-}
+const normalizeCode = (value: unknown): string | null => {}
 
 const isAxiosLikeNetworkError = (error: unknown): boolean => {
killedBy: isNetworkError detects axios-style network errors
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/app/query/errorHandling.ts:10:7
 const MAX_NETWORK_RETRIES = 2
 
 const normalizeCode = (value: unknown): string | null => {
-  if (typeof value !== 'string') {
+  if (true) {
     return null
   }
killedBy: isNetworkError detects axios-style network errors
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/app/query/errorHandling.ts:10:7
 const MAX_NETWORK_RETRIES = 2
 
 const normalizeCode = (value: unknown): string | null => {
-  if (typeof value !== 'string') {
+  if (typeof value === 'string') {
     return null
   }
killedBy: isNetworkError detects axios-style network errors
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/app/query/errorHandling.ts:13:10
   if (typeof value !== 'string') {
     return null
   }
-  return value.trim().toLowerCase()
+  return value.trim().toUpperCase()
 }
 
killedBy: isNetworkError detects axios-style network errors
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/app/query/errorHandling.ts:13:10
   if (typeof value !== 'string') {
     return null
   }
-  return value.trim().toLowerCase()
+  return value.toLowerCase()
 }
 

[Killed] BlockStatement
src/app/query/errorHandling.ts:16:62
   return value.trim().toLowerCase()
 }
 
-const isAxiosLikeNetworkError = (error: unknown): boolean => {
-  if (!error || typeof error !== 'object' || !('code' in error)) {
-    return false
-  }
-  const normalized = normalizeCode((error as { code?: unknown }).code)
-  return normalized ? RETRYABLE_ERROR_CODES.has(normalized) : false
-}
+const isAxiosLikeNetworkError = (error: unknown): boolean => {}
 
 export const isApiException = (error: unknown): error is ApiException => error instanceof ApiException
killedBy: isNetworkError detects axios-style network errors
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/app/query/errorHandling.ts:17:7
 }
 
 const isAxiosLikeNetworkError = (error: unknown): boolean => {
-  if (!error || typeof error !== 'object' || !('code' in error)) {
+  if (true) {
     return false
   }
killedBy: isNetworkError detects axios-style network errors
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/app/query/errorHandling.ts:17:17
 }
 
 const isAxiosLikeNetworkError = (error: unknown): boolean => {
-  if (!error || typeof error !== 'object' || !('code' in error)) {
+  if (!error || typeof error === 'object' || !('code' in error)) {
     return false
   }
killedBy: isNetworkError detects axios-style network errors
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/app/query/errorHandling.ts:18:12
 
 const isAxiosLikeNetworkError = (error: unknown): boolean => {
   if (!error || typeof error !== 'object' || !('code' in error)) {
-    return false
+    return true
   }
   const normalized = normalizeCode((error as { code?: unknown }).code)
killedBy: isNetworkError returns false for non-network errors
statusReason: expected true to be false // Object.is equality

[NoCoverage] BooleanLiteral
src/app/query/errorHandling.ts:21:63
     return false
   }
   const normalized = normalizeCode((error as { code?: unknown }).code)
-  return normalized ? RETRYABLE_ERROR_CODES.has(normalized) : false
+  return normalized ? RETRYABLE_ERROR_CODES.has(normalized) : true
 }
 

[Killed] ArrowFunction
src/app/query/errorHandling.ts:24:31
   return normalized ? RETRYABLE_ERROR_CODES.has(normalized) : false
 }
 
-export const isApiException = (error: unknown): error is ApiException => error instanceof ApiException
+export const isApiException = () => undefined
 
 export const isNetworkError = (error: unknown): boolean => {
killedBy: QueryErrorObserver converts query error events into toast notifications
statusReason: expected "vi.fn()" to be called with arguments: [ 'notification:toast', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "notification:toast",

[Killed] BlockStatement
src/app/query/errorHandling.ts:26:60
 
 export const isApiException = (error: unknown): error is ApiException => error instanceof ApiException
 
-export const isNetworkError = (error: unknown): boolean => {
-  if (!error) {
-    return false
-  }
-  if (error instanceof NetworkException) {
-    return true
-  }
-  if (isAxiosLikeNetworkError(error)) {
-    return true
-  }
-  if (error instanceof Error) {
-    return /network/i.test(error.message)
-  }
-  return false
-}
+export const isNetworkError = (error: unknown): boolean => {}
 
 export const handleQueryError = (error: unknown): ToastNotificationPayload => {
killedBy: isNetworkError detects NetworkException instances
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/app/query/errorHandling.ts:27:7
 export const isApiException = (error: unknown): error is ApiException => error instanceof ApiException
 
 export const isNetworkError = (error: unknown): boolean => {
-  if (!error) {
+  if (true) {
     return false
   }
killedBy: isNetworkError detects NetworkException instances
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/app/query/errorHandling.ts:27:7
 export const isApiException = (error: unknown): error is ApiException => error instanceof ApiException
 
 export const isNetworkError = (error: unknown): boolean => {
-  if (!error) {
+  if (error) {
     return false
   }
killedBy: isNetworkError detects NetworkException instances
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/app/query/errorHandling.ts:28:12
 
 export const isNetworkError = (error: unknown): boolean => {
   if (!error) {
-    return false
+    return true
   }
   if (error instanceof NetworkException) {
killedBy: isNetworkError returns false for falsy inputs
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/app/query/errorHandling.ts:30:42
   if (!error) {
     return false
   }
-  if (error instanceof NetworkException) {
-    return true
-  }
+  if (error instanceof NetworkException) {}
   if (isAxiosLikeNetworkError(error)) {
     return true
killedBy: isNetworkError detects NetworkException instances
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/app/query/errorHandling.ts:30:7
   if (!error) {
     return false
   }
-  if (error instanceof NetworkException) {
+  if (true) {
     return true
   }
killedBy: isNetworkError returns false for non-network errors
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/app/query/errorHandling.ts:31:12
     return false
   }
   if (error instanceof NetworkException) {
-    return true
+    return false
   }
   if (isAxiosLikeNetworkError(error)) {
killedBy: isNetworkError detects NetworkException instances
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/app/query/errorHandling.ts:33:7
   if (error instanceof NetworkException) {
     return true
   }
-  if (isAxiosLikeNetworkError(error)) {
+  if (true) {
     return true
   }
killedBy: isNetworkError returns false for non-network errors
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/app/query/errorHandling.ts:33:39
   if (error instanceof NetworkException) {
     return true
   }
-  if (isAxiosLikeNetworkError(error)) {
-    return true
-  }
+  if (isAxiosLikeNetworkError(error)) {}
   if (error instanceof Error) {
     return /network/i.test(error.message)
killedBy: isNetworkError detects axios-style network errors
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/app/query/errorHandling.ts:34:12
     return true
   }
   if (isAxiosLikeNetworkError(error)) {
-    return true
+    return false
   }
   if (error instanceof Error) {
killedBy: isNetworkError detects axios-style network errors
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/app/query/errorHandling.ts:36:7
   if (isAxiosLikeNetworkError(error)) {
     return true
   }
-  if (error instanceof Error) {
+  if (false) {
     return /network/i.test(error.message)
   }
killedBy: isNetworkError detects generic errors with network messaging
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/app/query/errorHandling.ts:36:31
   if (isAxiosLikeNetworkError(error)) {
     return true
   }
-  if (error instanceof Error) {
-    return /network/i.test(error.message)
-  }
+  if (error instanceof Error) {}
   return false
 }
killedBy: isNetworkError detects generic errors with network messaging
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/app/query/errorHandling.ts:42:79
   return false
 }
 
-export const handleQueryError = (error: unknown): ToastNotificationPayload => {
-  if (isApiException(error)) {
-    return mapApiException(error)
-  }
-  return mapErrorToNotification()
-}
+export const handleQueryError = (error: unknown): ToastNotificationPayload => {}
 
 export const shouldRetryRequest = (failureCount: number, error: unknown): boolean => {
killedBy: handleQueryError maps ApiException instances with mapApiException
statusReason: Cannot read properties of undefined (reading 'titleKey')

[Killed] BlockStatement
src/app/query/errorHandling.ts:43:30
 }
 
 export const handleQueryError = (error: unknown): ToastNotificationPayload => {
-  if (isApiException(error)) {
-    return mapApiException(error)
-  }
+  if (isApiException(error)) {}
   return mapErrorToNotification()
 }
killedBy: handleQueryError maps ApiException instances with mapApiException
statusReason: expected 'app.error.title' to be 'ERROR_CODE' // Object.is equality

[Killed] ConditionalExpression
src/app/query/errorHandling.ts:43:7
 }
 
 export const handleQueryError = (error: unknown): ToastNotificationPayload => {
-  if (isApiException(error)) {
+  if (false) {
     return mapApiException(error)
   }
killedBy: handleQueryError maps ApiException instances with mapApiException
statusReason: expected 'app.error.title' to be 'ERROR_CODE' // Object.is equality

[Killed] BlockStatement
src/app/query/errorHandling.ts:49:86
   return mapErrorToNotification()
 }
 
-export const shouldRetryRequest = (failureCount: number, error: unknown): boolean => {
-  if (isNetworkError(error)) {
-    return failureCount < MAX_NETWORK_RETRIES
-  }
-  if (isApiException(error)) {
-    return false
-  }
-  return failureCount < 1
-}
+export const shouldRetryRequest = (failureCount: number, error: unknown): boolean => {}
 
 
killedBy: shouldRetryRequest retries network errors up to the maximum
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/app/query/errorHandling.ts:50:7
 }
 
 export const shouldRetryRequest = (failureCount: number, error: unknown): boolean => {
-  if (isNetworkError(error)) {
+  if (false) {
     return failureCount < MAX_NETWORK_RETRIES
   }
killedBy: shouldRetryRequest retries network errors up to the maximum
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/app/query/errorHandling.ts:50:7
 }
 
 export const shouldRetryRequest = (failureCount: number, error: unknown): boolean => {
-  if (isNetworkError(error)) {
+  if (true) {
     return failureCount < MAX_NETWORK_RETRIES
   }
killedBy: shouldRetryRequest does not retry ApiException instances
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/app/query/errorHandling.ts:51:12
 
 export const shouldRetryRequest = (failureCount: number, error: unknown): boolean => {
   if (isNetworkError(error)) {
-    return failureCount < MAX_NETWORK_RETRIES
+    return failureCount >= MAX_NETWORK_RETRIES
   }
   if (isApiException(error)) {
killedBy: shouldRetryRequest retries network errors up to the maximum
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/app/query/errorHandling.ts:51:12
 
 export const shouldRetryRequest = (failureCount: number, error: unknown): boolean => {
   if (isNetworkError(error)) {
-    return failureCount < MAX_NETWORK_RETRIES
+    return false
   }
   if (isApiException(error)) {
killedBy: shouldRetryRequest retries network errors up to the maximum
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/app/query/errorHandling.ts:53:30
   if (isNetworkError(error)) {
     return failureCount < MAX_NETWORK_RETRIES
   }
-  if (isApiException(error)) {
-    return false
-  }
+  if (isApiException(error)) {}
   return failureCount < 1
 }
killedBy: shouldRetryRequest does not retry ApiException instances
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/app/query/errorHandling.ts:53:7
   if (isNetworkError(error)) {
     return failureCount < MAX_NETWORK_RETRIES
   }
-  if (isApiException(error)) {
+  if (true) {
     return false
   }
killedBy: shouldRetryRequest retries unknown errors at least once
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/app/query/errorHandling.ts:54:12
     return failureCount < MAX_NETWORK_RETRIES
   }
   if (isApiException(error)) {
-    return false
+    return true
   }
   return failureCount < 1
killedBy: shouldRetryRequest does not retry ApiException instances
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/app/query/errorHandling.ts:56:10
   if (isApiException(error)) {
     return false
   }
-  return failureCount < 1
+  return false
 }
 
killedBy: shouldRetryRequest retries unknown errors at least once
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/app/query/errorHandling.ts:56:10
   if (isApiException(error)) {
     return false
   }
-  return failureCount < 1
+  return failureCount >= 1
 }
 
killedBy: shouldRetryRequest retries unknown errors at least once
statusReason: expected false to be true // Object.is equality
