[Survived] ArrowFunction
src/app/router.tsx:34:19
 })
 
 const dashboardRoute = createRoute({
-  getParentRoute: () => rootRoute,
+  getParentRoute: () => undefined,
   path: ROUTE_PATH_ROOT,
   beforeLoad: ({ context, location }) => {

[Survived] BlockStatement
src/app/router.tsx:36:42
 const dashboardRoute = createRoute({
   getParentRoute: () => rootRoute,
   path: ROUTE_PATH_ROOT,
-  beforeLoad: ({ context, location }) => {
-    assertPermission(context, location, 'viewDashboard')
-  },
+  beforeLoad: ({ context, location }) => {},
   component: DashboardRouteComponent,
 })

[Timeout] StringLiteral
src/app/router.tsx:37:41
   getParentRoute: () => rootRoute,
   path: ROUTE_PATH_ROOT,
   beforeLoad: ({ context, location }) => {
-    assertPermission(context, location, 'viewDashboard')
+    assertPermission(context, location, "")
   },
   component: DashboardRouteComponent,

[Survived] ArrowFunction
src/app/router.tsx:43:19
 })
 
 const dashboardIndexRoute = createRoute({
-  getParentRoute: () => rootRoute,
+  getParentRoute: () => undefined,
   path: ROUTE_PATH_DASHBOARD,
   beforeLoad: ({ context, location }) => {

[NoCoverage] BlockStatement
src/app/router.tsx:45:42
 const dashboardIndexRoute = createRoute({
   getParentRoute: () => rootRoute,
   path: ROUTE_PATH_DASHBOARD,
-  beforeLoad: ({ context, location }) => {
-    assertPermission(context, location, 'viewDashboard')
-  },
+  beforeLoad: ({ context, location }) => {},
   component: DashboardRouteComponent,
 })

[Survived] ArrowFunction
src/app/router.tsx:52:19
 })
 
 const authRoute = createRoute({
-  getParentRoute: () => rootRoute,
+  getParentRoute: () => undefined,
   path: ROUTE_PATH_AUTH,
   component: AuthRouteComponent,

[Killed] ObjectLiteral
src/app/router.tsx:59:36
 
 const routeTree = rootRoute.addChildren([dashboardRoute, dashboardIndexRoute, authRoute])
 
-export const router = createRouter({
-  routeTree,
-  context: {
-    queryClient: undefined as unknown as QueryClient,
-  },
-  defaultNotFoundComponent: NotFoundRouteComponent,
-})
+export const router = createRouter({})
 
 export type AppRouter = typeof router
killedBy: AppProviders feature flags skips persistence when the flag is disabled
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      QueryClient {},

[Survived] ObjectLiteral
src/app/router.tsx:61:12
 
 export const router = createRouter({
   routeTree,
-  context: {
-    queryClient: undefined as unknown as QueryClient,
-  },
+  context: {},
   defaultNotFoundComponent: NotFoundRouteComponent,
 })

[Killed] BlockStatement
src/app/router.tsx:75:73
   }
 }
 
-const resolveRedirectTarget = (location: RouterLocationLike): string => {
-  const target = location.href
-  if (typeof target === 'string' && target.trim().length > 0) {
-    return target
-  }
-  return ROUTE_PATH_ROOT
-}
+const resolveRedirectTarget = (location: RouterLocationLike): string => {}
 
 export const assertAuthenticated = (context: RouterContext, location: RouterLocationLike) => {
killedBy: router guards redirects unauthenticated requests to the auth route
statusReason: expected { redirect: undefined } to match object { redirect: '/dashboard' }

[Killed] BlockStatement
src/app/router.tsx:77:63
 
 const resolveRedirectTarget = (location: RouterLocationLike): string => {
   const target = location.href
-  if (typeof target === 'string' && target.trim().length > 0) {
-    return target
-  }
+  if (typeof target === 'string' && target.trim().length > 0) {}
   return ROUTE_PATH_ROOT
 }
killedBy: router guards redirects unauthenticated requests to the auth route
statusReason: expected { redirect: '/' } to match object { redirect: '/dashboard' }

[Killed] ConditionalExpression
src/app/router.tsx:77:37
 
 const resolveRedirectTarget = (location: RouterLocationLike): string => {
   const target = location.href
-  if (typeof target === 'string' && target.trim().length > 0) {
+  if (typeof target === 'string' && true) {
     return target
   }
killedBy: router guards falls back to the root path when redirect targets are empty
statusReason: expected { redirect: '' } to match object { redirect: '/' }

[Killed] BlockStatement
src/app/router.tsx:83:94
   return ROUTE_PATH_ROOT
 }
 
-export const assertAuthenticated = (context: RouterContext, location: RouterLocationLike) => {
-  if (!context.authState?.isAuthenticated) {
-    throw redirect({
-      to: ROUTE_PATH_AUTH,
-      search: {
-        redirect: resolveRedirectTarget(location),
-      },
-    })
-  }
-}
+export const assertAuthenticated = (context: RouterContext, location: RouterLocationLike) => {}
 
 export const assertPermission = (
killedBy: router guards redirects unauthenticated requests to the auth route
statusReason: expected undefined to be '/auth' // Object.is equality

[Killed] BooleanLiteral
src/app/router.tsx:84:7
 }
 
 export const assertAuthenticated = (context: RouterContext, location: RouterLocationLike) => {
-  if (!context.authState?.isAuthenticated) {
+  if (context.authState?.isAuthenticated) {
     throw redirect({
       to: ROUTE_PATH_AUTH,
killedBy: AppProviders renders the dashboard heading by default
statusReason: Unable to find an element with the text: Operational overview. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div>

[Killed] ConditionalExpression
src/app/router.tsx:84:7
 }
 
 export const assertAuthenticated = (context: RouterContext, location: RouterLocationLike) => {
-  if (!context.authState?.isAuthenticated) {
+  if (true) {
     throw redirect({
       to: ROUTE_PATH_AUTH,
killedBy: router guards permits access when the user is authenticated and authorized
statusReason: expected [Function] to not throw an error but Response { status: 307, statusText: '', headers: Headers {}, body: null, bodyUsed: false, ok: false, redirected: false, type: 'default', url: '' } was thrown

[Killed] ObjectLiteral
src/app/router.tsx:87:15
   if (!context.authState?.isAuthenticated) {
     throw redirect({
       to: ROUTE_PATH_AUTH,
-      search: {
-        redirect: resolveRedirectTarget(location),
-      },
+      search: {},
     })
   }
killedBy: router guards redirects unauthenticated requests to the auth route
statusReason: expected {} to match object { redirect: '/dashboard' }

[Killed] BlockStatement
src/app/router.tsx:98:6
   context: RouterContext,
   location: RouterLocationLike,
   permission: PermissionKey,
-) => {
-  assertAuthenticated(context, location)
-  if (!context.authState?.permissions[permission]) {
-    throw redirect({ to: ROUTE_PATH_ROOT })
-  }
-}
+) => {}
 
 
killedBy: router guards redirects to root when the user lacks permission
statusReason: expected undefined to be '/' // Object.is equality

[Killed] ConditionalExpression
src/app/router.tsx:100:7
   permission: PermissionKey,
 ) => {
   assertAuthenticated(context, location)
-  if (!context.authState?.permissions[permission]) {
+  if (true) {
     throw redirect({ to: ROUTE_PATH_ROOT })
   }
killedBy: router guards permits access when the user is authenticated and authorized
statusReason: expected [Function] to not throw an error but Response { status: 307, statusText: '', headers: Headers {}, body: null, bodyUsed: false, ok: false, redirected: false, type: 'default', url: '' } was thrown

[Killed] ConditionalExpression
src/app/router.tsx:100:7
   permission: PermissionKey,
 ) => {
   assertAuthenticated(context, location)
-  if (!context.authState?.permissions[permission]) {
+  if (false) {
     throw redirect({ to: ROUTE_PATH_ROOT })
   }
killedBy: router guards redirects to root when the user lacks permission
statusReason: expected undefined to be '/' // Object.is equality
