[Killed] BlockStatement
src/app/state/themeStorage.ts:14:49
 
 const isBrowser = typeof window !== 'undefined'
 
-export const readStoredTheme = (): ThemeName => {
-  if (!isBrowser) {
-    return APP_THEME_DEFAULT
-  }
-  const stored = window.localStorage.getItem(THEME_STORAGE_KEY)
-  if (stored && stored in THEME_CLASS_MAP) {
-    return stored as ThemeName
-  }
-  return APP_THEME_DEFAULT
-}
+export const readStoredTheme = (): ThemeName => {}
 
 export const persistTheme = (theme: ThemeName): void => {
killedBy: AppStateProvider hydrates the stored theme preference on mount
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  dark
Received:
  light

[Killed] BooleanLiteral
src/app/state/themeStorage.ts:15:7
 const isBrowser = typeof window !== 'undefined'
 
 export const readStoredTheme = (): ThemeName => {
-  if (!isBrowser) {
+  if (isBrowser) {
     return APP_THEME_DEFAULT
   }
killedBy: AppStateProvider hydrates the stored theme preference on mount
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  dark
Received:
  light

[Killed] ConditionalExpression
src/app/state/themeStorage.ts:15:7
 const isBrowser = typeof window !== 'undefined'
 
 export const readStoredTheme = (): ThemeName => {
-  if (!isBrowser) {
+  if (true) {
     return APP_THEME_DEFAULT
   }
killedBy: AppStateProvider hydrates the stored theme preference on mount
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  dark
Received:
  light

[Killed] LogicalOperator
src/app/state/themeStorage.ts:19:7
     return APP_THEME_DEFAULT
   }
   const stored = window.localStorage.getItem(THEME_STORAGE_KEY)
-  if (stored && stored in THEME_CLASS_MAP) {
+  if (stored || stored in THEME_CLASS_MAP) {
     return stored as ThemeName
   }
killedBy: AppStateProvider falls back to the default theme when storage contains an invalid value
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  light
Received:
  invalid-theme

[Killed] BlockStatement
src/app/state/themeStorage.ts:19:44
     return APP_THEME_DEFAULT
   }
   const stored = window.localStorage.getItem(THEME_STORAGE_KEY)
-  if (stored && stored in THEME_CLASS_MAP) {
-    return stored as ThemeName
-  }
+  if (stored && stored in THEME_CLASS_MAP) {}
   return APP_THEME_DEFAULT
 }
killedBy: AppStateProvider hydrates the stored theme preference on mount
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  dark
Received:
  light

[Killed] BlockStatement
src/app/state/themeStorage.ts:25:57
   return APP_THEME_DEFAULT
 }
 
-export const persistTheme = (theme: ThemeName): void => {
-  if (isBrowser) {
-    window.localStorage.setItem(THEME_STORAGE_KEY, theme)
-  }
-}
+export const persistTheme = (theme: ThemeName): void => {}
 
 export const applyThemeClass = (theme: ThemeName): void => {
killedBy: AppStateProvider persists theme changes and updates the DOM attribute
statusReason: expected null to be 'dark' // Object.is equality

[Killed] BlockStatement
src/app/state/themeStorage.ts:26:18
 }
 
 export const persistTheme = (theme: ThemeName): void => {
-  if (isBrowser) {
-    window.localStorage.setItem(THEME_STORAGE_KEY, theme)
-  }
+  if (isBrowser) {}
 }
 
killedBy: AppStateProvider persists theme changes and updates the DOM attribute
statusReason: expected null to be 'dark' // Object.is equality

[Killed] ConditionalExpression
src/app/state/themeStorage.ts:26:7
 }
 
 export const persistTheme = (theme: ThemeName): void => {
-  if (isBrowser) {
+  if (false) {
     window.localStorage.setItem(THEME_STORAGE_KEY, theme)
   }
killedBy: AppStateProvider persists theme changes and updates the DOM attribute
statusReason: expected null to be 'dark' // Object.is equality

[Killed] BlockStatement
src/app/state/themeStorage.ts:31:60
   }
 }
 
-export const applyThemeClass = (theme: ThemeName): void => {
-  if (!isBrowser) {
-    return
-  }
-  const body = window.document.body
-  body.setAttribute(THEME_BODY_DATA_ATTRIBUTE, theme)
-
-  body.classList.remove(...Object.values(THEME_CLASS_MAP))
-  body.classList.add(THEME_CLASS_MAP[theme] ?? THEME_DEFAULT_CLASS)
-}
+export const applyThemeClass = (theme: ThemeName): void => {}
 
 
killedBy: AppStateProvider persists theme changes and updates the DOM attribute
statusReason: expected 'light' to be 'dark' // Object.is equality

[Killed] BooleanLiteral
src/app/state/themeStorage.ts:32:7
 }
 
 export const applyThemeClass = (theme: ThemeName): void => {
-  if (!isBrowser) {
+  if (isBrowser) {
     return
   }
killedBy: AppStateProvider persists theme changes and updates the DOM attribute
statusReason: expected 'light' to be 'dark' // Object.is equality

[Killed] ConditionalExpression
src/app/state/themeStorage.ts:32:7
 }
 
 export const applyThemeClass = (theme: ThemeName): void => {
-  if (!isBrowser) {
+  if (true) {
     return
   }
killedBy: AppStateProvider persists theme changes and updates the DOM attribute
statusReason: expected 'light' to be 'dark' // Object.is equality

[Killed] LogicalOperator
src/app/state/themeStorage.ts:39:22
   body.setAttribute(THEME_BODY_DATA_ATTRIBUTE, theme)
 
   body.classList.remove(...Object.values(THEME_CLASS_MAP))
-  body.classList.add(THEME_CLASS_MAP[theme] ?? THEME_DEFAULT_CLASS)
+  body.classList.add(THEME_CLASS_MAP[theme] && THEME_DEFAULT_CLASS)
 }
 
killedBy: AppStateProvider applies the default class when an invalid theme is dispatched
statusReason: expected 'undefined' to contain 'theme-light'
