[Killed] ArrowFunction
src/forms/fields/SelectField.tsx:45:22
       <Form.Label className={FORM_CLASS_LABEL}>{t(labelKey)}</Form.Label>
       <Form.Select {...register(name)} isInvalid={Boolean(errorForField)}>
         <option value={FORM_SELECT_PLACEHOLDER_VALUE}>{t(placeholderKey)}</option>
-        {options.map((option) => (
-          <option key={option.value} value={option.value}>
-            {t(option.labelKey)}
-          </option>
-        ))}
+        {options.map(() => undefined)}
       </Form.Select>
       {errorForField ? (
killedBy: SelectField renders localized options and placeholder text
statusReason: expected [ <option value></option> ] to have a length of 3 but got 1

[Survived] LogicalOperator
src/forms/fields/SelectField.tsx:53:19
       </Form.Select>
       {errorForField ? (
         <p className={FORM_CLASS_ERROR} role="alert">
-          {String(errorForField.message ?? '')}
+          {String(errorForField.message && '')}
         </p>
       ) : null}
