[Killed] OptionalChaining
src/ui/data/DataTable.tsx:43:23
   permissionFallback,
 }: DataTableProps<TData>) {
   const showSelection = Boolean(selection)
-  const selectedIds = selection?.selectedIds ?? []
+  const selectedIds = selection.selectedIds ?? []
 
   const isRowSelected = (row: TData): boolean => {
killedBy: Data primitives DataTable renders provided rows
statusReason: Cannot read properties of undefined (reading 'selectedIds')

[Survived] LogicalOperator
src/ui/data/DataTable.tsx:43:23
   permissionFallback,
 }: DataTableProps<TData>) {
   const showSelection = Boolean(selection)
-  const selectedIds = selection?.selectedIds ?? []
+  const selectedIds = selection?.selectedIds && []
 
   const isRowSelected = (row: TData): boolean => {

[Survived] BlockStatement
src/ui/data/DataTable.tsx:45:50
   const showSelection = Boolean(selection)
   const selectedIds = selection?.selectedIds ?? []
 
-  const isRowSelected = (row: TData): boolean => {
-    const key = rowKey(row)
-    return selectedIds.includes(key)
-  }
+  const isRowSelected = (row: TData): boolean => {}
 
   const handleToggleRow = (row: TData) => {

[Killed] BlockStatement
src/ui/data/DataTable.tsx:50:43
     return selectedIds.includes(key)
   }
 
-  const handleToggleRow = (row: TData) => {
-    selection?.onToggleRow(row)
-  }
+  const handleToggleRow = (row: TData) => {}
 
   const handleToggleAll = () => {
killedBy: Data primitives DataTable toggles selection via checkbox
statusReason: expected "vi.fn()" to be called at least once

[Survived] OptionalChaining
src/ui/data/DataTable.tsx:51:5
   }
 
   const handleToggleRow = (row: TData) => {
-    selection?.onToggleRow(row)
+    selection.onToggleRow(row)
   }
 

[Killed] BlockStatement
src/ui/data/DataTable.tsx:54:33
     selection?.onToggleRow(row)
   }
 
-  const handleToggleAll = () => {
-    if (!selection) {
-      return
-    }
-    if (selection.onToggleAll) {
-      selection.onToggleAll(data)
-      return
-    }
-    data.forEach((row) => selection.onToggleRow(row))
-  }
+  const handleToggleAll = () => {}
 
   const resolveHeaderLabel = (header: ReactNode, fallback: string): string => {
killedBy: Data primitives DataTable toggles all rows when selection handler provided
statusReason: expected "vi.fn()" to be called with arguments: [ [ { …(2) }, { …(2) } ] ]

Number of calls: 0

[Killed] ConditionalExpression
src/ui/data/DataTable.tsx:55:9
   }
 
   const handleToggleAll = () => {
-    if (!selection) {
+    if (true) {
       return
     }
killedBy: Data primitives DataTable toggles all rows when selection handler provided
statusReason: expected "vi.fn()" to be called with arguments: [ [ { …(2) }, { …(2) } ] ]

Number of calls: 0

[Killed] BooleanLiteral
src/ui/data/DataTable.tsx:55:9
   }
 
   const handleToggleAll = () => {
-    if (!selection) {
+    if (selection) {
       return
     }
killedBy: Data primitives DataTable toggles all rows when selection handler provided
statusReason: expected "vi.fn()" to be called with arguments: [ [ { …(2) }, { …(2) } ] ]

Number of calls: 0

[Killed] ConditionalExpression
src/ui/data/DataTable.tsx:58:9
     if (!selection) {
       return
     }
-    if (selection.onToggleAll) {
+    if (false) {
       selection.onToggleAll(data)
       return
killedBy: Data primitives DataTable toggles all rows when selection handler provided
statusReason: expected "vi.fn()" to be called with arguments: [ [ { …(2) }, { …(2) } ] ]

Number of calls: 0

[Killed] BlockStatement
src/ui/data/DataTable.tsx:58:32
     if (!selection) {
       return
     }
-    if (selection.onToggleAll) {
-      selection.onToggleAll(data)
-      return
-    }
+    if (selection.onToggleAll) {}
     data.forEach((row) => selection.onToggleRow(row))
   }
killedBy: Data primitives DataTable toggles all rows when selection handler provided
statusReason: expected "vi.fn()" to be called with arguments: [ [ { …(2) }, { …(2) } ] ]

Number of calls: 0

[NoCoverage] ArrowFunction
src/ui/data/DataTable.tsx:62:18
       selection.onToggleAll(data)
       return
     }
-    data.forEach((row) => selection.onToggleRow(row))
+    data.forEach(() => undefined)
   }
 

[Survived] BlockStatement
src/ui/data/DataTable.tsx:65:79
     data.forEach((row) => selection.onToggleRow(row))
   }
 
-  const resolveHeaderLabel = (header: ReactNode, fallback: string): string => {
-    if (typeof header === 'string') {
-      return header
-    }
-    return fallback
-  }
+  const resolveHeaderLabel = (header: ReactNode, fallback: string): string => {}
 
   const resolveNextSortDirection = (columnId: string) => {

[Survived] EqualityOperator
src/ui/data/DataTable.tsx:66:9
   }
 
   const resolveHeaderLabel = (header: ReactNode, fallback: string): string => {
-    if (typeof header === 'string') {
+    if (typeof header !== 'string') {
       return header
     }

[Survived] BlockStatement
src/ui/data/DataTable.tsx:66:37
   }
 
   const resolveHeaderLabel = (header: ReactNode, fallback: string): string => {
-    if (typeof header === 'string') {
-      return header
-    }
+    if (typeof header === 'string') {}
     return fallback
   }

[Survived] BlockStatement
src/ui/data/DataTable.tsx:72:58
     return fallback
   }
 
-  const resolveNextSortDirection = (columnId: string) => {
-    if (sortState?.columnId === columnId && sortState.direction === UI_SORT_ASC) {
-      return UI_SORT_DESC
-    }
-    return UI_SORT_ASC
-  }
+  const resolveNextSortDirection = (columnId: string) => {}
 
   const handleSort = (columnId: string) => {

[Survived] EqualityOperator
src/ui/data/DataTable.tsx:73:9
   }
 
   const resolveNextSortDirection = (columnId: string) => {
-    if (sortState?.columnId === columnId && sortState.direction === UI_SORT_ASC) {
+    if (sortState?.columnId !== columnId && sortState.direction === UI_SORT_ASC) {
       return UI_SORT_DESC
     }

[Survived] ConditionalExpression
src/ui/data/DataTable.tsx:73:9
   }
 
   const resolveNextSortDirection = (columnId: string) => {
-    if (sortState?.columnId === columnId && sortState.direction === UI_SORT_ASC) {
+    if (false) {
       return UI_SORT_DESC
     }

[Killed] BlockStatement
src/ui/data/DataTable.tsx:79:44
     return UI_SORT_ASC
   }
 
-  const handleSort = (columnId: string) => {
-    if (!onSort) {
-      return
-    }
-    const nextDirection = resolveNextSortDirection(columnId)
-    onSort(columnId, nextDirection)
-  }
+  const handleSort = (columnId: string) => {}
 
   const allSelected = showSelection && data.length > 0 && data.every((row) => isRowSelected(row))
killedBy: Data primitives DataTable invokes sort handler when sortable column clicked
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/ui/data/DataTable.tsx:80:9
   }
 
   const handleSort = (columnId: string) => {
-    if (!onSort) {
+    if (true) {
       return
     }
killedBy: Data primitives DataTable invokes sort handler when sortable column clicked
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/ui/data/DataTable.tsx:80:9
   }
 
   const handleSort = (columnId: string) => {
-    if (!onSort) {
+    if (onSort) {
       return
     }
killedBy: Data primitives DataTable invokes sort handler when sortable column clicked
statusReason: expected "vi.fn()" to be called at least once

[Survived] ConditionalExpression
src/ui/data/DataTable.tsx:87:40
     onSort(columnId, nextDirection)
   }
 
-  const allSelected = showSelection && data.length > 0 && data.every((row) => isRowSelected(row))
+  const allSelected = showSelection && true && data.every((row) => isRowSelected(row))
   const showEmptyState = !isLoading && data.length === 0
 

[Survived] EqualityOperator
src/ui/data/DataTable.tsx:87:40
     onSort(columnId, nextDirection)
   }
 
-  const allSelected = showSelection && data.length > 0 && data.every((row) => isRowSelected(row))
+  const allSelected = showSelection && data.length >= 0 && data.every((row) => isRowSelected(row))
   const showEmptyState = !isLoading && data.length === 0
 

[Killed] ConditionalExpression
src/ui/data/DataTable.tsx:88:26
   }
 
   const allSelected = showSelection && data.length > 0 && data.every((row) => isRowSelected(row))
-  const showEmptyState = !isLoading && data.length === 0
+  const showEmptyState = false
 
   return (
killedBy: Data primitives DataTable renders empty state when no data available
statusReason: Unable to find an element with the text: No rows. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="table-responsive border rounded shadow-sm bg-body"
    >

[Killed] EqualityOperator
src/ui/data/DataTable.tsx:88:40
   }
 
   const allSelected = showSelection && data.length > 0 && data.every((row) => isRowSelected(row))
-  const showEmptyState = !isLoading && data.length === 0
+  const showEmptyState = !isLoading && data.length !== 0
 
   return (
killedBy: Data primitives DataTable renders empty state when no data available
statusReason: Unable to find an element with the text: No rows. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="table-responsive border rounded shadow-sm bg-body"
    >

[Killed] LogicalOperator
src/ui/data/DataTable.tsx:96:24
       <div className={composeClassNames(UI_CLASS_TABLE_WRAPPER, className)}>
         <table
           className={composeClassNames(UI_CLASS_TABLE, UI_CLASS_TABLE_DENSITY_MAP[density])}
-          data-testid={testId ?? UI_TEST_ID_DATA_TABLE}
+          data-testid={testId && UI_TEST_ID_DATA_TABLE}
         >
           <thead>
killedBy: Data primitives DataTable renders provided rows
statusReason: Unable to find an element by: [data-testid="ui-data-table"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="table-responsive border rounded shadow-sm bg-body"
    >

[Killed] BlockStatement
src/ui/data/DataTable.tsx:110:40
                   />
                 </th>
               ) : null}
-              {columns.map((column) => {
-                const headerLabel = resolveHeaderLabel(column.header, column.id)
-                return (
-                  <th key={column.id} className={UI_CLASS_TABLE_HEADER_CELL}>
-                    <div className="d-flex align-items-center gap-2">
-                      <span>{column.header}</span>
-                      {column.sortable && onSort ? (
-                        <button
-                          type="button"
-                          className={UI_CLASS_TABLE_SORT_BUTTON}
-                          onClick={() => handleSort(column.id)}
-                          aria-label={`Sort ${headerLabel}`}
-                        >
-                          {sortState?.columnId === column.id ? sortState.direction.toUpperCase() : '⇅'}
-                        </button>
-                      ) : null}
-                    </div>
-                  </th>
-                )
-              })}
+              {columns.map((column) => {})}
             </tr>
           </thead>
killedBy: Data primitives DataTable invokes sort handler when sortable column clicked
statusReason: Unable to find an accessible element with the role "button" and name `/sort/i`

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] ConditionalExpression
src/ui/data/DataTable.tsx:116:24
                   <th key={column.id} className={UI_CLASS_TABLE_HEADER_CELL}>
                     <div className="d-flex align-items-center gap-2">
                       <span>{column.header}</span>
-                      {column.sortable && onSort ? (
+                      {false ? (
                         <button
                           type="button"
killedBy: Data primitives DataTable invokes sort handler when sortable column clicked
statusReason: Unable to find an accessible element with the role "button" and name `/sort/i`

Here are the accessible roles:

  table:

  Name "":
  <table

[Survived] LogicalOperator
src/ui/data/DataTable.tsx:116:24
                   <th key={column.id} className={UI_CLASS_TABLE_HEADER_CELL}>
                     <div className="d-flex align-items-center gap-2">
                       <span>{column.header}</span>
-                      {column.sortable && onSort ? (
+                      {column.sortable || onSort ? (
                         <button
                           type="button"

[Killed] ArrowFunction
src/ui/data/DataTable.tsx:120:36
                         <button
                           type="button"
                           className={UI_CLASS_TABLE_SORT_BUTTON}
-                          onClick={() => handleSort(column.id)}
+                          onClick={() => undefined}
                           aria-label={`Sort ${headerLabel}`}
                         >
killedBy: Data primitives DataTable invokes sort handler when sortable column clicked
statusReason: expected "vi.fn()" to be called at least once

[Survived] OptionalChaining
src/ui/data/DataTable.tsx:123:28
                           onClick={() => handleSort(column.id)}
                           aria-label={`Sort ${headerLabel}`}
                         >
-                          {sortState?.columnId === column.id ? sortState.direction.toUpperCase() : '⇅'}
+                          {sortState.columnId === column.id ? sortState.direction.toUpperCase() : '⇅'}
                         </button>
                       ) : null}

[Survived] ConditionalExpression
src/ui/data/DataTable.tsx:123:28
                           onClick={() => handleSort(column.id)}
                           aria-label={`Sort ${headerLabel}`}
                         >
-                          {sortState?.columnId === column.id ? sortState.direction.toUpperCase() : '⇅'}
+                          {true ? sortState.direction.toUpperCase() : '⇅'}
                         </button>
                       ) : null}

[Killed] BlockStatement
src/ui/data/DataTable.tsx:133:32
             </tr>
           </thead>
           <tbody>
-            {data.map((row) => {
-              const key = rowKey(row)
-              return (
-                <tr key={key}>
-                  {showSelection ? (
-                    <td className={UI_CLASS_TABLE_SELECTION_CELL}>
-                      <Form.Check
-                        type="checkbox"
-                        aria-label={`Select row ${key}`}
-                        checked={isRowSelected(row)}
-                        onChange={() => handleToggleRow(row)}
-                      />
-                    </td>
-                  ) : null}
-                  {columns.map((column) => (
-                    <td key={column.id}>{column.cell(row)}</td>
-                  ))}
-                </tr>
-              )
-            })}
+            {data.map((row) => {})}
           </tbody>
         </table>
killedBy: Data primitives DataTable toggles selection via checkbox
statusReason: Unable to fire a "click" event - please provide a DOM element.

[Survived] StringLiteral
src/ui/data/DataTable.tsx:141:37
                     <td className={UI_CLASS_TABLE_SELECTION_CELL}>
                       <Form.Check
                         type="checkbox"
-                        aria-label={`Select row ${key}`}
+                        aria-label={``}
                         checked={isRowSelected(row)}
                         onChange={() => handleToggleRow(row)}

[Killed] ArrowFunction
src/ui/data/DataTable.tsx:143:35
                         type="checkbox"
                         aria-label={`Select row ${key}`}
                         checked={isRowSelected(row)}
-                        onChange={() => handleToggleRow(row)}
+                        onChange={() => undefined}
                       />
                     </td>
killedBy: Data primitives DataTable toggles selection via checkbox
statusReason: expected "vi.fn()" to be called at least once

[Survived] ArrowFunction
src/ui/data/DataTable.tsx:147:32
                       />
                     </td>
                   ) : null}
-                  {columns.map((column) => (
-                    <td key={column.id}>{column.cell(row)}</td>
-                  ))}
+                  {columns.map(() => undefined)}
                 </tr>
               )
