[NoCoverage] StringLiteral
src/ui/feedback/InlineAlert.tsx:13:13
 import { VisibilityGate } from '../utils/PermissionGate'
 
 export function InlineAlert({
-  variant = 'info',
+  variant = "",
   title,
   children,

[Killed] BlockStatement
src/ui/feedback/InlineAlert.tsx:24:22
   ability,
   permissionKey,
   permissionFallback,
-}: InlineAlertProps) {
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <Alert
-        variant={variant}
-        className={composeClassNames(UI_CLASS_INLINE_ALERT, className)}
-        dismissible={dismissible}
-        onClose={onClose}
-        data-testid={testId ?? UI_TEST_ID_INLINE_ALERT}
-      >
-        {title ? <Alert.Heading>{title}</Alert.Heading> : null}
-        {children}
-        {actions ? <div className={UI_CLASS_ALERT_ACTIONS}>{actions}</div> : null}
-      </Alert>
-    </VisibilityGate>
-  )
-}
+}: InlineAlertProps) {}
 
 
killedBy: Feedback primitives InlineAlert applies alert styling
statusReason: Unable to find an element by: [data-testid="ui-inline-alert"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/ui/feedback/InlineAlert.tsx:32:22
         className={composeClassNames(UI_CLASS_INLINE_ALERT, className)}
         dismissible={dismissible}
         onClose={onClose}
-        data-testid={testId ?? UI_TEST_ID_INLINE_ALERT}
+        data-testid={testId && UI_TEST_ID_INLINE_ALERT}
       >
         {title ? <Alert.Heading>{title}</Alert.Heading> : null}
killedBy: Feedback primitives InlineAlert applies alert styling
statusReason: Unable to find an element by: [data-testid="ui-inline-alert"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fade mb-3 alert alert-info show"
      role="alert"
