[Survived] StringLiteral
src/ui/forms/CheckboxField.tsx:41:32
           {...register(name)}
         />
         {description ? (
-          <Form.Text muted id={`${fieldId}-description`}>
+          <Form.Text muted id={``}>
             {description}
           </Form.Text>

[Killed] LogicalOperator
src/ui/forms/CheckboxField.tsx:47:21
         ) : null}
         {fieldError ? (
           <Form.Control.Feedback type="invalid" role="alert">
-            {String(fieldError?.message ?? '')}
+            {String(fieldError?.message && '')}
           </Form.Control.Feedback>
         ) : null}
killedBy: Form primitives CheckboxField displays validation errors from form state
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Required selection
Received:

[Survived] OptionalChaining
src/ui/forms/CheckboxField.tsx:47:21
         ) : null}
         {fieldError ? (
           <Form.Control.Feedback type="invalid" role="alert">
-            {String(fieldError?.message ?? '')}
+            {String(fieldError.message ?? '')}
           </Form.Control.Feedback>
         ) : null}
