[Killed] StringLiteral
src/ui/forms/DateField.tsx:26:19
     formState: { errors },
   } = useFormContext<TFieldValues>()
   const fieldError = errors[name]
-  const fieldId = `${String(name)}-date`
+  const fieldId = ``
 
   return (
killedBy: Form primitives DateField applies min attribute when provided
statusReason: Found a label with the text of: due date, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] EqualityOperator
src/ui/forms/DateField.tsx:37:24
           type={UI_FORM_CONTROL_TYPE_DATE}
           min={min}
           max={max}
-          placeholder={typeof placeholder === 'string' ? placeholder : undefined}
+          placeholder={typeof placeholder !== 'string' ? placeholder : undefined}
           disabled={disabled}
           isInvalid={Boolean(fieldError)}
killedBy: Form primitives DateField applies placeholder only for string values
statusReason: expected '' to be 'Select start' // Object.is equality

[Killed] ConditionalExpression
src/ui/forms/DateField.tsx:37:24
           type={UI_FORM_CONTROL_TYPE_DATE}
           min={min}
           max={max}
-          placeholder={typeof placeholder === 'string' ? placeholder : undefined}
+          placeholder={false ? placeholder : undefined}
           disabled={disabled}
           isInvalid={Boolean(fieldError)}
killedBy: Form primitives DateField applies placeholder only for string values
statusReason: expected '' to be 'Select start' // Object.is equality
