[Killed] LogicalOperator
src/ui/navigation/Breadcrumbs.tsx:20:89
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <nav aria-label="breadcrumbs">
-        <ol className={composeClassNames(UI_CLASS_BREADCRUMBS, className)} data-testid={testId ?? UI_TEST_ID_BREADCRUMBS}>
+        <ol className={composeClassNames(UI_CLASS_BREADCRUMBS, className)} data-testid={testId && UI_TEST_ID_BREADCRUMBS}>
           {items.map((item) => (
             <li key={item.id} className={composeClassNames('breadcrumb-item', item.active ? 'active' : undefined)}>
killedBy: Navigation primitives Breadcrumbs display provided trail
statusReason: Unable to find an element by: [data-testid="ui-breadcrumbs"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      aria-label="breadcrumbs"
    >

[Killed] ArrowFunction
src/ui/navigation/Breadcrumbs.tsx:21:22
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <nav aria-label="breadcrumbs">
         <ol className={composeClassNames(UI_CLASS_BREADCRUMBS, className)} data-testid={testId ?? UI_TEST_ID_BREADCRUMBS}>
-          {items.map((item) => (
-            <li key={item.id} className={composeClassNames('breadcrumb-item', item.active ? 'active' : undefined)}>
-              {item.active || !item.href ? (
-                <span>{item.label}</span>
-              ) : (
-                <a
-                  href={item.href}
-                  onClick={(event) => {
-                    if (item.onClick) {
-                      event.preventDefault()
-                      item.onClick()
-                    }
-                  }}
-                  aria-current={item.active ? 'page' : undefined}
-                >
-                  {item.label}
-                </a>
-              )}
-            </li>
-          ))}
+          {items.map(() => undefined)}
         </ol>
       </nav>
killedBy: Navigation primitives Breadcrumbs invoke handlers for navigable items
statusReason: Unable to find an element with the text: home. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      aria-label="breadcrumbs"
    >

[Killed] StringLiteral
src/ui/navigation/Breadcrumbs.tsx:22:93
       <nav aria-label="breadcrumbs">
         <ol className={composeClassNames(UI_CLASS_BREADCRUMBS, className)} data-testid={testId ?? UI_TEST_ID_BREADCRUMBS}>
           {items.map((item) => (
-            <li key={item.id} className={composeClassNames('breadcrumb-item', item.active ? 'active' : undefined)}>
+            <li key={item.id} className={composeClassNames('breadcrumb-item', item.active ? "" : undefined)}>
               {item.active || !item.href ? (
                 <span>{item.label}</span>
killedBy: Navigation primitives Breadcrumbs invoke handlers for navigable items
statusReason: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  breadcrumb-item

[Killed] ConditionalExpression
src/ui/navigation/Breadcrumbs.tsx:23:16
         <ol className={composeClassNames(UI_CLASS_BREADCRUMBS, className)} data-testid={testId ?? UI_TEST_ID_BREADCRUMBS}>
           {items.map((item) => (
             <li key={item.id} className={composeClassNames('breadcrumb-item', item.active ? 'active' : undefined)}>
-              {item.active || !item.href ? (
+              {true ? (
                 <span>{item.label}</span>
               ) : (
killedBy: Navigation primitives Breadcrumbs invoke handlers for navigable items
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BooleanLiteral
src/ui/navigation/Breadcrumbs.tsx:23:31
         <ol className={composeClassNames(UI_CLASS_BREADCRUMBS, className)} data-testid={testId ?? UI_TEST_ID_BREADCRUMBS}>
           {items.map((item) => (
             <li key={item.id} className={composeClassNames('breadcrumb-item', item.active ? 'active' : undefined)}>
-              {item.active || !item.href ? (
+              {item.active || item.href ? (
                 <span>{item.label}</span>
               ) : (
killedBy: Navigation primitives Breadcrumbs invoke handlers for navigable items
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/ui/navigation/Breadcrumbs.tsx:28:39
               ) : (
                 <a
                   href={item.href}
-                  onClick={(event) => {
-                    if (item.onClick) {
-                      event.preventDefault()
-                      item.onClick()
-                    }
-                  }}
+                  onClick={(event) => {}}
                   aria-current={item.active ? 'page' : undefined}
                 >
killedBy: Navigation primitives Breadcrumbs invoke handlers for navigable items
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ConditionalExpression
src/ui/navigation/Breadcrumbs.tsx:29:25
                 <a
                   href={item.href}
                   onClick={(event) => {
-                    if (item.onClick) {
+                    if (false) {
                       event.preventDefault()
                       item.onClick()
killedBy: Navigation primitives Breadcrumbs invoke handlers for navigable items
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/ui/navigation/Breadcrumbs.tsx:29:39
                 <a
                   href={item.href}
                   onClick={(event) => {
-                    if (item.onClick) {
-                      event.preventDefault()
-                      item.onClick()
-                    }
+                    if (item.onClick) {}
                   }}
                   aria-current={item.active ? 'page' : undefined}
killedBy: Navigation primitives Breadcrumbs invoke handlers for navigable items
statusReason: expected "vi.fn()" to be called once, but got 0 times

[NoCoverage] StringLiteral
src/ui/navigation/Breadcrumbs.tsx:34:47
                       item.onClick()
                     }
                   }}
-                  aria-current={item.active ? 'page' : undefined}
+                  aria-current={item.active ? "" : undefined}
                 >
                   {item.label}
