[Killed] ArrayDeclaration
src/ui/utils/classNames.ts:3:28
 export const composeClassNames = (...classes: Array<string | false | null | undefined>): string => {
   const seen = new Set<string>()
-  const tokens: string[] = []
+  const tokens: string[] = ["Stryker was here"]
 
   classes.forEach((entry) => {
killedBy: composeClassNames joins provided class names in order
statusReason: expected 'Stryker was here d-flex gap-2' to be 'd-flex gap-2' // Object.is equality

[Killed] BlockStatement
src/ui/utils/classNames.ts:5:30
   const seen = new Set<string>()
   const tokens: string[] = []
 
-  classes.forEach((entry) => {
-    if (!entry) {
-      return
-    }
-    const normalized = entry.trim()
-    if (!normalized) {
-      return
-    }
-    normalized
-      .split(/\s+/u)
-      .filter(Boolean)
-      .forEach((token) => {
-        if (seen.has(token)) {
-          return
-        }
-        seen.add(token)
-        tokens.push(token)
-      })
-  })
+  classes.forEach((entry) => {})
 
   return tokens.join(' ')
killedBy: Typography primitives BodyText applies base typography class
statusReason: expect(element).toHaveClass("text-body")

Expected the element to have class:
  text-body
Received:

[Killed] BlockStatement
src/ui/utils/classNames.ts:6:17
   const tokens: string[] = []
 
   classes.forEach((entry) => {
-    if (!entry) {
-      return
-    }
+    if (!entry) {}
     const normalized = entry.trim()
     if (!normalized) {
killedBy: Form primitives FormField renders label with required marker when flagged
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
src/ui/utils/classNames.ts:6:9
   const tokens: string[] = []
 
   classes.forEach((entry) => {
-    if (!entry) {
+    if (false) {
       return
     }
killedBy: Form primitives FormField renders label with required marker when flagged
statusReason: Cannot read properties of undefined (reading 'trim')

[Survived] MethodExpression
src/ui/utils/classNames.ts:9:24
     if (!entry) {
       return
     }
-    const normalized = entry.trim()
+    const normalized = entry
     if (!normalized) {
       return

[Killed] BooleanLiteral
src/ui/utils/classNames.ts:10:9
       return
     }
     const normalized = entry.trim()
-    if (!normalized) {
+    if (normalized) {
       return
     }
killedBy: composeClassNames joins provided class names in order
statusReason: expected '' to be 'd-flex gap-2' // Object.is equality

[Killed] ConditionalExpression
src/ui/utils/classNames.ts:10:9
       return
     }
     const normalized = entry.trim()
-    if (!normalized) {
+    if (true) {
       return
     }
killedBy: composeClassNames joins provided class names in order
statusReason: expected '' to be 'align-items-center gap-2' // Object.is equality

[Survived] MethodExpression
src/ui/utils/classNames.ts:13:5
     if (!normalized) {
       return
     }
-    normalized
-      .split(/\s+/u)
-      .filter(Boolean)
+    normalized.split(/\s+/u)
       .forEach((token) => {
         if (seen.has(token)) {

[Survived] Regex
src/ui/utils/classNames.ts:14:14
       return
     }
     normalized
-      .split(/\s+/u)
+      .split(/\s/u)
       .filter(Boolean)
       .forEach((token) => {

[Killed] BlockStatement
src/ui/utils/classNames.ts:16:27
     normalized
       .split(/\s+/u)
       .filter(Boolean)
-      .forEach((token) => {
-        if (seen.has(token)) {
-          return
-        }
-        seen.add(token)
-        tokens.push(token)
-      })
+      .forEach((token) => {})
   })
 
killedBy: Data primitives DataTable renders provided rows
statusReason: expect(element).toHaveClass("table align-middle mb-0")

Expected the element to have class:
  table align-middle mb-0
Received:

[Killed] ConditionalExpression
src/ui/utils/classNames.ts:17:13
       .split(/\s+/u)
       .filter(Boolean)
       .forEach((token) => {
-        if (seen.has(token)) {
+        if (true) {
           return
         }
killedBy: Data primitives DataTable renders provided rows
statusReason: expect(element).toHaveClass("table align-middle mb-0")

Expected the element to have class:
  table align-middle mb-0
Received:

[Killed] BlockStatement
src/ui/utils/classNames.ts:17:30
       .split(/\s+/u)
       .filter(Boolean)
       .forEach((token) => {
-        if (seen.has(token)) {
-          return
-        }
+        if (seen.has(token)) {}
         seen.add(token)
         tokens.push(token)
killedBy: composeClassNames deduplicates repeated classes without changing order
statusReason: expected 'text-center gap-2 text-center' to be 'text-center gap-2' // Object.is equality

[Killed] StringLiteral
src/ui/utils/classNames.ts:25:22
       })
   })
 
-  return tokens.join(' ')
+  return tokens.join("")
 }
 
killedBy: composeClassNames joins provided class names in order
statusReason: expected 'd-flexgap-2' to be 'd-flex gap-2' // Object.is equality
