[Killed] BlockStatement
src/utils/selectors.ts:20:78
   onlyActive?: boolean
 }
 
-const coerceDate = (value: Date | string | null | undefined): Date | null => {
-  if (!value) {
-    return null
-  }
-  if (value instanceof Date) {
-    return value
-  }
-  const parsed = new Date(value)
-  return Number.isNaN(parsed.getTime()) ? null : parsed
-}
+const coerceDate = (value: Date | string | null | undefined): Date | null => {}
 
 export const selectLicensesByStatus = (licenses: License[], statuses: LicenseStatus[]): License[] => {
killedBy: selectors selects expiring licenses within a threshold
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] BooleanLiteral
src/utils/selectors.ts:21:7
 }
 
 const coerceDate = (value: Date | string | null | undefined): Date | null => {
-  if (!value) {
+  if (value) {
     return null
   }
killedBy: selectors selects expiring licenses within a threshold
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] ConditionalExpression
src/utils/selectors.ts:21:7
 }
 
 const coerceDate = (value: Date | string | null | undefined): Date | null => {
-  if (!value) {
+  if (true) {
     return null
   }
killedBy: selectors selects expiring licenses within a threshold
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] ConditionalExpression
src/utils/selectors.ts:24:7
   if (!value) {
     return null
   }
-  if (value instanceof Date) {
+  if (true) {
     return value
   }
killedBy: selectors selects expiring licenses within a threshold
statusReason: expiry.getTime is not a function

[Survived] BlockStatement
src/utils/selectors.ts:24:30
   if (!value) {
     return null
   }
-  if (value instanceof Date) {
-    return value
-  }
+  if (value instanceof Date) {}
   const parsed = new Date(value)
   return Number.isNaN(parsed.getTime()) ? null : parsed

[Killed] BlockStatement
src/utils/selectors.ts:31:102
   return Number.isNaN(parsed.getTime()) ? null : parsed
 }
 
-export const selectLicensesByStatus = (licenses: License[], statuses: LicenseStatus[]): License[] => {
-  if (!Array.isArray(statuses) || statuses.length === 0) {
-    return [...licenses]
-  }
-  const statusSet = new Set(statuses)
-  return licenses.filter((license) => statusSet.has(license.status))
-}
+export const selectLicensesByStatus = (licenses: License[], statuses: LicenseStatus[]): License[] => {}
 
 export const selectLicensesForProduct = (licenses: License[], productId: string): License[] => {
killedBy: selectors filters licenses by status
statusReason: expected undefined to deeply equal [ { …(13) } ]

[Killed] BlockStatement
src/utils/selectors.ts:32:58
 }
 
 export const selectLicensesByStatus = (licenses: License[], statuses: LicenseStatus[]): License[] => {
-  if (!Array.isArray(statuses) || statuses.length === 0) {
-    return [...licenses]
-  }
+  if (!Array.isArray(statuses) || statuses.length === 0) {}
   const statusSet = new Set(statuses)
   return licenses.filter((license) => statusSet.has(license.status))
killedBy: selectors returns all licenses when no statuses are provided
statusReason: expected [] to deeply equal [ { …(13) }, { …(13) } ]

[Killed] LogicalOperator
src/utils/selectors.ts:32:7
 }
 
 export const selectLicensesByStatus = (licenses: License[], statuses: LicenseStatus[]): License[] => {
-  if (!Array.isArray(statuses) || statuses.length === 0) {
+  if (!Array.isArray(statuses) && statuses.length === 0) {
     return [...licenses]
   }
killedBy: selectors returns all licenses when no statuses are provided
statusReason: expected [] to deeply equal [ { …(13) }, { …(13) } ]

[Killed] ArrowFunction
src/utils/selectors.ts:36:26
     return [...licenses]
   }
   const statusSet = new Set(statuses)
-  return licenses.filter((license) => statusSet.has(license.status))
+  return licenses.filter(() => undefined)
 }
 
killedBy: selectors filters licenses by status
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] MethodExpression
src/utils/selectors.ts:36:10
     return [...licenses]
   }
   const statusSet = new Set(statuses)
-  return licenses.filter((license) => statusSet.has(license.status))
+  return licenses
 }
 
killedBy: selectors filters licenses by status
statusReason: expected [ { …(13) }, { …(13) } ] to deeply equal [ { …(13) } ]

[Killed] BlockStatement
src/utils/selectors.ts:39:96
   return licenses.filter((license) => statusSet.has(license.status))
 }
 
-export const selectLicensesForProduct = (licenses: License[], productId: string): License[] => {
-  if (!productId) {
-    return []
-  }
-  return licenses.filter((license) => license.productId === productId)
-}
+export const selectLicensesForProduct = (licenses: License[], productId: string): License[] => {}
 
 export const selectFilteredLicenses = (licenses: License[], options: LicenseFilterOptions = {}): License[] => {
killedBy: selectors filters licenses belonging to a product
statusReason: expected undefined to deeply equal [ { …(13) } ]

[Killed] ConditionalExpression
src/utils/selectors.ts:40:7
 }
 
 export const selectLicensesForProduct = (licenses: License[], productId: string): License[] => {
-  if (!productId) {
+  if (true) {
     return []
   }
killedBy: selectors filters licenses belonging to a product
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] BooleanLiteral
src/utils/selectors.ts:40:7
 }
 
 export const selectLicensesForProduct = (licenses: License[], productId: string): License[] => {
-  if (!productId) {
+  if (productId) {
     return []
   }
killedBy: selectors filters licenses belonging to a product
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] ArrowFunction
src/utils/selectors.ts:43:26
   if (!productId) {
     return []
   }
-  return licenses.filter((license) => license.productId === productId)
+  return licenses.filter(() => undefined)
 }
 
killedBy: selectors filters licenses belonging to a product
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] ConditionalExpression
src/utils/selectors.ts:43:39
   if (!productId) {
     return []
   }
-  return licenses.filter((license) => license.productId === productId)
+  return licenses.filter((license) => false)
 }
 
killedBy: selectors filters licenses belonging to a product
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] BlockStatement
src/utils/selectors.ts:46:111
   return licenses.filter((license) => license.productId === productId)
 }
 
-export const selectFilteredLicenses = (licenses: License[], options: LicenseFilterOptions = {}): License[] => {
-  const { statuses, productId, tierCodes } = options
-  const tierSet = tierCodes ? new Set(tierCodes) : null
-  const statusSet = statuses ? new Set(statuses) : null
-
-  return licenses.filter((license) => {
-    if (statusSet && !statusSet.has(license.status)) {
-      return false
-    }
-    if (productId && license.productId !== productId) {
-      return false
-    }
-    if (tierSet && !tierSet.has(license.tierCode)) {
-      return false
-    }
-    return true
-  })
-}
+export const selectFilteredLicenses = (licenses: License[], options: LicenseFilterOptions = {}): License[] => {}
 
 export const selectExpiringLicenses = (
killedBy: selectors filters licenses with composite criteria
statusReason: expected undefined to deeply equal [ { …(13) } ]

[Killed] MethodExpression
src/utils/selectors.ts:51:10
   const tierSet = tierCodes ? new Set(tierCodes) : null
   const statusSet = statuses ? new Set(statuses) : null
 
-  return licenses.filter((license) => {
-    if (statusSet && !statusSet.has(license.status)) {
-      return false
-    }
-    if (productId && license.productId !== productId) {
-      return false
-    }
-    if (tierSet && !tierSet.has(license.tierCode)) {
-      return false
-    }
-    return true
-  })
+  return licenses
 }
 
killedBy: selectors filters licenses with composite criteria
statusReason: expected [ { …(13) }, { …(13) }, { …(13) } ] to deeply equal [ { …(13) } ]

[Killed] BlockStatement
src/utils/selectors.ts:51:39
   const tierSet = tierCodes ? new Set(tierCodes) : null
   const statusSet = statuses ? new Set(statuses) : null
 
-  return licenses.filter((license) => {
-    if (statusSet && !statusSet.has(license.status)) {
-      return false
-    }
-    if (productId && license.productId !== productId) {
-      return false
-    }
-    if (tierSet && !tierSet.has(license.tierCode)) {
-      return false
-    }
-    return true
-  })
+  return licenses.filter((license) => {})
 }
 
killedBy: selectors filters licenses with composite criteria
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] LogicalOperator
src/utils/selectors.ts:52:9
   const statusSet = statuses ? new Set(statuses) : null
 
   return licenses.filter((license) => {
-    if (statusSet && !statusSet.has(license.status)) {
+    if (statusSet || !statusSet.has(license.status)) {
       return false
     }
killedBy: selectors filters licenses with composite criteria
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] BooleanLiteral
src/utils/selectors.ts:52:22
   const statusSet = statuses ? new Set(statuses) : null
 
   return licenses.filter((license) => {
-    if (statusSet && !statusSet.has(license.status)) {
+    if (statusSet && statusSet.has(license.status)) {
       return false
     }
killedBy: selectors filters licenses with composite criteria
statusReason: expected [] to deeply equal [ { …(13) } ]

[NoCoverage] BooleanLiteral
src/utils/selectors.ts:53:14
 
   return licenses.filter((license) => {
     if (statusSet && !statusSet.has(license.status)) {
-      return false
+      return true
     }
     if (productId && license.productId !== productId) {

[Killed] EqualityOperator
src/utils/selectors.ts:55:22
     if (statusSet && !statusSet.has(license.status)) {
       return false
     }
-    if (productId && license.productId !== productId) {
+    if (productId && license.productId === productId) {
       return false
     }
killedBy: selectors filters licenses with composite criteria
statusReason: expected [ { …(13) } ] to deeply equal [ { …(13) } ]

[Killed] LogicalOperator
src/utils/selectors.ts:55:9
     if (statusSet && !statusSet.has(license.status)) {
       return false
     }
-    if (productId && license.productId !== productId) {
+    if (productId || license.productId !== productId) {
       return false
     }
killedBy: selectors filters licenses with composite criteria
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] BooleanLiteral
src/utils/selectors.ts:56:14
       return false
     }
     if (productId && license.productId !== productId) {
-      return false
+      return true
     }
     if (tierSet && !tierSet.has(license.tierCode)) {
killedBy: selectors filters licenses with composite criteria
statusReason: expected [ { …(13) }, { …(13) } ] to deeply equal [ { …(13) } ]

[Killed] ConditionalExpression
src/utils/selectors.ts:58:9
     if (productId && license.productId !== productId) {
       return false
     }
-    if (tierSet && !tierSet.has(license.tierCode)) {
+    if (false) {
       return false
     }
killedBy: selectors filters licenses with composite criteria
statusReason: expected [ { …(13) }, { …(13) } ] to deeply equal [ { …(13) } ]

[Killed] BooleanLiteral
src/utils/selectors.ts:58:20
     if (productId && license.productId !== productId) {
       return false
     }
-    if (tierSet && !tierSet.has(license.tierCode)) {
+    if (tierSet && tierSet.has(license.tierCode)) {
       return false
     }
killedBy: selectors filters licenses with composite criteria
statusReason: expected [ { …(13) } ] to deeply equal [ { …(13) } ]

[Killed] BooleanLiteral
src/utils/selectors.ts:59:14
       return false
     }
     if (tierSet && !tierSet.has(license.tierCode)) {
-      return false
+      return true
     }
     return true
killedBy: selectors filters licenses with composite criteria
statusReason: expected [ { …(13) }, { …(13) } ] to deeply equal [ { …(13) } ]

[Killed] BlockStatement
src/utils/selectors.ts:68:17
 export const selectExpiringLicenses = (
   licenses: License[],
   options: ExpiringLicenseOptions = {},
-): License[] => {
-  const { withinDays = LICENSE_EXPIRY_WARNING_DAYS, now = new Date() } = options
-  const nowEpoch = now.getTime()
-  const thresholdMs = withinDays * 24 * 60 * 60 * 1_000
-
-  return licenses.filter((license) => {
-    const expiry = coerceDate(license.expiresAt)
-    if (!expiry) {
-      return false
-    }
-    const expiresEpoch = expiry.getTime()
-    if (Number.isNaN(expiresEpoch) || expiresEpoch < nowEpoch) {
-      return false
-    }
-    return expiresEpoch - nowEpoch <= thresholdMs
-  })
-}
+): License[] => {}
 
 export const selectProductsByActivity = (products: Product[], isActive = true): Product[] =>
killedBy: selectors selects expiring licenses within a threshold
statusReason: expected undefined to deeply equal [ { …(13) } ]

[Killed] ArithmeticOperator
src/utils/selectors.ts:71:23
 ): License[] => {
   const { withinDays = LICENSE_EXPIRY_WARNING_DAYS, now = new Date() } = options
   const nowEpoch = now.getTime()
-  const thresholdMs = withinDays * 24 * 60 * 60 * 1_000
+  const thresholdMs = withinDays * 24 * 60 * 60 / 1_000
 
   return licenses.filter((license) => {
killedBy: selectors selects expiring licenses within a threshold
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] ArithmeticOperator
src/utils/selectors.ts:71:23
 ): License[] => {
   const { withinDays = LICENSE_EXPIRY_WARNING_DAYS, now = new Date() } = options
   const nowEpoch = now.getTime()
-  const thresholdMs = withinDays * 24 * 60 * 60 * 1_000
+  const thresholdMs = withinDays * 24 * 60 / 60 * 1_000
 
   return licenses.filter((license) => {
killedBy: selectors selects expiring licenses within a threshold
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] BlockStatement
src/utils/selectors.ts:73:39
   const nowEpoch = now.getTime()
   const thresholdMs = withinDays * 24 * 60 * 60 * 1_000
 
-  return licenses.filter((license) => {
-    const expiry = coerceDate(license.expiresAt)
-    if (!expiry) {
-      return false
-    }
-    const expiresEpoch = expiry.getTime()
-    if (Number.isNaN(expiresEpoch) || expiresEpoch < nowEpoch) {
-      return false
-    }
-    return expiresEpoch - nowEpoch <= thresholdMs
-  })
+  return licenses.filter((license) => {})
 }
 
killedBy: selectors selects expiring licenses within a threshold
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] MethodExpression
src/utils/selectors.ts:73:10
   const nowEpoch = now.getTime()
   const thresholdMs = withinDays * 24 * 60 * 60 * 1_000
 
-  return licenses.filter((license) => {
-    const expiry = coerceDate(license.expiresAt)
-    if (!expiry) {
-      return false
-    }
-    const expiresEpoch = expiry.getTime()
-    if (Number.isNaN(expiresEpoch) || expiresEpoch < nowEpoch) {
-      return false
-    }
-    return expiresEpoch - nowEpoch <= thresholdMs
-  })
+  return licenses
 }
 
killedBy: selectors selects expiring licenses within a threshold
statusReason: expected [ { …(13) }, { …(13) }, { …(13) } ] to deeply equal [ { …(13) } ]

[Killed] ConditionalExpression
src/utils/selectors.ts:75:9
 
   return licenses.filter((license) => {
     const expiry = coerceDate(license.expiresAt)
-    if (!expiry) {
+    if (true) {
       return false
     }
killedBy: selectors selects expiring licenses within a threshold
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] BlockStatement
src/utils/selectors.ts:75:18
 
   return licenses.filter((license) => {
     const expiry = coerceDate(license.expiresAt)
-    if (!expiry) {
-      return false
-    }
+    if (!expiry) {}
     const expiresEpoch = expiry.getTime()
     if (Number.isNaN(expiresEpoch) || expiresEpoch < nowEpoch) {
killedBy: selectors selects expiring licenses within a threshold
statusReason: Cannot read properties of null (reading 'getTime')

[Killed] BooleanLiteral
src/utils/selectors.ts:76:14
   return licenses.filter((license) => {
     const expiry = coerceDate(license.expiresAt)
     if (!expiry) {
-      return false
+      return true
     }
     const expiresEpoch = expiry.getTime()
killedBy: selectors selects expiring licenses within a threshold
statusReason: expected [ { …(13) }, { …(13) } ] to deeply equal [ { …(13) } ]

[Killed] ConditionalExpression
src/utils/selectors.ts:79:9
       return false
     }
     const expiresEpoch = expiry.getTime()
-    if (Number.isNaN(expiresEpoch) || expiresEpoch < nowEpoch) {
+    if (true) {
       return false
     }
killedBy: selectors selects expiring licenses within a threshold
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] EqualityOperator
src/utils/selectors.ts:79:39
       return false
     }
     const expiresEpoch = expiry.getTime()
-    if (Number.isNaN(expiresEpoch) || expiresEpoch < nowEpoch) {
+    if (Number.isNaN(expiresEpoch) || expiresEpoch >= nowEpoch) {
       return false
     }
killedBy: selectors selects expiring licenses within a threshold
statusReason: expected [] to deeply equal [ { …(13) } ]

[NoCoverage] BooleanLiteral
src/utils/selectors.ts:80:14
     }
     const expiresEpoch = expiry.getTime()
     if (Number.isNaN(expiresEpoch) || expiresEpoch < nowEpoch) {
-      return false
+      return true
     }
     return expiresEpoch - nowEpoch <= thresholdMs

[Killed] EqualityOperator
src/utils/selectors.ts:82:12
     if (Number.isNaN(expiresEpoch) || expiresEpoch < nowEpoch) {
       return false
     }
-    return expiresEpoch - nowEpoch <= thresholdMs
+    return expiresEpoch - nowEpoch > thresholdMs
   })
 }
killedBy: selectors selects expiring licenses within a threshold
statusReason: expected [ { …(13) } ] to deeply equal [ { …(13) } ]

[Killed] ConditionalExpression
src/utils/selectors.ts:82:12
     if (Number.isNaN(expiresEpoch) || expiresEpoch < nowEpoch) {
       return false
     }
-    return expiresEpoch - nowEpoch <= thresholdMs
+    return false
   })
 }
killedBy: selectors selects expiring licenses within a threshold
statusReason: expected [] to deeply equal [ { …(13) } ]

[Killed] ArrowFunction
src/utils/selectors.ts:86:41
   })
 }
 
-export const selectProductsByActivity = (products: Product[], isActive = true): Product[] =>
-  products.filter((product) => product.isActive === isActive)
+export const selectProductsByActivity = () => undefined
 
 export const selectProductTiersByProduct = (
killedBy: selectors filters products by activity state
statusReason: expected undefined to deeply equal [ { …(8) } ]

[NoCoverage] BooleanLiteral
src/utils/selectors.ts:86:74
   })
 }
 
-export const selectProductsByActivity = (products: Product[], isActive = true): Product[] =>
+export const selectProductsByActivity = (products: Product[], isActive = false): Product[] =>
   products.filter((product) => product.isActive === isActive)
 

[Killed] EqualityOperator
src/utils/selectors.ts:87:32
 }
 
 export const selectProductsByActivity = (products: Product[], isActive = true): Product[] =>
-  products.filter((product) => product.isActive === isActive)
+  products.filter((product) => product.isActive !== isActive)
 
 export const selectProductTiersByProduct = (
killedBy: selectors filters products by activity state
statusReason: expected [ { …(8) } ] to deeply equal [ { …(8) } ]

[Killed] ArrowFunction
src/utils/selectors.ts:87:19
 }
 
 export const selectProductsByActivity = (products: Product[], isActive = true): Product[] =>
-  products.filter((product) => product.isActive === isActive)
+  products.filter(() => undefined)
 
 export const selectProductTiersByProduct = (
killedBy: selectors filters products by activity state
statusReason: expected [] to deeply equal [ { …(8) } ]

[Killed] BlockStatement
src/utils/selectors.ts:93:21
   tiers: ProductTier[],
   productId: string,
   options: ProductTierFilterOptions = {},
-): ProductTier[] => {
-  if (!productId) {
-    return []
-  }
-  const { onlyActive = true } = options
-  return tiers.filter((tier) => {
-    if (tier.productId !== productId) {
-      return false
-    }
-    if (onlyActive) {
-      return tier.isActive
-    }
-    return true
-  })
-}
+): ProductTier[] => {}
 
 
killedBy: selectors filters tiers for a product and respects active flag
statusReason: expected undefined to deeply equal [ { …(11) } ]

[Killed] ConditionalExpression
src/utils/selectors.ts:94:7
   productId: string,
   options: ProductTierFilterOptions = {},
 ): ProductTier[] => {
-  if (!productId) {
+  if (true) {
     return []
   }
killedBy: selectors filters tiers for a product and respects active flag
statusReason: expected [] to deeply equal [ { …(11) } ]

[Killed] BooleanLiteral
src/utils/selectors.ts:94:7
   productId: string,
   options: ProductTierFilterOptions = {},
 ): ProductTier[] => {
-  if (!productId) {
+  if (productId) {
     return []
   }
killedBy: selectors filters tiers for a product and respects active flag
statusReason: expected [] to deeply equal [ { …(11) } ]

[Killed] ArrayDeclaration
src/utils/selectors.ts:95:12
   options: ProductTierFilterOptions = {},
 ): ProductTier[] => {
   if (!productId) {
-    return []
+    return ["Stryker was here"]
   }
   const { onlyActive = true } = options
killedBy: selectors returns an empty array when product id is missing for tier selection
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BooleanLiteral
src/utils/selectors.ts:97:24
   if (!productId) {
     return []
   }
-  const { onlyActive = true } = options
+  const { onlyActive = false } = options
   return tiers.filter((tier) => {
     if (tier.productId !== productId) {
killedBy: selectors filters tiers for a product and respects active flag
statusReason: expected [ { …(11) }, { …(11) } ] to deeply equal [ { …(11) } ]

[Killed] MethodExpression
src/utils/selectors.ts:98:10
     return []
   }
   const { onlyActive = true } = options
-  return tiers.filter((tier) => {
-    if (tier.productId !== productId) {
-      return false
-    }
-    if (onlyActive) {
-      return tier.isActive
-    }
-    return true
-  })
+  return tiers
 }
 
killedBy: selectors filters tiers for a product and respects active flag
statusReason: expected [ { …(11) }, { …(11) }, { …(11) } ] to deeply equal [ { …(11) } ]

[Killed] BlockStatement
src/utils/selectors.ts:98:33
     return []
   }
   const { onlyActive = true } = options
-  return tiers.filter((tier) => {
-    if (tier.productId !== productId) {
-      return false
-    }
-    if (onlyActive) {
-      return tier.isActive
-    }
-    return true
-  })
+  return tiers.filter((tier) => {})
 }
 
killedBy: selectors filters tiers for a product and respects active flag
statusReason: expected [] to deeply equal [ { …(11) } ]

[Killed] ConditionalExpression
src/utils/selectors.ts:99:9
   }
   const { onlyActive = true } = options
   return tiers.filter((tier) => {
-    if (tier.productId !== productId) {
+    if (true) {
       return false
     }
killedBy: selectors filters tiers for a product and respects active flag
statusReason: expected [] to deeply equal [ { …(11) } ]

[Killed] ConditionalExpression
src/utils/selectors.ts:99:9
   }
   const { onlyActive = true } = options
   return tiers.filter((tier) => {
-    if (tier.productId !== productId) {
+    if (false) {
       return false
     }
killedBy: selectors filters tiers for a product and respects active flag
statusReason: expected [ { …(11) }, { …(11) }, { …(11) } ] to deeply equal [ { …(11) }, { …(11) } ]

[Killed] BooleanLiteral
src/utils/selectors.ts:100:14
   const { onlyActive = true } = options
   return tiers.filter((tier) => {
     if (tier.productId !== productId) {
-      return false
+      return true
     }
     if (onlyActive) {
killedBy: selectors filters tiers for a product and respects active flag
statusReason: expected [ { …(11) }, { …(11) } ] to deeply equal [ { …(11) } ]

[Killed] ConditionalExpression
src/utils/selectors.ts:102:9
     if (tier.productId !== productId) {
       return false
     }
-    if (onlyActive) {
+    if (false) {
       return tier.isActive
     }
killedBy: selectors filters tiers for a product and respects active flag
statusReason: expected [ { …(11) }, { …(11) } ] to deeply equal [ { …(11) } ]

[Killed] BlockStatement
src/utils/selectors.ts:102:21
     if (tier.productId !== productId) {
       return false
     }
-    if (onlyActive) {
-      return tier.isActive
-    }
+    if (onlyActive) {}
     return true
   })
killedBy: selectors filters tiers for a product and respects active flag
statusReason: expected [ { …(11) }, { …(11) } ] to deeply equal [ { …(11) } ]
