[Killed] BlockStatement
src/api/ApiProvider.tsx:8:62
 import { useAppConfig } from '../app/config'
 import { ApiContext } from './apiContext'
 
-export function ApiProvider({ children }: PropsWithChildren) {
-  const { apiBaseUrl } = useAppConfig()
-
-  const value = useMemo(() => {
-    return new SimpleLicenseClient(apiBaseUrl)
-  }, [apiBaseUrl])
-
-  return <ApiContext.Provider value={value}>{children}</ApiContext.Provider>
-}
+export function ApiProvider({ children }: PropsWithChildren) {}
 
 
killedBy: AppProviders renders the dashboard heading by default
statusReason: Unable to find an element with the text: Operational overview. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/api/ApiProvider.tsx:11:31
 export function ApiProvider({ children }: PropsWithChildren) {
   const { apiBaseUrl } = useAppConfig()
 
-  const value = useMemo(() => {
-    return new SimpleLicenseClient(apiBaseUrl)
-  }, [apiBaseUrl])
+  const value = useMemo(() => {}, [apiBaseUrl])
 
   return <ApiContext.Provider value={value}>{children}</ApiContext.Provider>
killedBy: AppProviders renders the dashboard heading by default
statusReason: API context is unavailable
