[Killed] BlockStatement
src/api/apiContext.tsx:8:56
 
 export const ApiContext = createContext<SimpleLicenseClient | null>(null)
 
-export const useApiClient = (): SimpleLicenseClient => {
-  const context = useContext(ApiContext)
-  if (!context) {
-    throw new Error(ERROR_MESSAGE_API_CONTEXT_UNAVAILABLE)
-  }
-  return context
-}
+export const useApiClient = (): SimpleLicenseClient => {}
 
 
killedBy: AppProviders renders the dashboard heading by default
statusReason: Cannot read properties of undefined (reading 'setToken')

[Killed] ConditionalExpression
src/api/apiContext.tsx:10:7
 
 export const useApiClient = (): SimpleLicenseClient => {
   const context = useContext(ApiContext)
-  if (!context) {
+  if (false) {
     throw new Error(ERROR_MESSAGE_API_CONTEXT_UNAVAILABLE)
   }
killedBy: ApiContext throws when the hook is used without a provider
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/api/apiContext.tsx:10:7
 
 export const useApiClient = (): SimpleLicenseClient => {
   const context = useContext(ApiContext)
-  if (!context) {
+  if (true) {
     throw new Error(ERROR_MESSAGE_API_CONTEXT_UNAVAILABLE)
   }
killedBy: AppProviders renders the dashboard heading by default
statusReason: API context is unavailable
