[Killed] BlockStatement
src/app/abilities/AbilityProvider.tsx:10:69
 
 type AbilityProviderProps = PropsWithChildren
 
-export function AbilityProvider({ children }: AbilityProviderProps) {
-  const permissions = usePermissions()
-
-  const ability = useMemo(() => buildAbilityFromPermissions(permissions), [permissions])
-
-  return <AbilityContext.Provider value={ability}>{children}</AbilityContext.Provider>
-}
+export function AbilityProvider({ children }: AbilityProviderProps) {}
 
 
killedBy: IfCan renders children when ability is allowed
statusReason: Unable to find an element by: [data-testid="allowed"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/app/abilities/AbilityProvider.tsx:13:27
 export function AbilityProvider({ children }: AbilityProviderProps) {
   const permissions = usePermissions()
 
-  const ability = useMemo(() => buildAbilityFromPermissions(permissions), [permissions])
+  const ability = useMemo(() => undefined, [permissions])
 
   return <AbilityContext.Provider value={ability}>{children}</AbilityContext.Provider>
killedBy: IfCan renders children when ability is allowed
statusReason: Cannot read properties of undefined (reading 'can')
