[Killed] BlockStatement
src/app/abilities/factory.ts:9:86
 import { getAbilitiesForPermission } from './abilityMap'
 import type { AppAbility } from './types'
 
-export const buildAbilityFromPermissions = (permissions: Permissions): AppAbility => {
-  const { can, build } = new AbilityBuilder<AppAbility>(createMongoAbility)
-
-  PERMISSION_KEYS.forEach((permission) => {
-    if (!permissions[permission]) {
-      return
-    }
-
-    const abilityTuples = getAbilitiesForPermission(permission)
-    abilityTuples.forEach(([action, subject]) => {
-      can(action, subject)
-    })
-  })
-
-  return build({
-    detectSubjectType: (subject: AbilitySubject) => subject,
-  })
-}
+export const buildAbilityFromPermissions = (permissions: Permissions): AppAbility => {}
 
 
killedBy: IfCan renders children when ability is allowed
statusReason: Cannot read properties of undefined (reading 'can')

[Killed] BlockStatement
src/app/abilities/factory.ts:12:43
 export const buildAbilityFromPermissions = (permissions: Permissions): AppAbility => {
   const { can, build } = new AbilityBuilder<AppAbility>(createMongoAbility)
 
-  PERMISSION_KEYS.forEach((permission) => {
-    if (!permissions[permission]) {
-      return
-    }
-
-    const abilityTuples = getAbilitiesForPermission(permission)
-    abilityTuples.forEach(([action, subject]) => {
-      can(action, subject)
-    })
-  })
+  PERMISSION_KEYS.forEach((permission) => {})
 
   return build({
killedBy: IfCan renders children when ability is allowed
statusReason: Unable to find an element by: [data-testid="allowed"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/app/abilities/factory.ts:13:9
   const { can, build } = new AbilityBuilder<AppAbility>(createMongoAbility)
 
   PERMISSION_KEYS.forEach((permission) => {
-    if (!permissions[permission]) {
+    if (false) {
       return
     }
killedBy: IfCan renders fallback when ability is denied
statusReason: expected <span data-testid="denied-child"></span> to be null

[Killed] ConditionalExpression
src/app/abilities/factory.ts:13:9
   const { can, build } = new AbilityBuilder<AppAbility>(createMongoAbility)
 
   PERMISSION_KEYS.forEach((permission) => {
-    if (!permissions[permission]) {
+    if (true) {
       return
     }
killedBy: IfCan renders children when ability is allowed
statusReason: Unable to find an element by: [data-testid="allowed"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/app/abilities/factory.ts:18:50
     }
 
     const abilityTuples = getAbilitiesForPermission(permission)
-    abilityTuples.forEach(([action, subject]) => {
-      can(action, subject)
-    })
+    abilityTuples.forEach(([action, subject]) => {})
   })
 
killedBy: IfCan renders children when ability is allowed
statusReason: Unable to find an element by: [data-testid="allowed"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] ArrowFunction
src/app/abilities/factory.ts:24:24
   })
 
   return build({
-    detectSubjectType: (subject: AbilitySubject) => subject,
+    detectSubjectType: () => undefined,
   })
 }
