[Killed] BlockStatement
src/app/abilities/useAbility.ts:8:45
 import type { AbilityAction, AbilitySubject } from './abilityMap'
 import type { AppAbility } from './types'
 
-export const useAbility = (): AppAbility => {
-  const context = useContext(AbilityContext)
-  if (!context) {
-    throw new Error(ERROR_MESSAGE_ABILITY_CONTEXT_UNAVAILABLE)
-  }
-  return context
-}
+export const useAbility = (): AppAbility => {}
 
 export const useCanAbility = (action: AbilityAction, subject: AbilitySubject): boolean => {
killedBy: useAbility throws when used without provider
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/app/abilities/useAbility.ts:10:7
 
 export const useAbility = (): AppAbility => {
   const context = useContext(AbilityContext)
-  if (!context) {
+  if (context) {
     throw new Error(ERROR_MESSAGE_ABILITY_CONTEXT_UNAVAILABLE)
   }
killedBy: useAbility throws when used without provider
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/app/abilities/useAbility.ts:10:7
 
 export const useAbility = (): AppAbility => {
   const context = useContext(AbilityContext)
-  if (!context) {
+  if (true) {
     throw new Error(ERROR_MESSAGE_ABILITY_CONTEXT_UNAVAILABLE)
   }
killedBy: useAbility returns an ability instance when wrapped in AbilityProvider
statusReason: Ability context is unavailable

[Killed] BlockStatement
src/app/abilities/useAbility.ts:16:91
   return context
 }
 
-export const useCanAbility = (action: AbilityAction, subject: AbilitySubject): boolean => {
-  const ability = useAbility()
-  return ability.can(action, subject)
-}
+export const useCanAbility = (action: AbilityAction, subject: AbilitySubject): boolean => {}
 
 
killedBy: useCanAbility returns true when the user can perform the action
statusReason: expected undefined to be true // Object.is equality
