[Killed] BlockStatement
src/app/analytics/trackingContext.tsx:8:50
 
 export const TrackingContext = createContext<TrackingClient | null>(null)
 
-export const useTracking = (): TrackingClient => {
-  const context = useContext(TrackingContext)
-  if (!context) {
-    throw new Error(ERROR_MESSAGE_TRACKING_CONTEXT_UNAVAILABLE)
-  }
-  return context
-}
+export const useTracking = (): TrackingClient => {}
 
 
killedBy: SessionManager emits a warning toast after the idle warning threshold
statusReason: Cannot read properties of undefined (reading 'track')

[Killed] BlockStatement
src/app/analytics/trackingContext.tsx:10:17
 
 export const useTracking = (): TrackingClient => {
   const context = useContext(TrackingContext)
-  if (!context) {
-    throw new Error(ERROR_MESSAGE_TRACKING_CONTEXT_UNAVAILABLE)
-  }
+  if (!context) {}
   return context
 }
killedBy: tracking context throws when accessed without a provider
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/app/analytics/trackingContext.tsx:10:7
 
 export const useTracking = (): TrackingClient => {
   const context = useContext(TrackingContext)
-  if (!context) {
+  if (context) {
     throw new Error(ERROR_MESSAGE_TRACKING_CONTEXT_UNAVAILABLE)
   }
killedBy: AppProviders renders the dashboard heading by default
statusReason: Tracking context is unavailable
