[Killed] BlockStatement
src/app/auth/AuthorizationProvider.tsx:10:81
 
 type AuthorizationProviderProps = PropsWithChildren
 
-export function AuthorizationProvider({ children }: AuthorizationProviderProps) {
-  const { currentUser } = useAuth()
-
-  const value = useMemo(() => derivePermissionsFromUser(currentUser), [currentUser])
-
-  return <AuthorizationContext.Provider value={value}>{children}</AuthorizationContext.Provider>
-}
+export function AuthorizationProvider({ children }: AuthorizationProviderProps) {}
 
 
killedBy: AppProviders renders the dashboard heading by default
statusReason: Unable to find an element with the text: Operational overview. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div />

[Killed] ArrowFunction
src/app/auth/AuthorizationProvider.tsx:13:25
 export function AuthorizationProvider({ children }: AuthorizationProviderProps) {
   const { currentUser } = useAuth()
 
-  const value = useMemo(() => derivePermissionsFromUser(currentUser), [currentUser])
+  const value = useMemo(() => undefined, [currentUser])
 
   return <AuthorizationContext.Provider value={value}>{children}</AuthorizationContext.Provider>
killedBy: AuthProvider logs in and exposes authenticated user details
statusReason: Authorization context is unavailable
