[Killed] BlockStatement
src/app/auth/authContext.tsx:8:48
 
 export const AuthContext = createContext<AuthContextValue | null>(null)
 
-export const useAuth = (): AuthContextValue => {
-  const context = useContext(AuthContext)
-  if (!context) {
-    throw new Error(ERROR_MESSAGE_AUTH_CONTEXT_UNAVAILABLE)
-  }
-  return context
-}
+export const useAuth = (): AuthContextValue => {}
 
 
killedBy: AppProviders renders the dashboard heading by default
statusReason: Cannot destructure property 'currentUser' of '(0 , __vite_ssr_import_2__.useAuth)(...)' as it is undefined.

[Killed] BooleanLiteral
src/app/auth/authContext.tsx:10:7
 
 export const useAuth = (): AuthContextValue => {
   const context = useContext(AuthContext)
-  if (!context) {
+  if (context) {
     throw new Error(ERROR_MESSAGE_AUTH_CONTEXT_UNAVAILABLE)
   }
killedBy: AppProviders renders the dashboard heading by default
statusReason: Auth context is unavailable

[Killed] BlockStatement
src/app/auth/authContext.tsx:10:17
 
 export const useAuth = (): AuthContextValue => {
   const context = useContext(AuthContext)
-  if (!context) {
-    throw new Error(ERROR_MESSAGE_AUTH_CONTEXT_UNAVAILABLE)
-  }
+  if (!context) {}
   return context
 }
killedBy: useAuth throws when used outside the provider
statusReason: expected [Function] to throw an error
