[Killed] BlockStatement
src/app/config/AppConfigProvider.tsx:12:80
   value?: AppConfig
 }>
 
-export function AppConfigProvider({ value, children }: AppConfigProviderProps) {
-  const contextValue = useMemo(() => value ?? APP_CONFIG, [value])
-
-  return <AppConfigContext.Provider value={contextValue}>{children}</AppConfigContext.Provider>
-}
+export function AppConfigProvider({ value, children }: AppConfigProviderProps) {}
 
 
killedBy: AuthProvider logs in and exposes authenticated user details
statusReason: Unable to find an element with the text: login. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/app/config/AppConfigProvider.tsx:13:38
 }>
 
 export function AppConfigProvider({ value, children }: AppConfigProviderProps) {
-  const contextValue = useMemo(() => value ?? APP_CONFIG, [value])
+  const contextValue = useMemo(() => value && APP_CONFIG, [value])
 
   return <AppConfigContext.Provider value={contextValue}>{children}</AppConfigContext.Provider>
killedBy: AppConfig hooks reads feature flags from the provider value
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/app/config/AppConfigProvider.tsx:13:32
 }>
 
 export function AppConfigProvider({ value, children }: AppConfigProviderProps) {
-  const contextValue = useMemo(() => value ?? APP_CONFIG, [value])
+  const contextValue = useMemo(() => undefined, [value])
 
   return <AppConfigContext.Provider value={contextValue}>{children}</AppConfigContext.Provider>
killedBy: AppConfig hooks reads feature flags from the provider value
statusReason: expected false to be true // Object.is equality
