[Killed] BlockStatement
src/app/config/appConfig.ts:13:64
 
 type EnvRecord = Record<string, string | undefined>
 
-const booleanFromEnv = (value: string | undefined): boolean => {
-  if (!value) {
-    return false
-  }
-  const normalized = value.trim().toLowerCase()
-  return normalized === 'true' || normalized === '1' || normalized === 'yes' || normalized === 'on'
-}
+const booleanFromEnv = (value: string | undefined): boolean => {}
 
 const normalizeOptionalUrl = (value: string | undefined): string | null => {
killedBy: createAppConfig parses required values and feature flags
statusReason: expected { enableDevTools: false, …(2) } to deeply equal { enableDevTools: true, …(2) }

[Killed] ConditionalExpression
src/app/config/appConfig.ts:14:7
 type EnvRecord = Record<string, string | undefined>
 
 const booleanFromEnv = (value: string | undefined): boolean => {
-  if (!value) {
+  if (true) {
     return false
   }
killedBy: createAppConfig parses required values and feature flags
statusReason: expected { enableDevTools: false, …(2) } to deeply equal { enableDevTools: true, …(2) }

[Survived] BlockStatement
src/app/config/appConfig.ts:14:15
 type EnvRecord = Record<string, string | undefined>
 
 const booleanFromEnv = (value: string | undefined): boolean => {
-  if (!value) {
-    return false
-  }
+  if (!value) {}
   const normalized = value.trim().toLowerCase()
   return normalized === 'true' || normalized === '1' || normalized === 'yes' || normalized === 'on'

[Killed] BooleanLiteral
src/app/config/appConfig.ts:15:12
 
 const booleanFromEnv = (value: string | undefined): boolean => {
   if (!value) {
-    return false
+    return true
   }
   const normalized = value.trim().toLowerCase()
killedBy: AppConfig hooks returns false for disabled feature flags by default
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/app/config/appConfig.ts:17:22
   if (!value) {
     return false
   }
-  const normalized = value.trim().toLowerCase()
+  const normalized = value.trim().toUpperCase()
   return normalized === 'true' || normalized === '1' || normalized === 'yes' || normalized === 'on'
 }
killedBy: createAppConfig parses required values and feature flags
statusReason: expected { enableDevTools: false, …(2) } to deeply equal { enableDevTools: true, …(2) }

[Survived] MethodExpression
src/app/config/appConfig.ts:17:22
   if (!value) {
     return false
   }
-  const normalized = value.trim().toLowerCase()
+  const normalized = value.toLowerCase()
   return normalized === 'true' || normalized === '1' || normalized === 'yes' || normalized === 'on'
 }

[Killed] LogicalOperator
src/app/config/appConfig.ts:18:10
     return false
   }
   const normalized = value.trim().toLowerCase()
-  return normalized === 'true' || normalized === '1' || normalized === 'yes' || normalized === 'on'
+  return normalized === 'true' && normalized === '1' || normalized === 'yes' || normalized === 'on'
 }
 
killedBy: createAppConfig parses required values and feature flags
statusReason: expected { enableDevTools: false, …(2) } to deeply equal { enableDevTools: true, …(2) }

[Killed] ConditionalExpression
src/app/config/appConfig.ts:18:10
     return false
   }
   const normalized = value.trim().toLowerCase()
-  return normalized === 'true' || normalized === '1' || normalized === 'yes' || normalized === 'on'
+  return false
 }
 
killedBy: createAppConfig parses required values and feature flags
statusReason: expected { enableDevTools: false, …(2) } to deeply equal { enableDevTools: true, …(2) }

[Killed] BlockStatement
src/app/config/appConfig.ts:21:76
   return normalized === 'true' || normalized === '1' || normalized === 'yes' || normalized === 'on'
 }
 
-const normalizeOptionalUrl = (value: string | undefined): string | null => {
-  if (!value || value.trim().length === 0) {
-    return null
-  }
-  return value
-}
+const normalizeOptionalUrl = (value: string | undefined): string | null => {}
 
 const envSchema = z.object({
killedBy: createAppConfig parses required values and feature flags
statusReason: expected undefined to be 'https://sentry.example.com/1' // Object.is equality

[Killed] EqualityOperator
src/app/config/appConfig.ts:22:17
 }
 
 const normalizeOptionalUrl = (value: string | undefined): string | null => {
-  if (!value || value.trim().length === 0) {
+  if (!value || value.trim().length !== 0) {
     return null
   }
killedBy: createAppConfig parses required values and feature flags
statusReason: expected null to be 'https://sentry.example.com/1' // Object.is equality

[Killed] ConditionalExpression
src/app/config/appConfig.ts:22:7
 }
 
 const normalizeOptionalUrl = (value: string | undefined): string | null => {
-  if (!value || value.trim().length === 0) {
+  if (false) {
     return null
   }
killedBy: createAppConfig returns null for optional sentry DSN
statusReason: expected '' to be null

[Killed] StringLiteral
src/app/config/appConfig.ts:34:19
     .string()
     .url()
     .optional()
-    .or(z.literal(''))
+    .or(z.literal("Stryker was here!"))
     .optional(),
 })
killedBy: createAppConfig returns null for optional sentry DSN
statusReason: Invalid application environment configuration: Invalid URL

[Killed] StringLiteral
src/app/config/appConfig.ts:38:22
     .optional(),
 })
 
-const ERROR_PREFIX = 'Invalid application environment configuration'
+const ERROR_PREFIX = ""
 
 export const FEATURE_FLAG_KEYS = ['enableDevTools', 'enableQueryCachePersistence', 'enableExperimentalFilters'] as const
killedBy: createAppConfig throws when required env variables are missing
statusReason: expected [Function] to throw error matching /Invalid application/ but got ': Invalid input: expected string, rec…'

[Killed] ObjectLiteral
src/app/config/appConfig.ts:52:45
   features: FeatureFlags
 }
 
-const DEFAULT_FEATURE_FLAGS: FeatureFlags = {
-  enableDevTools: false,
-  enableQueryCachePersistence: false,
-  enableExperimentalFilters: false,
-}
+const DEFAULT_FEATURE_FLAGS: FeatureFlags = {}
 
 export const createAppConfig = (env: EnvRecord = import.meta.env as EnvRecord): AppConfig => {
killedBy: createAppConfig parses required values and feature flags
statusReason: expected { enableDevTools: true, …(2) } to deeply equal { enableDevTools: true, …(2) }

[Killed] BooleanLiteral
src/app/config/appConfig.ts:53:19
 }
 
 const DEFAULT_FEATURE_FLAGS: FeatureFlags = {
-  enableDevTools: false,
+  enableDevTools: true,
   enableQueryCachePersistence: false,
   enableExperimentalFilters: false,
killedBy: AppConfig hooks returns false for disabled feature flags by default
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/app/config/appConfig.ts:54:32
 
 const DEFAULT_FEATURE_FLAGS: FeatureFlags = {
   enableDevTools: false,
-  enableQueryCachePersistence: false,
+  enableQueryCachePersistence: true,
   enableExperimentalFilters: false,
 }
killedBy: createAppConfig parses required values and feature flags
statusReason: expected { enableDevTools: true, …(2) } to deeply equal { enableDevTools: true, …(2) }

[Survived] BooleanLiteral
src/app/config/appConfig.ts:55:30
 const DEFAULT_FEATURE_FLAGS: FeatureFlags = {
   enableDevTools: false,
   enableQueryCachePersistence: false,
-  enableExperimentalFilters: false,
+  enableExperimentalFilters: true,
 }
 

[Killed] BlockStatement
src/app/config/appConfig.ts:58:94
   enableExperimentalFilters: false,
 }
 
-export const createAppConfig = (env: EnvRecord = import.meta.env as EnvRecord): AppConfig => {
-  const parsed = envSchema.safeParse(env)
-
-  if (!parsed.success) {
-    const issueMessages = parsed.error.issues.map((issue) => issue.message)
-    const message = issueMessages.length > 0 ? issueMessages.join(', ') : parsed.error.message
-    throw new Error(`${ERROR_PREFIX}: ${message}`)
-  }
-
-  const flags: FeatureFlags = {
-    enableDevTools: booleanFromEnv(env[ENV_VAR_FEATURE_DEV_TOOLS]) || DEFAULT_FEATURE_FLAGS.enableDevTools,
-    enableQueryCachePersistence:
-      booleanFromEnv(env[ENV_VAR_FEATURE_QUERY_CACHE_PERSISTENCE]) || DEFAULT_FEATURE_FLAGS.enableQueryCachePersistence,
-    enableExperimentalFilters:
-      booleanFromEnv(env[ENV_VAR_FEATURE_EXPERIMENTAL_FILTERS]) || DEFAULT_FEATURE_FLAGS.enableExperimentalFilters,
-  }
-
-  return {
-    apiBaseUrl: parsed.data[ENV_VAR_API_BASE_URL],
-    sentryDsn: normalizeOptionalUrl(parsed.data[ENV_VAR_SENTRY_DSN]),
-    features: flags,
-  }
-}
+export const createAppConfig = (env: EnvRecord = import.meta.env as EnvRecord): AppConfig => {}
 
 export const APP_CONFIG: AppConfig = createAppConfig()
killedBy: createAppConfig parses required values and feature flags
statusReason: Cannot read properties of undefined (reading 'apiBaseUrl')

[Killed] BlockStatement
src/app/config/appConfig.ts:61:24
 export const createAppConfig = (env: EnvRecord = import.meta.env as EnvRecord): AppConfig => {
   const parsed = envSchema.safeParse(env)
 
-  if (!parsed.success) {
-    const issueMessages = parsed.error.issues.map((issue) => issue.message)
-    const message = issueMessages.length > 0 ? issueMessages.join(', ') : parsed.error.message
-    throw new Error(`${ERROR_PREFIX}: ${message}`)
-  }
+  if (!parsed.success) {}
 
   const flags: FeatureFlags = {
killedBy: createAppConfig throws when required env variables are missing
statusReason: expected [Function] to throw error matching /Invalid application/ but got 'Cannot read properties of undefined (…'

[Survived] ArrowFunction
src/app/config/appConfig.ts:62:51
   const parsed = envSchema.safeParse(env)
 
   if (!parsed.success) {
-    const issueMessages = parsed.error.issues.map((issue) => issue.message)
+    const issueMessages = parsed.error.issues.map(() => undefined)
     const message = issueMessages.length > 0 ? issueMessages.join(', ') : parsed.error.message
     throw new Error(`${ERROR_PREFIX}: ${message}`)

[Survived] EqualityOperator
src/app/config/appConfig.ts:63:21
 
   if (!parsed.success) {
     const issueMessages = parsed.error.issues.map((issue) => issue.message)
-    const message = issueMessages.length > 0 ? issueMessages.join(', ') : parsed.error.message
+    const message = issueMessages.length <= 0 ? issueMessages.join(', ') : parsed.error.message
     throw new Error(`${ERROR_PREFIX}: ${message}`)
   }

[Survived] EqualityOperator
src/app/config/appConfig.ts:63:21
 
   if (!parsed.success) {
     const issueMessages = parsed.error.issues.map((issue) => issue.message)
-    const message = issueMessages.length > 0 ? issueMessages.join(', ') : parsed.error.message
+    const message = issueMessages.length >= 0 ? issueMessages.join(', ') : parsed.error.message
     throw new Error(`${ERROR_PREFIX}: ${message}`)
   }

[Killed] StringLiteral
src/app/config/appConfig.ts:64:21
   if (!parsed.success) {
     const issueMessages = parsed.error.issues.map((issue) => issue.message)
     const message = issueMessages.length > 0 ? issueMessages.join(', ') : parsed.error.message
-    throw new Error(`${ERROR_PREFIX}: ${message}`)
+    throw new Error(``)
   }
 
killedBy: createAppConfig throws when required env variables are missing
statusReason: expected [Function] to throw error matching /Invalid application/ but got ''

[Killed] ConditionalExpression
src/app/config/appConfig.ts:68:21
   }
 
   const flags: FeatureFlags = {
-    enableDevTools: booleanFromEnv(env[ENV_VAR_FEATURE_DEV_TOOLS]) || DEFAULT_FEATURE_FLAGS.enableDevTools,
+    enableDevTools: true,
     enableQueryCachePersistence:
       booleanFromEnv(env[ENV_VAR_FEATURE_QUERY_CACHE_PERSISTENCE]) || DEFAULT_FEATURE_FLAGS.enableQueryCachePersistence,
killedBy: AppConfig hooks returns false for disabled feature flags by default
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/app/config/appConfig.ts:68:21
   }
 
   const flags: FeatureFlags = {
-    enableDevTools: booleanFromEnv(env[ENV_VAR_FEATURE_DEV_TOOLS]) || DEFAULT_FEATURE_FLAGS.enableDevTools,
+    enableDevTools: false,
     enableQueryCachePersistence:
       booleanFromEnv(env[ENV_VAR_FEATURE_QUERY_CACHE_PERSISTENCE]) || DEFAULT_FEATURE_FLAGS.enableQueryCachePersistence,
killedBy: createAppConfig parses required values and feature flags
statusReason: expected { enableDevTools: false, …(2) } to deeply equal { enableDevTools: true, …(2) }

[Killed] ConditionalExpression
src/app/config/appConfig.ts:70:7
   const flags: FeatureFlags = {
     enableDevTools: booleanFromEnv(env[ENV_VAR_FEATURE_DEV_TOOLS]) || DEFAULT_FEATURE_FLAGS.enableDevTools,
     enableQueryCachePersistence:
-      booleanFromEnv(env[ENV_VAR_FEATURE_QUERY_CACHE_PERSISTENCE]) || DEFAULT_FEATURE_FLAGS.enableQueryCachePersistence,
+      true,
     enableExperimentalFilters:
       booleanFromEnv(env[ENV_VAR_FEATURE_EXPERIMENTAL_FILTERS]) || DEFAULT_FEATURE_FLAGS.enableExperimentalFilters,
killedBy: createAppConfig parses required values and feature flags
statusReason: expected { enableDevTools: true, …(2) } to deeply equal { enableDevTools: true, …(2) }

[Survived] ConditionalExpression
src/app/config/appConfig.ts:70:7
   const flags: FeatureFlags = {
     enableDevTools: booleanFromEnv(env[ENV_VAR_FEATURE_DEV_TOOLS]) || DEFAULT_FEATURE_FLAGS.enableDevTools,
     enableQueryCachePersistence:
-      booleanFromEnv(env[ENV_VAR_FEATURE_QUERY_CACHE_PERSISTENCE]) || DEFAULT_FEATURE_FLAGS.enableQueryCachePersistence,
+      false,
     enableExperimentalFilters:
       booleanFromEnv(env[ENV_VAR_FEATURE_EXPERIMENTAL_FILTERS]) || DEFAULT_FEATURE_FLAGS.enableExperimentalFilters,

[Killed] ConditionalExpression
src/app/config/appConfig.ts:72:7
     enableQueryCachePersistence:
       booleanFromEnv(env[ENV_VAR_FEATURE_QUERY_CACHE_PERSISTENCE]) || DEFAULT_FEATURE_FLAGS.enableQueryCachePersistence,
     enableExperimentalFilters:
-      booleanFromEnv(env[ENV_VAR_FEATURE_EXPERIMENTAL_FILTERS]) || DEFAULT_FEATURE_FLAGS.enableExperimentalFilters,
+      false,
   }
 
killedBy: createAppConfig parses required values and feature flags
statusReason: expected { enableDevTools: true, …(2) } to deeply equal { enableDevTools: true, …(2) }

[Killed] LogicalOperator
src/app/config/appConfig.ts:72:7
     enableQueryCachePersistence:
       booleanFromEnv(env[ENV_VAR_FEATURE_QUERY_CACHE_PERSISTENCE]) || DEFAULT_FEATURE_FLAGS.enableQueryCachePersistence,
     enableExperimentalFilters:
-      booleanFromEnv(env[ENV_VAR_FEATURE_EXPERIMENTAL_FILTERS]) || DEFAULT_FEATURE_FLAGS.enableExperimentalFilters,
+      booleanFromEnv(env[ENV_VAR_FEATURE_EXPERIMENTAL_FILTERS]) && DEFAULT_FEATURE_FLAGS.enableExperimentalFilters,
   }
 
killedBy: createAppConfig parses required values and feature flags
statusReason: expected { enableDevTools: true, …(2) } to deeply equal { enableDevTools: true, …(2) }
