[Killed] BlockStatement
src/app/config/useAppConfig.ts:7:46
 import { APP_CONFIG } from './appConfig'
 import { AppConfigContext } from './appConfigContext'
 
-export const useAppConfig = (): AppConfig => {
-  const context = useContext(AppConfigContext)
-  if (!context) {
-    return APP_CONFIG
-  }
-  return context
-}
+export const useAppConfig = (): AppConfig => {}
 
 export const useFeatureFlag = (flag: FeatureFlagKey): boolean => {
killedBy: AppProviders renders the dashboard heading by default
statusReason: Cannot read properties of undefined (reading 'sentryDsn')

[Killed] BlockStatement
src/app/config/useAppConfig.ts:9:17
 
 export const useAppConfig = (): AppConfig => {
   const context = useContext(AppConfigContext)
-  if (!context) {
-    return APP_CONFIG
-  }
+  if (!context) {}
   return context
 }
killedBy: AppConfig hooks falls back to the default config when no provider is present
statusReason: expected null to be { …(3) } // Object.is equality

[Killed] ConditionalExpression
src/app/config/useAppConfig.ts:9:7
 
 export const useAppConfig = (): AppConfig => {
   const context = useContext(AppConfigContext)
-  if (!context) {
+  if (true) {
     return APP_CONFIG
   }
killedBy: AppConfig hooks reads feature flags from the provider value
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/app/config/useAppConfig.ts:15:66
   return context
 }
 
-export const useFeatureFlag = (flag: FeatureFlagKey): boolean => {
-  const config = useAppConfig()
-  return config.features[flag]
-}
+export const useFeatureFlag = (flag: FeatureFlagKey): boolean => {}
 
 
killedBy: AppConfig hooks returns false for disabled feature flags by default
statusReason: expected undefined to be false // Object.is equality
