[Killed] ConditionalExpression
src/app/dev/DevToolbar.tsx:28:7
   const { t } = useTranslation()
   const enableDevTools = useFeatureFlag('enableDevTools')
 
-  if (!canUseDevTools(enableDevTools)) {
+  if (true) {
     return null
   }
killedBy: DevToolbar renders persona buttons and triggers actions when enabled
statusReason: Unable to find an element by: [data-testid="dev-toolbar"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/app/dev/DevToolbar.tsx:28:7
   const { t } = useTranslation()
   const enableDevTools = useFeatureFlag('enableDevTools')
 
-  if (!canUseDevTools(enableDevTools)) {
+  if (canUseDevTools(enableDevTools)) {
     return null
   }
killedBy: DevToolbar does not render when dev tools are disabled
statusReason: expected <div …(2)>…(1)</div> to be null

[Killed] ArrowFunction
src/app/dev/DevToolbar.tsx:46:33
       <div className="d-flex flex-column gap-2">
         <strong>{t(I18N_KEY_DEV_TOOLBAR_HEADING)}</strong>
         <ButtonGroup size="sm">
-          {DEV_PERSONA_KEYS.map((persona) => (
-            <Button
-              key={persona}
-              variant="outline-primary"
-              onClick={() => applyDevPersona(persona)}
-            >
-              {personaLabelMap[persona]}
-            </Button>
-          ))}
+          {DEV_PERSONA_KEYS.map(() => undefined)}
           <Button variant="outline-danger" onClick={clearDevPersona}>
             {t(I18N_KEY_DEV_TOOLBAR_RESET)}
killedBy: DevToolbar renders persona buttons and triggers actions when enabled
statusReason: Unable to find an element with the text: dev.persona.superuser. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="position-fixed bottom-0 end-0 m-3 p-3 bg-body border rounded shadow-sm small"
      data-testi

[Killed] ArrowFunction
src/app/dev/DevToolbar.tsx:50:24
             <Button
               key={persona}
               variant="outline-primary"
-              onClick={() => applyDevPersona(persona)}
+              onClick={() => undefined}
             >
               {personaLabelMap[persona]}
killedBy: DevToolbar renders persona buttons and triggers actions when enabled
statusReason: expected "vi.fn()" to be called 3 times, but got 0 times
