[Killed] BlockStatement
src/app/logging/logger.ts:13:55
   error(error: unknown, metadata?: LoggerMetadata): void
 }
 
-const formatMetadata = (metadata?: LoggerMetadata) => {
-  if (!metadata || Object.keys(metadata).length === 0) {
-    return undefined
-  }
-  return metadata
-}
+const formatMetadata = (metadata?: LoggerMetadata) => {}
 
 export const createNoopLogger = (): Logger => ({
killedBy: createAppLogger logs messages to the console transport
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received: 

  1st vi.fn() call:

  [
    "debug-message",

[Killed] ConditionalExpression
src/app/logging/logger.ts:14:7
 }
 
 const formatMetadata = (metadata?: LoggerMetadata) => {
-  if (!metadata || Object.keys(metadata).length === 0) {
+  if (true) {
     return undefined
   }
killedBy: createAppLogger logs messages to the console transport
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received: 

  1st vi.fn() call:

  [
    "debug-message",

[Killed] LogicalOperator
src/app/logging/logger.ts:14:7
 }
 
 const formatMetadata = (metadata?: LoggerMetadata) => {
-  if (!metadata || Object.keys(metadata).length === 0) {
+  if (!metadata && Object.keys(metadata).length === 0) {
     return undefined
   }
killedBy: createAppLogger logs messages to the console transport
statusReason: Cannot convert undefined or null to object

[Killed] ArrowFunction
src/app/logging/logger.ts:20:33
   return metadata
 }
 
-export const createNoopLogger = (): Logger => ({
-  debug: () => {},
-  info: () => {},
-  warn: () => {},
-  error: () => {},
-})
+export const createNoopLogger = () => undefined
 
 export const createConsoleLogger = (): Logger => ({
killedBy: createAppLogger provides a noop logger helper
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ArrowFunction
src/app/logging/logger.ts:27:36
   error: () => {},
 })
 
-export const createConsoleLogger = (): Logger => ({
-  debug: (message, metadata) => {
-    console.debug(message, formatMetadata(metadata))
-  },
-  info: (message, metadata) => {
-    console.info(message, formatMetadata(metadata))
-  },
-  warn: (message, metadata) => {
-    console.warn(message, formatMetadata(metadata))
-  },
-  error: (error, metadata) => {
-    console.error(error, formatMetadata(metadata))
-  },
-})
+export const createConsoleLogger = () => undefined
 
 export const createCompositeLogger = (loggers: Logger[]): Logger => ({
killedBy: AppProviders renders the dashboard heading by default
statusReason: Logger context is unavailable

[Killed] ObjectLiteral
src/app/logging/logger.ts:27:51
   error: () => {},
 })
 
-export const createConsoleLogger = (): Logger => ({
-  debug: (message, metadata) => {
-    console.debug(message, formatMetadata(metadata))
-  },
-  info: (message, metadata) => {
-    console.info(message, formatMetadata(metadata))
-  },
-  warn: (message, metadata) => {
-    console.warn(message, formatMetadata(metadata))
-  },
-  error: (error, metadata) => {
-    console.error(error, formatMetadata(metadata))
-  },
-})
+export const createConsoleLogger = (): Logger => ({})
 
 export const createCompositeLogger = (loggers: Logger[]): Logger => ({
killedBy: AppProviders renders the error fallback when a child throws
statusReason: logger.error is not a function

[Killed] BlockStatement
src/app/logging/logger.ts:28:33
 })
 
 export const createConsoleLogger = (): Logger => ({
-  debug: (message, metadata) => {
-    console.debug(message, formatMetadata(metadata))
-  },
+  debug: (message, metadata) => {},
   info: (message, metadata) => {
     console.info(message, formatMetadata(metadata))
killedBy: createAppLogger logs messages to the console transport
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Number of calls: 0

[Killed] BlockStatement
src/app/logging/logger.ts:31:32
   debug: (message, metadata) => {
     console.debug(message, formatMetadata(metadata))
   },
-  info: (message, metadata) => {
-    console.info(message, formatMetadata(metadata))
-  },
+  info: (message, metadata) => {},
   warn: (message, metadata) => {
     console.warn(message, formatMetadata(metadata))
killedBy: createAppLogger logs messages to the console transport
statusReason: expected "vi.fn()" to be called with arguments: [ 'info-message', undefined ]

Number of calls: 0

[Killed] BlockStatement
src/app/logging/logger.ts:34:32
   info: (message, metadata) => {
     console.info(message, formatMetadata(metadata))
   },
-  warn: (message, metadata) => {
-    console.warn(message, formatMetadata(metadata))
-  },
+  warn: (message, metadata) => {},
   error: (error, metadata) => {
     console.error(error, formatMetadata(metadata))
killedBy: createAppLogger logs messages to the console transport
statusReason: expected "vi.fn()" to be called with arguments: [ 'warn-message', undefined ]

Number of calls: 0

[Killed] BlockStatement
src/app/logging/logger.ts:37:31
   warn: (message, metadata) => {
     console.warn(message, formatMetadata(metadata))
   },
-  error: (error, metadata) => {
-    console.error(error, formatMetadata(metadata))
-  },
+  error: (error, metadata) => {},
 })
 
killedBy: createAppLogger logs messages to the console transport
statusReason: expected "vi.fn()" to be called at least once

[Killed] ArrowFunction
src/app/logging/logger.ts:42:38
   },
 })
 
-export const createCompositeLogger = (loggers: Logger[]): Logger => ({
-  debug: (message, metadata) => {
-    loggers.forEach((logger) => logger.debug(message, metadata))
-  },
-  info: (message, metadata) => {
-    loggers.forEach((logger) => logger.info(message, metadata))
-  },
-  warn: (message, metadata) => {
-    loggers.forEach((logger) => logger.warn(message, metadata))
-  },
-  error: (error, metadata) => {
-    loggers.forEach((logger) => logger.error(error, metadata))
-  },
-})
+export const createCompositeLogger = () => undefined
 
 export type LoggerOptions = {
killedBy: createAppLogger adds a sentry transport when a DSN is provided
statusReason: Cannot read properties of undefined (reading 'info')

[Killed] ObjectLiteral
src/app/logging/logger.ts:42:70
   },
 })
 
-export const createCompositeLogger = (loggers: Logger[]): Logger => ({
-  debug: (message, metadata) => {
-    loggers.forEach((logger) => logger.debug(message, metadata))
-  },
-  info: (message, metadata) => {
-    loggers.forEach((logger) => logger.info(message, metadata))
-  },
-  warn: (message, metadata) => {
-    loggers.forEach((logger) => logger.warn(message, metadata))
-  },
-  error: (error, metadata) => {
-    loggers.forEach((logger) => logger.error(error, metadata))
-  },
-})
+export const createCompositeLogger = (loggers: Logger[]): Logger => ({})
 
 export type LoggerOptions = {
killedBy: createAppLogger adds a sentry transport when a DSN is provided
statusReason: logger.info is not a function

[Killed] BlockStatement
src/app/logging/logger.ts:43:33
 })
 
 export const createCompositeLogger = (loggers: Logger[]): Logger => ({
-  debug: (message, metadata) => {
-    loggers.forEach((logger) => logger.debug(message, metadata))
-  },
+  debug: (message, metadata) => {},
   info: (message, metadata) => {
     loggers.forEach((logger) => logger.info(message, metadata))
killedBy: createAppLogger adds a sentry transport when a DSN is provided
statusReason: expected "vi.fn()" to be called with arguments: [ 'trace', undefined ]

Number of calls: 0

[Killed] ArrowFunction
src/app/logging/logger.ts:44:21
 
 export const createCompositeLogger = (loggers: Logger[]): Logger => ({
   debug: (message, metadata) => {
-    loggers.forEach((logger) => logger.debug(message, metadata))
+    loggers.forEach(() => undefined)
   },
   info: (message, metadata) => {
killedBy: createAppLogger adds a sentry transport when a DSN is provided
statusReason: expected "vi.fn()" to be called with arguments: [ 'trace', undefined ]

Number of calls: 0

[Killed] BlockStatement
src/app/logging/logger.ts:46:32
   debug: (message, metadata) => {
     loggers.forEach((logger) => logger.debug(message, metadata))
   },
-  info: (message, metadata) => {
-    loggers.forEach((logger) => logger.info(message, metadata))
-  },
+  info: (message, metadata) => {},
   warn: (message, metadata) => {
     loggers.forEach((logger) => logger.warn(message, metadata))
killedBy: createAppLogger adds a sentry transport when a DSN is provided
statusReason: expected "vi.fn()" to be called with arguments: [ 'tracked', undefined ]

Number of calls: 0

[Killed] ArrowFunction
src/app/logging/logger.ts:47:21
     loggers.forEach((logger) => logger.debug(message, metadata))
   },
   info: (message, metadata) => {
-    loggers.forEach((logger) => logger.info(message, metadata))
+    loggers.forEach(() => undefined)
   },
   warn: (message, metadata) => {
killedBy: createAppLogger adds a sentry transport when a DSN is provided
statusReason: expected "vi.fn()" to be called with arguments: [ 'tracked', undefined ]

Number of calls: 0

[Killed] BlockStatement
src/app/logging/logger.ts:49:32
   info: (message, metadata) => {
     loggers.forEach((logger) => logger.info(message, metadata))
   },
-  warn: (message, metadata) => {
-    loggers.forEach((logger) => logger.warn(message, metadata))
-  },
+  warn: (message, metadata) => {},
   error: (error, metadata) => {
     loggers.forEach((logger) => logger.error(error, metadata))
killedBy: createAppLogger adds a sentry transport when a DSN is provided
statusReason: expected "vi.fn()" to be called with arguments: [ 'heads-up', undefined ]

Number of calls: 0

[Killed] ArrowFunction
src/app/logging/logger.ts:50:21
     loggers.forEach((logger) => logger.info(message, metadata))
   },
   warn: (message, metadata) => {
-    loggers.forEach((logger) => logger.warn(message, metadata))
+    loggers.forEach(() => undefined)
   },
   error: (error, metadata) => {
killedBy: createAppLogger adds a sentry transport when a DSN is provided
statusReason: expected "vi.fn()" to be called with arguments: [ 'heads-up', undefined ]

Number of calls: 0

[Killed] BlockStatement
src/app/logging/logger.ts:52:31
   warn: (message, metadata) => {
     loggers.forEach((logger) => logger.warn(message, metadata))
   },
-  error: (error, metadata) => {
-    loggers.forEach((logger) => logger.error(error, metadata))
-  },
+  error: (error, metadata) => {},
 })
 
killedBy: createAppLogger adds a sentry transport when a DSN is provided
statusReason: expected "vi.fn()" to be called at least once

[Killed] ArrowFunction
src/app/logging/logger.ts:53:21
     loggers.forEach((logger) => logger.warn(message, metadata))
   },
   error: (error, metadata) => {
-    loggers.forEach((logger) => logger.error(error, metadata))
+    loggers.forEach(() => undefined)
   },
 })
killedBy: createAppLogger adds a sentry transport when a DSN is provided
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/app/logging/logger.ts:61:88
   enableSentry?: boolean
 }
 
-export const createAppLogger = (config: AppConfig, options?: LoggerOptions): Logger => {
-  const transports: Logger[] = [createConsoleLogger()]
-  const shouldEnableSentry = options?.enableSentry ?? import.meta.env.MODE !== 'test'
-
-  if (config.sentryDsn && shouldEnableSentry) {
-    transports.push(createSentryLogger(config.sentryDsn))
-  }
-
-  if (transports.length === 1) {
-    return transports[0]
-  }
-
-  return createCompositeLogger(transports)
-}
+export const createAppLogger = (config: AppConfig, options?: LoggerOptions): Logger => {}
 
 
killedBy: AppProviders renders the dashboard heading by default
statusReason: Logger context is unavailable

[Killed] ArrayDeclaration
src/app/logging/logger.ts:62:32
 }
 
 export const createAppLogger = (config: AppConfig, options?: LoggerOptions): Logger => {
-  const transports: Logger[] = [createConsoleLogger()]
+  const transports: Logger[] = []
   const shouldEnableSentry = options?.enableSentry ?? import.meta.env.MODE !== 'test'
 
killedBy: createAppLogger logs messages to the console transport
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Number of calls: 0

[Killed] LogicalOperator
src/app/logging/logger.ts:63:30
 
 export const createAppLogger = (config: AppConfig, options?: LoggerOptions): Logger => {
   const transports: Logger[] = [createConsoleLogger()]
-  const shouldEnableSentry = options?.enableSentry ?? import.meta.env.MODE !== 'test'
+  const shouldEnableSentry = options?.enableSentry && import.meta.env.MODE !== 'test'
 
   if (config.sentryDsn && shouldEnableSentry) {
killedBy: createAppLogger adds a sentry transport when a DSN is provided
statusReason: expected "vi.fn()" to be called at least once

[Killed] OptionalChaining
src/app/logging/logger.ts:63:30
 
 export const createAppLogger = (config: AppConfig, options?: LoggerOptions): Logger => {
   const transports: Logger[] = [createConsoleLogger()]
-  const shouldEnableSentry = options?.enableSentry ?? import.meta.env.MODE !== 'test'
+  const shouldEnableSentry = options.enableSentry ?? import.meta.env.MODE !== 'test'
 
   if (config.sentryDsn && shouldEnableSentry) {
killedBy: AppProviders renders the dashboard heading by default
statusReason: Cannot read properties of undefined (reading 'enableSentry')

[Killed] ConditionalExpression
src/app/logging/logger.ts:65:7
   const transports: Logger[] = [createConsoleLogger()]
   const shouldEnableSentry = options?.enableSentry ?? import.meta.env.MODE !== 'test'
 
-  if (config.sentryDsn && shouldEnableSentry) {
+  if (false) {
     transports.push(createSentryLogger(config.sentryDsn))
   }
killedBy: createAppLogger adds a sentry transport when a DSN is provided
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/app/logging/logger.ts:65:47
   const transports: Logger[] = [createConsoleLogger()]
   const shouldEnableSentry = options?.enableSentry ?? import.meta.env.MODE !== 'test'
 
-  if (config.sentryDsn && shouldEnableSentry) {
-    transports.push(createSentryLogger(config.sentryDsn))
-  }
+  if (config.sentryDsn && shouldEnableSentry) {}
 
   if (transports.length === 1) {
killedBy: createAppLogger adds a sentry transport when a DSN is provided
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/app/logging/logger.ts:69:7
     transports.push(createSentryLogger(config.sentryDsn))
   }
 
-  if (transports.length === 1) {
+  if (true) {
     return transports[0]
   }
killedBy: createAppLogger adds a sentry transport when a DSN is provided
statusReason: expected "vi.fn()" to be called with arguments: [ 'trace', undefined ]

Number of calls: 0

[Killed] EqualityOperator
src/app/logging/logger.ts:69:7
     transports.push(createSentryLogger(config.sentryDsn))
   }
 
-  if (transports.length === 1) {
+  if (transports.length !== 1) {
     return transports[0]
   }
killedBy: createAppLogger adds a sentry transport when a DSN is provided
statusReason: expected "vi.fn()" to be called with arguments: [ 'trace', undefined ]

Number of calls: 0
