[Killed] BlockStatement
src/app/logging/loggerContext.tsx:8:40
 
 export const LoggerContext = createContext<Logger | null>(null)
 
-export const useLogger = (): Logger => {
-  const context = useContext(LoggerContext)
-  if (!context) {
-    throw new Error(ERROR_MESSAGE_LOGGER_CONTEXT_UNAVAILABLE)
-  }
-  return context
-}
+export const useLogger = (): Logger => {}
 
 
killedBy: AppProviders renders the error fallback when a child throws
statusReason: Cannot read properties of undefined (reading 'error')

[Killed] ConditionalExpression
src/app/logging/loggerContext.tsx:10:7
 
 export const useLogger = (): Logger => {
   const context = useContext(LoggerContext)
-  if (!context) {
+  if (true) {
     throw new Error(ERROR_MESSAGE_LOGGER_CONTEXT_UNAVAILABLE)
   }
killedBy: AppProviders renders the dashboard heading by default
statusReason: Logger context is unavailable

[Killed] BlockStatement
src/app/logging/loggerContext.tsx:10:17
 
 export const useLogger = (): Logger => {
   const context = useContext(LoggerContext)
-  if (!context) {
-    throw new Error(ERROR_MESSAGE_LOGGER_CONTEXT_UNAVAILABLE)
-  }
+  if (!context) {}
   return context
 }
killedBy: logger context throws when used outside of the provider
statusReason: expected [Function] to throw an error
