[Killed] BlockStatement
src/app/query/QueryErrorObserver.tsx:13:78
   queryEvents: QueryEventBus
 }
 
-export function QueryErrorObserver({ queryEvents }: QueryErrorObserverProps) {
-  const notificationBus = useNotificationBus()
-
-  useEffect(() => {
-    return subscribeToQueryErrors(queryEvents, ({ error }) => {
-      notificationBus.emit(NOTIFICATION_EVENT_TOAST, handleQueryError(error))
-    })
-  }, [notificationBus, queryEvents])
-
-  return null
-}
+export function QueryErrorObserver({ queryEvents }: QueryErrorObserverProps) {}
 
 
killedBy: QueryErrorObserver converts query error events into toast notifications
statusReason: expected "vi.fn()" to be called with arguments: [ 'notification:toast', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/app/query/QueryErrorObserver.tsx:16:19
 export function QueryErrorObserver({ queryEvents }: QueryErrorObserverProps) {
   const notificationBus = useNotificationBus()
 
-  useEffect(() => {
-    return subscribeToQueryErrors(queryEvents, ({ error }) => {
-      notificationBus.emit(NOTIFICATION_EVENT_TOAST, handleQueryError(error))
-    })
-  }, [notificationBus, queryEvents])
+  useEffect(() => {}, [notificationBus, queryEvents])
 
   return null
killedBy: QueryErrorObserver converts query error events into toast notifications
statusReason: expected "vi.fn()" to be called with arguments: [ 'notification:toast', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/app/query/QueryErrorObserver.tsx:17:63
   const notificationBus = useNotificationBus()
 
   useEffect(() => {
-    return subscribeToQueryErrors(queryEvents, ({ error }) => {
-      notificationBus.emit(NOTIFICATION_EVENT_TOAST, handleQueryError(error))
-    })
+    return subscribeToQueryErrors(queryEvents, ({ error }) => {})
   }, [notificationBus, queryEvents])
 
killedBy: QueryErrorObserver converts query error events into toast notifications
statusReason: expected "vi.fn()" to be called with arguments: [ 'notification:toast', …(1) ]

Number of calls: 0

[Survived] ArrayDeclaration
src/app/query/QueryErrorObserver.tsx:20:6
     return subscribeToQueryErrors(queryEvents, ({ error }) => {
       notificationBus.emit(NOTIFICATION_EVENT_TOAST, handleQueryError(error))
     })
-  }, [notificationBus, queryEvents])
+  }, [])
 
   return null
