[Killed] BlockStatement
src/app/query/errorNotifier.ts:7:91
 
 let currentNotifier: QueryErrorNotifier | null = null
 
-export const registerQueryErrorNotifier = (notifier: QueryErrorNotifier): (() => void) => {
-  currentNotifier = notifier
-  return () => {
-    if (currentNotifier === notifier) {
-      currentNotifier = null
-    }
-  }
-}
+export const registerQueryErrorNotifier = (notifier: QueryErrorNotifier): (() => void) => {}
 
 export const notifyQueryError = (payload: ToastNotificationPayload): void => {
killedBy: query error notifier invokes the registered notifier when errors occur
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Number of calls: 0

[Killed] BlockStatement
src/app/query/errorNotifier.ts:9:16
 
 export const registerQueryErrorNotifier = (notifier: QueryErrorNotifier): (() => void) => {
   currentNotifier = notifier
-  return () => {
-    if (currentNotifier === notifier) {
-      currentNotifier = null
-    }
-  }
+  return () => {}
 }
 
killedBy: query error notifier stops notifying once unsubscribed
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] EqualityOperator
src/app/query/errorNotifier.ts:10:9
 export const registerQueryErrorNotifier = (notifier: QueryErrorNotifier): (() => void) => {
   currentNotifier = notifier
   return () => {
-    if (currentNotifier === notifier) {
+    if (currentNotifier !== notifier) {
       currentNotifier = null
     }
killedBy: query error notifier stops notifying once unsubscribed
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] ConditionalExpression
src/app/query/errorNotifier.ts:10:9
 export const registerQueryErrorNotifier = (notifier: QueryErrorNotifier): (() => void) => {
   currentNotifier = notifier
   return () => {
-    if (currentNotifier === notifier) {
+    if (true) {
       currentNotifier = null
     }
killedBy: query error notifier ignores stale cleanup handlers once a new notifier is registered
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/app/query/errorNotifier.ts:16:78
   }
 }
 
-export const notifyQueryError = (payload: ToastNotificationPayload): void => {
-  currentNotifier?.(payload)
-}
+export const notifyQueryError = (payload: ToastNotificationPayload): void => {}
 
 
killedBy: query error notifier invokes the registered notifier when errors occur
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Number of calls: 0

[Killed] OptionalChaining
src/app/query/errorNotifier.ts:17:3
 }
 
 export const notifyQueryError = (payload: ToastNotificationPayload): void => {
-  currentNotifier?.(payload)
+  currentNotifier(payload)
 }
 
killedBy: query error notifier stops notifying once unsubscribed
statusReason: currentNotifier is not a function
