[Killed] ArrowFunction
src/app/query/events.ts:17:36
 
 export type QueryErrorHandler = (event: QueryErrorEvent) => void
 
-export const createQueryEventBus = (): QueryEventBus => mitt<QueryEventMap>()
+export const createQueryEventBus = () => undefined
 
 export const publishQueryError = (bus: QueryEventBus, error: unknown): void => {
killedBy: AppProviders renders the dashboard heading by default
statusReason: Cannot read properties of undefined (reading 'on')

[Killed] BlockStatement
src/app/query/events.ts:19:80
 
 export const createQueryEventBus = (): QueryEventBus => mitt<QueryEventMap>()
 
-export const publishQueryError = (bus: QueryEventBus, error: unknown): void => {
-  bus.emit(QUERY_EVENT_ERROR, { error })
-}
+export const publishQueryError = (bus: QueryEventBus, error: unknown): void => {}
 
 export const subscribeToQueryErrors = (bus: QueryEventBus, handler: QueryErrorHandler): (() => void) => {
killedBy: QueryErrorObserver converts query error events into toast notifications
statusReason: expected "vi.fn()" to be called with arguments: [ 'notification:toast', …(1) ]

Number of calls: 0

[Killed] ObjectLiteral
src/app/query/events.ts:20:31
 export const createQueryEventBus = (): QueryEventBus => mitt<QueryEventMap>()
 
 export const publishQueryError = (bus: QueryEventBus, error: unknown): void => {
-  bus.emit(QUERY_EVENT_ERROR, { error })
+  bus.emit(QUERY_EVENT_ERROR, {})
 }
 
killedBy: QueryErrorObserver converts query error events into toast notifications
statusReason: expected "vi.fn()" to be called with arguments: [ 'notification:toast', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "notification:toast",

[Killed] BlockStatement
src/app/query/events.ts:23:105
   bus.emit(QUERY_EVENT_ERROR, { error })
 }
 
-export const subscribeToQueryErrors = (bus: QueryEventBus, handler: QueryErrorHandler): (() => void) => {
-  bus.on(QUERY_EVENT_ERROR, handler)
-  return () => {
-    bus.off(QUERY_EVENT_ERROR, handler)
-  }
-}
+export const subscribeToQueryErrors = (bus: QueryEventBus, handler: QueryErrorHandler): (() => void) => {}
 
 
killedBy: QueryErrorObserver converts query error events into toast notifications
statusReason: expected "vi.fn()" to be called with arguments: [ 'notification:toast', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/app/query/events.ts:25:16
 
 export const subscribeToQueryErrors = (bus: QueryEventBus, handler: QueryErrorHandler): (() => void) => {
   bus.on(QUERY_EVENT_ERROR, handler)
-  return () => {
-    bus.off(QUERY_EVENT_ERROR, handler)
-  }
+  return () => {}
 }
 
killedBy: query events bus stops invoking handlers after unsubscribe
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {
