[Survived] StringLiteral
src/app/query/persistence.ts:5:33
 import { persistQueryClient } from '@tanstack/react-query-persist-client'
 import { createSyncStoragePersister } from '@tanstack/query-sync-storage-persister'
 
-const QUERY_CACHE_STORAGE_KEY = 'simple-license-admin-query-cache'
+const QUERY_CACHE_STORAGE_KEY = ""
 const QUERY_CACHE_MAX_AGE_MS = 1000 * 60 * 5
 const QUERY_CACHE_BUSTER = 'v1'

[Survived] ArithmeticOperator
src/app/query/persistence.ts:6:32
 import { createSyncStoragePersister } from '@tanstack/query-sync-storage-persister'
 
 const QUERY_CACHE_STORAGE_KEY = 'simple-license-admin-query-cache'
-const QUERY_CACHE_MAX_AGE_MS = 1000 * 60 * 5
+const QUERY_CACHE_MAX_AGE_MS = 1000 * 60 / 5
 const QUERY_CACHE_BUSTER = 'v1'
 

[Survived] ArithmeticOperator
src/app/query/persistence.ts:6:32
 import { createSyncStoragePersister } from '@tanstack/query-sync-storage-persister'
 
 const QUERY_CACHE_STORAGE_KEY = 'simple-license-admin-query-cache'
-const QUERY_CACHE_MAX_AGE_MS = 1000 * 60 * 5
+const QUERY_CACHE_MAX_AGE_MS = 1000 / 60 * 5
 const QUERY_CACHE_BUSTER = 'v1'
 

[Killed] BlockStatement
src/app/query/persistence.ts:9:49
 const QUERY_CACHE_MAX_AGE_MS = 1000 * 60 * 5
 const QUERY_CACHE_BUSTER = 'v1'
 
-const getDefaultStorage = (): Storage | null => {
-  if (typeof window === 'undefined' || !window.localStorage) {
-    return null
-  }
-  return window.localStorage
-}
+const getDefaultStorage = (): Storage | null => {}
 
 export const enableQueryCachePersistence = (
killedBy: enableQueryCachePersistence falls back to the default storage implementation
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/app/query/persistence.ts:10:7
 const QUERY_CACHE_BUSTER = 'v1'
 
 const getDefaultStorage = (): Storage | null => {
-  if (typeof window === 'undefined' || !window.localStorage) {
+  if (true) {
     return null
   }
killedBy: enableQueryCachePersistence falls back to the default storage implementation
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/app/query/persistence.ts:10:40
 const QUERY_CACHE_BUSTER = 'v1'
 
 const getDefaultStorage = (): Storage | null => {
-  if (typeof window === 'undefined' || !window.localStorage) {
+  if (typeof window === 'undefined' || window.localStorage) {
     return null
   }
killedBy: enableQueryCachePersistence falls back to the default storage implementation
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/app/query/persistence.ts:19:27
 export const enableQueryCachePersistence = (
   queryClient: QueryClient,
   storage: Storage | null = getDefaultStorage(),
-): (() => void) | null => {
-  if (!storage) {
-    return null
-  }
-
-  const persister = createSyncStoragePersister({
-    storage,
-    key: QUERY_CACHE_STORAGE_KEY,
-    throttleTime: 1_000,
-  })
-
-  const [unsubscribe, restorePromise] = persistQueryClient({
-    queryClient,
-    persister,
-    maxAge: QUERY_CACHE_MAX_AGE_MS,
-    buster: QUERY_CACHE_BUSTER,
-  })
-
-  void restorePromise
-
-  return () => {
-    unsubscribe()
-  }
-}
+): (() => void) | null => {}
 
 
killedBy: enableQueryCachePersistence returns null when a storage implementation is not provided
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/app/query/persistence.ts:20:7
   queryClient: QueryClient,
   storage: Storage | null = getDefaultStorage(),
 ): (() => void) | null => {
-  if (!storage) {
+  if (false) {
     return null
   }
killedBy: enableQueryCachePersistence returns null when a storage implementation is not provided
statusReason: expected [Function] to be null

[Killed] BlockStatement
src/app/query/persistence.ts:20:17
   queryClient: QueryClient,
   storage: Storage | null = getDefaultStorage(),
 ): (() => void) | null => {
-  if (!storage) {
-    return null
-  }
+  if (!storage) {}
 
   const persister = createSyncStoragePersister({
killedBy: enableQueryCachePersistence returns null when a storage implementation is not provided
statusReason: expected [Function] to be null

[Survived] ObjectLiteral
src/app/query/persistence.ts:30:60
     throttleTime: 1_000,
   })
 
-  const [unsubscribe, restorePromise] = persistQueryClient({
-    queryClient,
-    persister,
-    maxAge: QUERY_CACHE_MAX_AGE_MS,
-    buster: QUERY_CACHE_BUSTER,
-  })
+  const [unsubscribe, restorePromise] = persistQueryClient({})
 
   void restorePromise

[Killed] BlockStatement
src/app/query/persistence.ts:39:16
 
   void restorePromise
 
-  return () => {
-    unsubscribe()
-  }
+  return () => {}
 }
 
killedBy: enableQueryCachePersistence configures the persister when storage is available
statusReason: expected "vi.fn()" to be called at least once
