[Killed] ArrowFunction
src/app/queryClient.ts:9:23
 import type { Logger } from './logging/logger'
 import { publishQueryError, type QueryEventBus } from './query/events'
 
-const retryStrategy = (failureCount: number, error: unknown): boolean => shouldRetryRequest(failureCount, error)
+const retryStrategy = () => undefined
 
 const createErrorHandler =
killedBy: createAppQueryClient delegates retry decisions to the shared strategy
statusReason: expected 1st "vi.fn()" call to have been called with [ 1, Error: transient ], but called only 0 times

[Killed] ArrowFunction
src/app/queryClient.ts:12:3
 const retryStrategy = (failureCount: number, error: unknown): boolean => shouldRetryRequest(failureCount, error)
 
 const createErrorHandler =
-  (logger?: Logger, queryEvents?: QueryEventBus) =>
-  (error: unknown): void => {
-    if (queryEvents) {
-      publishQueryError(queryEvents, error)
-    }
-    notifyQueryError(handleQueryError(error))
-    logger?.error(error, { source: 'react-query' })
-  }
+  () => undefined
 
 const buildDefaultOptions = (): DefaultOptions => ({
killedBy: createAppQueryClient publishes query and mutation error events through the shared handler
statusReason: handleError is not a function

[Killed] BlockStatement
src/app/queryClient.ts:13:29
 
 const createErrorHandler =
   (logger?: Logger, queryEvents?: QueryEventBus) =>
-  (error: unknown): void => {
-    if (queryEvents) {
-      publishQueryError(queryEvents, error)
-    }
-    notifyQueryError(handleQueryError(error))
-    logger?.error(error, { source: 'react-query' })
-  }
+  (error: unknown): void => {}
 
 const buildDefaultOptions = (): DefaultOptions => ({
killedBy: createAppQueryClient publishes query and mutation error events through the shared handler
statusReason: expected 1st "vi.fn()" call to have been called with [ 'query:error', …(1) ], but called only 0 times

[Killed] ConditionalExpression
src/app/queryClient.ts:14:9
 const createErrorHandler =
   (logger?: Logger, queryEvents?: QueryEventBus) =>
   (error: unknown): void => {
-    if (queryEvents) {
+    if (true) {
       publishQueryError(queryEvents, error)
     }
killedBy: createAppQueryClient logs errors even when no query event bus is provided
statusReason: Cannot read properties of undefined (reading 'emit')

[Killed] BlockStatement
src/app/queryClient.ts:14:22
 const createErrorHandler =
   (logger?: Logger, queryEvents?: QueryEventBus) =>
   (error: unknown): void => {
-    if (queryEvents) {
-      publishQueryError(queryEvents, error)
-    }
+    if (queryEvents) {}
     notifyQueryError(handleQueryError(error))
     logger?.error(error, { source: 'react-query' })
killedBy: createAppQueryClient publishes query and mutation error events through the shared handler
statusReason: expected 1st "vi.fn()" call to have been called with [ 'query:error', …(1) ], but called only 0 times

[Survived] OptionalChaining
src/app/queryClient.ts:18:5
       publishQueryError(queryEvents, error)
     }
     notifyQueryError(handleQueryError(error))
-    logger?.error(error, { source: 'react-query' })
+    logger.error(error, { source: 'react-query' })
   }
 

[Killed] ArrowFunction
src/app/queryClient.ts:21:29
     logger?.error(error, { source: 'react-query' })
   }
 
-const buildDefaultOptions = (): DefaultOptions => ({
-  queries: {
-    staleTime: QUERY_CLIENT_STALE_TIME_MS,
-    gcTime: QUERY_CLIENT_GC_TIME_MS,
-    refetchOnWindowFocus: false,
-    retry: retryStrategy,
-  },
-  mutations: {
-    retry: retryStrategy,
-  },
-})
+const buildDefaultOptions = () => undefined
 
 export const createAppQueryClient = (logger?: Logger, queryEvents?: QueryEventBus): QueryClient => {
killedBy: createAppQueryClient delegates retry decisions to the shared strategy
statusReason: expected 1st "vi.fn()" call to have been called with [ 1, Error: transient ], but called only 0 times

[Survived] BooleanLiteral
src/app/queryClient.ts:25:27
   queries: {
     staleTime: QUERY_CLIENT_STALE_TIME_MS,
     gcTime: QUERY_CLIENT_GC_TIME_MS,
-    refetchOnWindowFocus: false,
+    refetchOnWindowFocus: true,
     retry: retryStrategy,
   },

[Killed] BlockStatement
src/app/queryClient.ts:33:100
   },
 })
 
-export const createAppQueryClient = (logger?: Logger, queryEvents?: QueryEventBus): QueryClient => {
-  const handleError = createErrorHandler(logger, queryEvents)
-
-  const queryCache = new QueryCache({
-    onError: (error) => {
-      handleError(error)
-    },
-  })
-
-  const mutationCache = new MutationCache({
-    onError: (error) => {
-      handleError(error)
-    },
-  })
-
-  return new QueryClient({
-    queryCache,
-    mutationCache,
-    defaultOptions: buildDefaultOptions(),
-  })
-}
+export const createAppQueryClient = (logger?: Logger, queryEvents?: QueryEventBus): QueryClient => {}
 
 
killedBy: createAppQueryClient publishes query and mutation error events through the shared handler
statusReason: Cannot read properties of undefined (reading 'getQueryCache')

[Killed] ObjectLiteral
src/app/queryClient.ts:36:37
 export const createAppQueryClient = (logger?: Logger, queryEvents?: QueryEventBus): QueryClient => {
   const handleError = createErrorHandler(logger, queryEvents)
 
-  const queryCache = new QueryCache({
-    onError: (error) => {
-      handleError(error)
-    },
-  })
+  const queryCache = new QueryCache({})
 
   const mutationCache = new MutationCache({
killedBy: createAppQueryClient publishes query and mutation error events through the shared handler
statusReason: expected 2nd "vi.fn()" call to have been called with [ 'query:error', …(1) ], but called only 1 times

[Killed] BlockStatement
src/app/queryClient.ts:37:25
   const handleError = createErrorHandler(logger, queryEvents)
 
   const queryCache = new QueryCache({
-    onError: (error) => {
-      handleError(error)
-    },
+    onError: (error) => {},
   })
 
killedBy: createAppQueryClient publishes query and mutation error events through the shared handler
statusReason: expected 2nd "vi.fn()" call to have been called with [ 'query:error', …(1) ], but called only 1 times

[Killed] BlockStatement
src/app/queryClient.ts:43:25
   })
 
   const mutationCache = new MutationCache({
-    onError: (error) => {
-      handleError(error)
-    },
+    onError: (error) => {},
   })
 
killedBy: createAppQueryClient publishes query and mutation error events through the shared handler
statusReason: expected 2nd "vi.fn()" call to have been called with [ 'query:error', …(1) ], but called only 1 times

[Killed] ObjectLiteral
src/app/queryClient.ts:48:26
     },
   })
 
-  return new QueryClient({
-    queryCache,
-    mutationCache,
-    defaultOptions: buildDefaultOptions(),
-  })
+  return new QueryClient({})
 }
 
killedBy: createAppQueryClient publishes query and mutation error events through the shared handler
statusReason: expected 1st "vi.fn()" call to have been called with [ 'query:error', …(1) ], but called only 0 times
