[Killed] ArrowFunction
src/app/state/appState.tsx:13:22
 import type { AppState, AppStateAction } from './types'
 import { applyThemeClass, persistTheme, readStoredTheme } from './themeStorage'
 
-const initialState = (): AppState => ({
-  activeTenantId: null,
-  theme: readStoredTheme(),
-  isSidebarCollapsed: false,
-})
+const initialState = () => undefined
 
 const appStateReducer = (state: AppState, action: AppStateAction): AppState => {
killedBy: AppProviders renders the dashboard heading by default
statusReason: Cannot read properties of undefined (reading 'theme')

[Killed] BooleanLiteral
src/app/state/appState.tsx:16:23
 const initialState = (): AppState => ({
   activeTenantId: null,
   theme: readStoredTheme(),
-  isSidebarCollapsed: false,
+  isSidebarCollapsed: true,
 })
 
killedBy: AppStateProvider updates sidebar collapsed state through context dispatch
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  expanded
Received:
  collapsed

[Killed] BlockStatement
src/app/state/appState.tsx:19:80
   isSidebarCollapsed: false,
 })
 
-const appStateReducer = (state: AppState, action: AppStateAction): AppState => {
-  switch (action.type) {
-    case APP_STATE_ACTION_SET_TENANT:
-      return { ...state, activeTenantId: action.payload }
-    case APP_STATE_ACTION_SET_THEME:
-      return { ...state, theme: action.payload }
-    case APP_STATE_ACTION_SET_SIDEBAR:
-      return { ...state, isSidebarCollapsed: action.payload }
-    default:
-      return state
-  }
-}
+const appStateReducer = (state: AppState, action: AppStateAction): AppState => {}
 
 export function AppStateProvider({ children }: PropsWithChildren) {
killedBy: AppStateProvider provides default state values and updates tenant selection
statusReason: Cannot read properties of undefined (reading 'theme')

[Killed] ConditionalExpression
src/app/state/appState.tsx:21:5
 
 const appStateReducer = (state: AppState, action: AppStateAction): AppState => {
   switch (action.type) {
-    case APP_STATE_ACTION_SET_TENANT:
-      return { ...state, activeTenantId: action.payload }
+    case APP_STATE_ACTION_SET_TENANT:
     case APP_STATE_ACTION_SET_THEME:
       return { ...state, theme: action.payload }
killedBy: AppStateProvider provides default state values and updates tenant selection
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  tenant-123
Received:
  none

[Killed] ConditionalExpression
src/app/state/appState.tsx:23:5
   switch (action.type) {
     case APP_STATE_ACTION_SET_TENANT:
       return { ...state, activeTenantId: action.payload }
-    case APP_STATE_ACTION_SET_THEME:
-      return { ...state, theme: action.payload }
+    case APP_STATE_ACTION_SET_THEME:
     case APP_STATE_ACTION_SET_SIDEBAR:
       return { ...state, isSidebarCollapsed: action.payload }
killedBy: AppStateProvider persists theme changes and updates the DOM attribute
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  dark
Received:
  light

[Killed] ConditionalExpression
src/app/state/appState.tsx:25:5
       return { ...state, activeTenantId: action.payload }
     case APP_STATE_ACTION_SET_THEME:
       return { ...state, theme: action.payload }
-    case APP_STATE_ACTION_SET_SIDEBAR:
-      return { ...state, isSidebarCollapsed: action.payload }
+    case APP_STATE_ACTION_SET_SIDEBAR:
     default:
       return state
killedBy: AppStateProvider updates sidebar collapsed state through context dispatch
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  collapsed
Received:
  expanded

[Killed] ConditionalExpression
src/app/state/appState.tsx:27:5
       return { ...state, theme: action.payload }
     case APP_STATE_ACTION_SET_SIDEBAR:
       return { ...state, isSidebarCollapsed: action.payload }
-    default:
-      return state
+    default:
   }
 }
killedBy: AppStateProvider safely ignores unknown reducer actions
statusReason: Cannot read properties of undefined (reading 'theme')

[Killed] BlockStatement
src/app/state/appState.tsx:32:67
   }
 }
 
-export function AppStateProvider({ children }: PropsWithChildren) {
-  const [state, dispatch] = useReducer(appStateReducer, undefined, initialState)
-
-  useEffect(() => {
-    applyThemeClass(state.theme)
-    persistTheme(state.theme)
-  }, [state.theme])
-
-  const stateValue = useMemo(() => state, [state])
-  const dispatchValue = useMemo(() => dispatch, [dispatch])
-
-  return (
-    <AppStateContext.Provider value={stateValue}>
-      <AppDispatchContext.Provider value={dispatchValue}>{children}</AppDispatchContext.Provider>
-    </AppStateContext.Provider>
-  )
-}
+export function AppStateProvider({ children }: PropsWithChildren) {}
 
 
killedBy: AppStateProvider provides default state values and updates tenant selection
statusReason: Unable to find an element by: [data-testid="tenant-display"]

Ignored nodes: comments, script, style
<body
  class=""
  data-app-theme="light"
>
  <div />

[Killed] BlockStatement
src/app/state/appState.tsx:35:19
 export function AppStateProvider({ children }: PropsWithChildren) {
   const [state, dispatch] = useReducer(appStateReducer, undefined, initialState)
 
-  useEffect(() => {
-    applyThemeClass(state.theme)
-    persistTheme(state.theme)
-  }, [state.theme])
+  useEffect(() => {}, [state.theme])
 
   const stateValue = useMemo(() => state, [state])
killedBy: AppStateProvider persists theme changes and updates the DOM attribute
statusReason: expected 'light' to be 'dark' // Object.is equality

[Killed] ArrayDeclaration
src/app/state/appState.tsx:38:6
   useEffect(() => {
     applyThemeClass(state.theme)
     persistTheme(state.theme)
-  }, [state.theme])
+  }, [])
 
   const stateValue = useMemo(() => state, [state])
killedBy: AppStateProvider persists theme changes and updates the DOM attribute
statusReason: expected 'light' to be 'dark' // Object.is equality

[Killed] ArrowFunction
src/app/state/appState.tsx:40:30
     persistTheme(state.theme)
   }, [state.theme])
 
-  const stateValue = useMemo(() => state, [state])
+  const stateValue = useMemo(() => undefined, [state])
   const dispatchValue = useMemo(() => dispatch, [dispatch])
 
killedBy: AppStateProvider provides default state values and updates tenant selection
statusReason: App state context is unavailable

[Killed] ArrowFunction
src/app/state/appState.tsx:41:33
   }, [state.theme])
 
   const stateValue = useMemo(() => state, [state])
-  const dispatchValue = useMemo(() => dispatch, [dispatch])
+  const dispatchValue = useMemo(() => undefined, [dispatch])
 
   return (
killedBy: AppStateProvider provides default state values and updates tenant selection
statusReason: App state context is unavailable
