[Killed] BlockStatement
src/app/state/appStateContext.tsx:9:44
 export const AppStateContext = createContext<AppState | null>(null)
 export const AppDispatchContext = createContext<AppDispatch | null>(null)
 
-export const useAppState = (): AppState => {
-  const context = useContext(AppStateContext)
-  if (!context) {
-    throw new Error(ERROR_MESSAGE_APP_STATE_CONTEXT_UNAVAILABLE)
-  }
-  return context
-}
+export const useAppState = (): AppState => {}
 
 export const useAppDispatch = (): AppDispatch => {
killedBy: AppStateProvider provides default state values and updates tenant selection
statusReason: Cannot destructure property 'theme' of 'useAppState(...)' as it is undefined.

[Killed] BooleanLiteral
src/app/state/appStateContext.tsx:11:7
 
 export const useAppState = (): AppState => {
   const context = useContext(AppStateContext)
-  if (!context) {
+  if (context) {
     throw new Error(ERROR_MESSAGE_APP_STATE_CONTEXT_UNAVAILABLE)
   }
killedBy: AppStateProvider provides default state values and updates tenant selection
statusReason: App state context is unavailable

[Killed] ConditionalExpression
src/app/state/appStateContext.tsx:11:7
 
 export const useAppState = (): AppState => {
   const context = useContext(AppStateContext)
-  if (!context) {
+  if (false) {
     throw new Error(ERROR_MESSAGE_APP_STATE_CONTEXT_UNAVAILABLE)
   }
killedBy: appStateContext hooks throws when useAppState is invoked outside the provider
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/app/state/appStateContext.tsx:17:50
   return context
 }
 
-export const useAppDispatch = (): AppDispatch => {
-  const context = useContext(AppDispatchContext)
-  if (!context) {
-    throw new Error(ERROR_MESSAGE_APP_STATE_CONTEXT_UNAVAILABLE)
-  }
-  return context
-}
+export const useAppDispatch = (): AppDispatch => {}
 
 export const useTheme = (): ThemeName => {
killedBy: appStateContext hooks throws when useAppDispatch is invoked outside the provider
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/app/state/appStateContext.tsx:19:7
 
 export const useAppDispatch = (): AppDispatch => {
   const context = useContext(AppDispatchContext)
-  if (!context) {
+  if (false) {
     throw new Error(ERROR_MESSAGE_APP_STATE_CONTEXT_UNAVAILABLE)
   }
killedBy: appStateContext hooks throws when useAppDispatch is invoked outside the provider
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/app/state/appStateContext.tsx:19:7
 
 export const useAppDispatch = (): AppDispatch => {
   const context = useContext(AppDispatchContext)
-  if (!context) {
+  if (context) {
     throw new Error(ERROR_MESSAGE_APP_STATE_CONTEXT_UNAVAILABLE)
   }
killedBy: appStateContext hooks throws when useAppDispatch is invoked outside the provider
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/app/state/appStateContext.tsx:25:42
   return context
 }
 
-export const useTheme = (): ThemeName => {
-  const { theme } = useAppState()
-  return theme ?? APP_THEME_LIGHT
-}
+export const useTheme = (): ThemeName => {}
 
 
killedBy: appStateContext hooks returns the default theme when wrapped in the provider
statusReason: expected "vi.fn()" to be called with arguments: [ 'light' ]

Received: 

  1st vi.fn() call:

  [
-   "light",

[Killed] LogicalOperator
src/app/state/appStateContext.tsx:27:10
 
 export const useTheme = (): ThemeName => {
   const { theme } = useAppState()
-  return theme ?? APP_THEME_LIGHT
+  return theme && APP_THEME_LIGHT
 }
 
killedBy: AppStateProvider persists theme changes and updates the DOM attribute
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  dark
Received:
  light
