[Killed] BlockStatement
src/errors/AppErrorBoundary.tsx:14:66
 } from '../app/constants'
 import { useLogger } from '../app/logging/loggerContext'
 
-const ErrorFallback = ({ resetErrorBoundary }: FallbackProps) => {
-  const { t } = useTranslation()
-
-  return (
-    <Stack gap={3} className="p-4 align-items-start" data-testid={TEST_ID_ERROR_FALLBACK}>
-      <div>
-        <h2 className="h4 mb-1">{t(I18N_KEY_APP_ERROR_TITLE)}</h2>
-        <p className="mb-0 text-body-secondary">{t(I18N_KEY_APP_ERROR_MESSAGE)}</p>
-      </div>
-      <Button variant="primary" onClick={resetErrorBoundary}>
-        {t(I18N_KEY_APP_ERROR_RESET)}
-      </Button>
-    </Stack>
-  )
-}
+const ErrorFallback = ({ resetErrorBoundary }: FallbackProps) => {}
 
 export function AppErrorBoundary({ children }: { children: React.ReactNode }) {
killedBy: AppProviders renders the error fallback when a child throws
statusReason: Unable to find an element with the text: We hit a snag. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div>

[Killed] BlockStatement
src/errors/AppErrorBoundary.tsx:30:79
   )
 }
 
-export function AppErrorBoundary({ children }: { children: React.ReactNode }) {
-  const logger = useLogger()
-
-  return (
-    <ErrorBoundary
-      FallbackComponent={ErrorFallback}
-      onError={(error, info) => {
-        logger.error(error, { componentStack: info.componentStack })
-      }}
-    >
-      {children}
-    </ErrorBoundary>
-  )
-}
+export function AppErrorBoundary({ children }: { children: React.ReactNode }) {}
 
 
killedBy: AppProviders renders the dashboard heading by default
statusReason: Unable to find an element with the text: Operational overview. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div>

[Survived] BlockStatement
src/errors/AppErrorBoundary.tsx:36:33
   return (
     <ErrorBoundary
       FallbackComponent={ErrorFallback}
-      onError={(error, info) => {
-        logger.error(error, { componentStack: info.componentStack })
-      }}
+      onError={(error, info) => {}}
     >
       {children}
