[Killed] ArrowFunction
src/errors/mappers.ts:12:37
   variant: NotificationVariant
 }
 
-export const mapErrorToDescriptor = (): AppErrorDescriptor => ({
-  titleKey: I18N_KEY_APP_ERROR_TITLE,
-  descriptionKey: I18N_KEY_APP_ERROR_MESSAGE,
-  variant: NOTIFICATION_VARIANT_ERROR,
-})
+export const mapErrorToDescriptor = () => undefined
 
 export const mapApiExceptionToDescriptor = (error: ApiException): AppErrorDescriptor => ({
killedBy: handleQueryError falls back to generic notifications for unknown errors
statusReason: Cannot read properties of undefined (reading 'titleKey')

[Killed] ObjectLiteral
src/errors/mappers.ts:12:64
   variant: NotificationVariant
 }
 
-export const mapErrorToDescriptor = (): AppErrorDescriptor => ({
-  titleKey: I18N_KEY_APP_ERROR_TITLE,
-  descriptionKey: I18N_KEY_APP_ERROR_MESSAGE,
-  variant: NOTIFICATION_VARIANT_ERROR,
-})
+export const mapErrorToDescriptor = (): AppErrorDescriptor => ({})
 
 export const mapApiExceptionToDescriptor = (error: ApiException): AppErrorDescriptor => ({
killedBy: handleQueryError falls back to generic notifications for unknown errors
statusReason: expected undefined to be 'app.error.title' // Object.is equality

[Killed] ArrowFunction
src/errors/mappers.ts:18:44
   variant: NOTIFICATION_VARIANT_ERROR,
 })
 
-export const mapApiExceptionToDescriptor = (error: ApiException): AppErrorDescriptor => ({
-  titleKey: error.errorCode || I18N_KEY_APP_ERROR_TITLE,
-  descriptionKey: I18N_KEY_APP_ERROR_MESSAGE,
-  variant: NOTIFICATION_VARIANT_ERROR,
-})
+export const mapApiExceptionToDescriptor = () => undefined
 
 export const convertDescriptorToToastPayload = (descriptor: AppErrorDescriptor): ToastNotificationPayload => ({
killedBy: QueryErrorObserver converts query error events into toast notifications
statusReason: Cannot read properties of undefined (reading 'titleKey')

[Killed] LogicalOperator
src/errors/mappers.ts:19:13
 })
 
 export const mapApiExceptionToDescriptor = (error: ApiException): AppErrorDescriptor => ({
-  titleKey: error.errorCode || I18N_KEY_APP_ERROR_TITLE,
+  titleKey: error.errorCode && I18N_KEY_APP_ERROR_TITLE,
   descriptionKey: I18N_KEY_APP_ERROR_MESSAGE,
   variant: NOTIFICATION_VARIANT_ERROR,
killedBy: QueryErrorObserver converts query error events into toast notifications
statusReason: expected "vi.fn()" to be called with arguments: [ 'notification:toast', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "notification:toast",

[Killed] ConditionalExpression
src/errors/mappers.ts:19:13
 })
 
 export const mapApiExceptionToDescriptor = (error: ApiException): AppErrorDescriptor => ({
-  titleKey: error.errorCode || I18N_KEY_APP_ERROR_TITLE,
+  titleKey: true,
   descriptionKey: I18N_KEY_APP_ERROR_MESSAGE,
   variant: NOTIFICATION_VARIANT_ERROR,
killedBy: QueryErrorObserver converts query error events into toast notifications
statusReason: expected "vi.fn()" to be called with arguments: [ 'notification:toast', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "notification:toast",

[Killed] ArrowFunction
src/errors/mappers.ts:24:48
   variant: NOTIFICATION_VARIANT_ERROR,
 })
 
-export const convertDescriptorToToastPayload = (descriptor: AppErrorDescriptor): ToastNotificationPayload => ({
-  titleKey: descriptor.titleKey,
-  descriptionKey: descriptor.descriptionKey,
-  variant: descriptor.variant,
-})
+export const convertDescriptorToToastPayload = () => undefined
 
 export const mapApiException = (error: ApiException): ToastNotificationPayload => {
killedBy: QueryErrorObserver converts query error events into toast notifications
statusReason: expected "vi.fn()" to be called with arguments: [ 'notification:toast', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "notification:toast",

[Killed] BlockStatement
src/errors/mappers.ts:30:83
   variant: descriptor.variant,
 })
 
-export const mapApiException = (error: ApiException): ToastNotificationPayload => {
-  return convertDescriptorToToastPayload(mapApiExceptionToDescriptor(error))
-}
+export const mapApiException = (error: ApiException): ToastNotificationPayload => {}
 
 export const mapErrorToNotification = (): ToastNotificationPayload => {
killedBy: QueryErrorObserver converts query error events into toast notifications
statusReason: expected "vi.fn()" to be called with arguments: [ 'notification:toast', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "notification:toast",

[Killed] BlockStatement
src/errors/mappers.ts:34:71
   return convertDescriptorToToastPayload(mapApiExceptionToDescriptor(error))
 }
 
-export const mapErrorToNotification = (): ToastNotificationPayload => {
-  return convertDescriptorToToastPayload(mapErrorToDescriptor())
-}
+export const mapErrorToNotification = (): ToastNotificationPayload => {}
 
killedBy: handleQueryError falls back to generic notifications for unknown errors
statusReason: Cannot read properties of undefined (reading 'titleKey')
