[Killed] BlockStatement
src/forms/Form.tsx:25:32
   defaultValues,
   onSubmit,
   children,
-}: AppFormProps<TFieldValues>) {
-  const methods = useForm<TFieldValues>({
-    defaultValues,
-    resolver: joiResolver(schema),
-    mode: FORM_VALIDATION_MODE,
-    reValidateMode: FORM_REVALIDATION_MODE,
-  })
-
-  const handleSubmit = methods.handleSubmit(async (values) => {
-    await onSubmit(values)
-  })
-
-  return (
-    <FormProvider {...methods}>
-      <form noValidate onSubmit={handleSubmit}>
-        {children}
-      </form>
-    </FormProvider>
-  )
-}
+}: AppFormProps<TFieldValues>) {}
 
 
killedBy: AppForm renders validation errors when fields are missing
statusReason: Unable to find an element with the text: submit. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/forms/Form.tsx:33:63
     reValidateMode: FORM_REVALIDATION_MODE,
   })
 
-  const handleSubmit = methods.handleSubmit(async (values) => {
-    await onSubmit(values)
-  })
+  const handleSubmit = methods.handleSubmit(async (values) => {})
 
   return (
killedBy: AppForm submits values when inputs are valid
statusReason: expected "vi.fn()" to be called with arguments: [ { username: 'admin-user', …(1) } ]

Number of calls: 0
