[Killed] BlockStatement
src/notifications/ToastProvider.tsx:26:6
   variant: NotificationVariant,
   message: string,
   options: Partial<ToastOptions>,
-) => {
-  switch (variant) {
-    case NOTIFICATION_VARIANT_SUCCESS:
-      toast.success(message, options)
-      return
-    case NOTIFICATION_VARIANT_ERROR:
-      toast.error(message, options)
-      return
-    case NOTIFICATION_VARIANT_WARNING:
-      toast(message, options)
-      return
-    default:
-      toast(message, options)
-  }
-}
+) => {}
 
 export function ToastProvider() {
killedBy: AppProviders renders toasts when notification events are published
statusReason: Unable to find an element with the text: Simple License Admin. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div>

[Survived] ConditionalExpression
src/notifications/ToastProvider.tsx:28:5
   options: Partial<ToastOptions>,
 ) => {
   switch (variant) {
-    case NOTIFICATION_VARIANT_SUCCESS:
-      toast.success(message, options)
-      return
+    case NOTIFICATION_VARIANT_SUCCESS:
     case NOTIFICATION_VARIANT_ERROR:
       toast.error(message, options)

[Survived] ConditionalExpression
src/notifications/ToastProvider.tsx:31:5
     case NOTIFICATION_VARIANT_SUCCESS:
       toast.success(message, options)
       return
-    case NOTIFICATION_VARIANT_ERROR:
-      toast.error(message, options)
-      return
+    case NOTIFICATION_VARIANT_ERROR:
     case NOTIFICATION_VARIANT_WARNING:
       toast(message, options)

[Survived] ConditionalExpression
src/notifications/ToastProvider.tsx:34:5
     case NOTIFICATION_VARIANT_ERROR:
       toast.error(message, options)
       return
-    case NOTIFICATION_VARIANT_WARNING:
-      toast(message, options)
-      return
+    case NOTIFICATION_VARIANT_WARNING:
     default:
       toast(message, options)

[Killed] ConditionalExpression
src/notifications/ToastProvider.tsx:37:5
     case NOTIFICATION_VARIANT_WARNING:
       toast(message, options)
       return
-    default:
-      toast(message, options)
+    default:
   }
 }
killedBy: AppProviders renders toasts when notification events are published
statusReason: Unable to find an element with the text: Simple License Admin. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div>

[Killed] BlockStatement
src/notifications/ToastProvider.tsx:46:19
   const bus = useNotificationBus()
   const { t } = useTranslation()
 
-  useEffect(() => {
-    const handler = (payload: ToastNotificationPayload) => {
-      const variant = payload.variant ?? DEFAULT_NOTIFICATION_VARIANT
-      const title = t(payload.titleKey)
-      const description = payload.descriptionKey ? t(payload.descriptionKey) : ''
-      const renderedMessage = description ? `${title} - ${description}` : title
-
-      showToastByVariant(variant, renderedMessage, {
-        id: payload.id,
-        duration: DEFAULT_NOTIFICATION_DURATION,
-        position: DEFAULT_NOTIFICATION_POSITION,
-      })
-    }
-
-    bus.on(NOTIFICATION_EVENT_TOAST, handler)
-
-    return () => {
-      bus.off(NOTIFICATION_EVENT_TOAST, handler)
-    }
-  }, [bus, t])
+  useEffect(() => {}, [bus, t])
 
   return (
killedBy: AppProviders renders toasts when notification events are published
statusReason: Unable to find an element with the text: Simple License Admin. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div>

[Killed] BlockStatement
src/notifications/ToastProvider.tsx:47:60
   const { t } = useTranslation()
 
   useEffect(() => {
-    const handler = (payload: ToastNotificationPayload) => {
-      const variant = payload.variant ?? DEFAULT_NOTIFICATION_VARIANT
-      const title = t(payload.titleKey)
-      const description = payload.descriptionKey ? t(payload.descriptionKey) : ''
-      const renderedMessage = description ? `${title} - ${description}` : title
-
-      showToastByVariant(variant, renderedMessage, {
-        id: payload.id,
-        duration: DEFAULT_NOTIFICATION_DURATION,
-        position: DEFAULT_NOTIFICATION_POSITION,
-      })
-    }
+    const handler = (payload: ToastNotificationPayload) => {}
 
     bus.on(NOTIFICATION_EVENT_TOAST, handler)
killedBy: AppProviders renders toasts when notification events are published
statusReason: Unable to find an element with the text: Simple License Admin. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div>

[Survived] LogicalOperator
src/notifications/ToastProvider.tsx:48:23
 
   useEffect(() => {
     const handler = (payload: ToastNotificationPayload) => {
-      const variant = payload.variant ?? DEFAULT_NOTIFICATION_VARIANT
+      const variant = payload.variant && DEFAULT_NOTIFICATION_VARIANT
       const title = t(payload.titleKey)
       const description = payload.descriptionKey ? t(payload.descriptionKey) : ''

[Killed] StringLiteral
src/notifications/ToastProvider.tsx:50:80
     const handler = (payload: ToastNotificationPayload) => {
       const variant = payload.variant ?? DEFAULT_NOTIFICATION_VARIANT
       const title = t(payload.titleKey)
-      const description = payload.descriptionKey ? t(payload.descriptionKey) : ''
+      const description = payload.descriptionKey ? t(payload.descriptionKey) : "Stryker was here!"
       const renderedMessage = description ? `${title} - ${description}` : title
 
killedBy: AppProviders renders toasts when notification events are published
statusReason: Unable to find an element with the text: Simple License Admin. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div>

[Killed] ObjectLiteral
src/notifications/ToastProvider.tsx:53:52
       const description = payload.descriptionKey ? t(payload.descriptionKey) : ''
       const renderedMessage = description ? `${title} - ${description}` : title
 
-      showToastByVariant(variant, renderedMessage, {
-        id: payload.id,
-        duration: DEFAULT_NOTIFICATION_DURATION,
-        position: DEFAULT_NOTIFICATION_POSITION,
-      })
+      showToastByVariant(variant, renderedMessage, {})
     }
 
killedBy: AppProviders renders warning toasts with descriptions
statusReason: Found multiple elements with the text: (content) => typeof content === "string" && content.includes(TAGLINE_TEXT)

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  aria-live="polite"
  class="go3958317564"

[Survived] BlockStatement
src/notifications/ToastProvider.tsx:62:18
 
     bus.on(NOTIFICATION_EVENT_TOAST, handler)
 
-    return () => {
-      bus.off(NOTIFICATION_EVENT_TOAST, handler)
-    }
+    return () => {}
   }, [bus, t])
 

[Survived] ArrayDeclaration
src/notifications/ToastProvider.tsx:65:6
     return () => {
       bus.off(NOTIFICATION_EVENT_TOAST, handler)
     }
-  }, [bus, t])
+  }, [])
 
   return (
