[Killed] BlockStatement
src/notifications/bus.tsx:8:87
 import { NotificationBusContext } from './busContext'
 import type { NotificationEventMap } from './types'
 
-export function NotificationBusProvider({ children }: PropsWithChildren): JSX.Element {
-  const bus = useMemo(() => mitt<NotificationEventMap>(), [])
-
-  return <NotificationBusContext.Provider value={bus}>{children}</NotificationBusContext.Provider>
-}
+export function NotificationBusProvider({ children }: PropsWithChildren): JSX.Element {}
 
 
killedBy: AppProviders renders the dashboard heading by default
statusReason: Unable to find an element with the text: Operational overview. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div />

[Killed] ArrowFunction
src/notifications/bus.tsx:9:23
 import type { NotificationEventMap } from './types'
 
 export function NotificationBusProvider({ children }: PropsWithChildren): JSX.Element {
-  const bus = useMemo(() => mitt<NotificationEventMap>(), [])
+  const bus = useMemo(() => undefined, [])
 
   return <NotificationBusContext.Provider value={bus}>{children}</NotificationBusContext.Provider>
killedBy: AppProviders renders the dashboard heading by default
statusReason: Notification bus context is unavailable

[Survived] ArrayDeclaration
src/notifications/bus.tsx:9:59
 import type { NotificationEventMap } from './types'
 
 export function NotificationBusProvider({ children }: PropsWithChildren): JSX.Element {
-  const bus = useMemo(() => mitt<NotificationEventMap>(), [])
+  const bus = useMemo(() => mitt<NotificationEventMap>(), ["Stryker was here"])
 
   return <NotificationBusContext.Provider value={bus}>{children}</NotificationBusContext.Provider>
