[Killed] BlockStatement
src/notifications/busContext.tsx:8:58
 
 export const NotificationBusContext = createContext<NotificationBus | null>(null)
 
-export const useNotificationBus = (): NotificationBus => {
-  const context = useContext(NotificationBusContext)
-  if (!context) {
-    throw new Error(ERROR_MESSAGE_NOTIFICATION_CONTEXT_UNAVAILABLE)
-  }
-  return context
-}
+export const useNotificationBus = (): NotificationBus => {}
 
 
killedBy: AppProviders renders the dashboard heading by default
statusReason: Cannot read properties of undefined (reading 'on')

[Killed] BooleanLiteral
src/notifications/busContext.tsx:10:7
 
 export const useNotificationBus = (): NotificationBus => {
   const context = useContext(NotificationBusContext)
-  if (!context) {
+  if (context) {
     throw new Error(ERROR_MESSAGE_NOTIFICATION_CONTEXT_UNAVAILABLE)
   }
killedBy: AppProviders renders the dashboard heading by default
statusReason: Notification bus context is unavailable

[Killed] BlockStatement
src/notifications/busContext.tsx:10:17
 
 export const useNotificationBus = (): NotificationBus => {
   const context = useContext(NotificationBusContext)
-  if (!context) {
-    throw new Error(ERROR_MESSAGE_NOTIFICATION_CONTEXT_UNAVAILABLE)
-  }
+  if (!context) {}
   return context
 }
killedBy: NotificationBusContext throws when used outside of the provider
statusReason: expected [Function] to throw an error
