[Killed] BlockStatement
src/routes/auth/AuthRoute.tsx:6:38
 
 import { I18N_KEY_AUTH_HEADING } from '../../app/constants'
 
-export function AuthRouteComponent() {
-  const { t } = useTranslation()
-
-  return (
-    <Card>
-      <Card.Body>
-        <h1 className="h4">{t(I18N_KEY_AUTH_HEADING)}</h1>
-      </Card.Body>
-    </Card>
-  )
-}
+export function AuthRouteComponent() {}
 
 
killedBy: AuthRouteComponent renders the localized authentication heading
statusReason: Unable to find an accessible element with the role "heading" and name "Authenticate to continue"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</
