[Killed] BlockStatement
src/routes/dashboard/DashboardRoute.tsx:6:43
 
 import { I18N_KEY_DASHBOARD_HEADING } from '../../app/constants'
 
-export function DashboardRouteComponent() {
-  const { t } = useTranslation()
-
-  return (
-    <Card>
-      <Card.Body>
-        <h1 className="h4">{t(I18N_KEY_DASHBOARD_HEADING)}</h1>
-      </Card.Body>
-    </Card>
-  )
-}
+export function DashboardRouteComponent() {}
 
 
killedBy: AppProviders renders the dashboard heading by default
statusReason: Unable to find an element with the text: Operational overview. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div>
