[Killed] BlockStatement
src/routes/notFound/NotFoundRoute.tsx:6:42
 
 import { I18N_KEY_NOT_FOUND_BODY, I18N_KEY_NOT_FOUND_TITLE } from '../../app/constants'
 
-export function NotFoundRouteComponent() {
-  const { t } = useTranslation()
-
-  return (
-    <Alert variant="warning">
-      <Alert.Heading>{t(I18N_KEY_NOT_FOUND_TITLE)}</Alert.Heading>
-      <p className="mb-0">{t(I18N_KEY_NOT_FOUND_BODY)}</p>
-    </Alert>
-  )
-}
+export function NotFoundRouteComponent() {}
 
 
killedBy: router configuration renders the not found route for unknown paths
statusReason: Unable to find an element with the text: This route is unavailable. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div>
