[Killed] BlockStatement
src/routes/root/RootRoute.tsx:7:38
 
 import { I18N_KEY_APP_BRAND, I18N_KEY_APP_TAGLINE, TEST_ID_APP_SHELL } from '../../app/constants'
 
-export function RootRouteComponent() {
-  const { t } = useTranslation()
-
-  return (
-    <>
-      <Navbar bg="dark" data-testid={TEST_ID_APP_SHELL} variant="dark" className="mb-4">
-        <Container fluid className="justify-content-between">
-          <div>
-            <Navbar.Brand>{t(I18N_KEY_APP_BRAND)}</Navbar.Brand>
-            <small className="text-light-emphasis">{t(I18N_KEY_APP_TAGLINE)}</small>
-          </div>
-        </Container>
-      </Navbar>
-      <Container fluid>
-        <Outlet />
-      </Container>
-    </>
-  )
-}
+export function RootRouteComponent() {}
 
 
killedBy: AppProviders renders the dashboard heading by default
statusReason: Unable to find an element with the text: Operational overview. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"
>
  <div>
