[Killed] LogicalOperator
src/ui/data/CardList.tsx:26:91
 }: CardListProps) {
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <div className={composeClassNames(UI_CLASS_CARD_LIST_GRID, className)} data-testid={testId ?? UI_TEST_ID_CARD_LIST}>
+      <div className={composeClassNames(UI_CLASS_CARD_LIST_GRID, className)} data-testid={testId && UI_TEST_ID_CARD_LIST}>
         {items.map((item) => (
           <div key={item.id} className={composeClassNames('col-12', UI_CLASS_CARD_COLUMN_MAP[columns])}>
killedBy: Data primitives CardList renders cards for each item
statusReason: Unable to find an element by: [data-testid="ui-card-list"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="row g-4"
    >

[Killed] ArrowFunction
src/ui/data/CardList.tsx:27:20
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <div className={composeClassNames(UI_CLASS_CARD_LIST_GRID, className)} data-testid={testId ?? UI_TEST_ID_CARD_LIST}>
-        {items.map((item) => (
-          <div key={item.id} className={composeClassNames('col-12', UI_CLASS_CARD_COLUMN_MAP[columns])}>
-            <Card
-              className={UI_CLASS_CARD_LIST_CARD}
-              onClick={item.onClick}
-              role={item.onClick ? 'button' : undefined}
-              data-testid={item.testId}
-            >
-              <Card.Body>
-                <div className="d-flex justify-content-between align-items-start mb-2">
-                  <Card.Title className="h5 mb-0">{item.title}</Card.Title>
-                  {item.icon}
-                </div>
-                {item.subtitle ? <Card.Subtitle className={UI_CLASS_TEXT_MUTED}>{item.subtitle}</Card.Subtitle> : null}
-                {item.body ? <Card.Text className="mt-3">{item.body}</Card.Text> : null}
-              </Card.Body>
-              {item.footer ? <Card.Footer>{item.footer}</Card.Footer> : null}
-            </Card>
-          </div>
-        ))}
+        {items.map(() => undefined)}
       </div>
     </VisibilityGate>
killedBy: Data primitives CardList invokes item onClick handlers
statusReason: Unable to find an accessible element with the role "button"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] StringLiteral
src/ui/data/CardList.tsx:32:36
             <Card
               className={UI_CLASS_CARD_LIST_CARD}
               onClick={item.onClick}
-              role={item.onClick ? 'button' : undefined}
+              role={item.onClick ? "" : undefined}
               data-testid={item.testId}
             >
killedBy: Data primitives CardList invokes item onClick handlers
statusReason: Unable to find an accessible element with the role "button"

Here are the accessible roles:

  :

  Name "":
  <div
