[Killed] BlockStatement
src/ui/data/Chip.tsx:23:15
   ability,
   permissionKey,
   permissionFallback,
-}: ChipProps) {
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <Badge
-        bg={variant}
-        className={composeClassNames(UI_CLASS_CHIP, className)}
-        data-testid={testId ?? UI_TEST_ID_CHIP}
-      >
-        {icon}
-        <span>{label}</span>
-        {onRemove ? (
-          <button
-            type="button"
-            className={UI_CLASS_CHIP_REMOVE_BUTTON}
-            onClick={onRemove}
-            aria-label="remove chip"
-          />
-        ) : null}
-      </Badge>
-    </VisibilityGate>
-  )
-}
+}: ChipProps) {}
 
 
killedBy: Data primitives Chip renders label text and supports removal action
statusReason: Unable to find an accessible element with the role "button"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/ui/data/Chip.tsx:29:22
       <Badge
         bg={variant}
         className={composeClassNames(UI_CLASS_CHIP, className)}
-        data-testid={testId ?? UI_TEST_ID_CHIP}
+        data-testid={testId && UI_TEST_ID_CHIP}
       >
         {icon}
killedBy: Data primitives Chip renders label text and supports removal action
statusReason: Unable to find an element by: [data-testid="ui-chip"]

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      class="badge rounded-pill d-inline-flex align-items-center gap-2 badge bg-secondary"
    >
