[Killed] BlockStatement
src/ui/data/SummaryList.tsx:19:22
   ability,
   permissionKey,
   permissionFallback,
-}: SummaryListProps) {
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <div className={composeClassNames(UI_CLASS_SUMMARY_LIST, className)} data-testid={testId ?? UI_TEST_ID_SUMMARY_LIST}>
-        {items.map((item) => (
-          <div key={item.id}>
-            <div className={UI_CLASS_SUMMARY_CARD} data-testid={item.testId}>
-              <div className="d-flex justify-content-between align-items-center mb-2">
-                <span className={UI_CLASS_TEXT_MUTED}>{item.label}</span>
-                {item.icon}
-              </div>
-              <strong className={UI_CLASS_SUMMARY_VALUE}>{item.value}</strong>
-              {item.trend ? <div className={UI_CLASS_TEXT_MUTED}>{item.trend}</div> : null}
-            </div>
-          </div>
-        ))}
-      </div>
-    </VisibilityGate>
-  )
-}
+}: SummaryListProps) {}
 
 
killedBy: Data primitives SummaryList displays card values
statusReason: Unable to find an element by: [data-testid="ui-summary-list"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/ui/data/SummaryList.tsx:22:89
 }: SummaryListProps) {
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <div className={composeClassNames(UI_CLASS_SUMMARY_LIST, className)} data-testid={testId ?? UI_TEST_ID_SUMMARY_LIST}>
+      <div className={composeClassNames(UI_CLASS_SUMMARY_LIST, className)} data-testid={testId && UI_TEST_ID_SUMMARY_LIST}>
         {items.map((item) => (
           <div key={item.id}>
killedBy: Data primitives SummaryList displays card values
statusReason: Unable to find an element by: [data-testid="ui-summary-list"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="row row-cols-1 row-cols-md-2 g-3"
    >

[Survived] ArrowFunction
src/ui/data/SummaryList.tsx:23:20
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <div className={composeClassNames(UI_CLASS_SUMMARY_LIST, className)} data-testid={testId ?? UI_TEST_ID_SUMMARY_LIST}>
-        {items.map((item) => (
-          <div key={item.id}>
-            <div className={UI_CLASS_SUMMARY_CARD} data-testid={item.testId}>
-              <div className="d-flex justify-content-between align-items-center mb-2">
-                <span className={UI_CLASS_TEXT_MUTED}>{item.label}</span>
-                {item.icon}
-              </div>
-              <strong className={UI_CLASS_SUMMARY_VALUE}>{item.value}</strong>
-              {item.trend ? <div className={UI_CLASS_TEXT_MUTED}>{item.trend}</div> : null}
-            </div>
-          </div>
-        ))}
+        {items.map(() => undefined)}
       </div>
     </VisibilityGate>
