[Killed] BlockStatement
src/ui/data/TableToolbar.tsx:19:23
   ability,
   permissionKey,
   permissionFallback,
-}: TableToolbarProps) {
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <div
-        className={composeClassNames(UI_CLASS_TABLE_TOOLBAR, className)}
-        data-testid={testId ?? UI_TEST_ID_TABLE_TOOLBAR}
-      >
-        <div className={UI_CLASS_INLINE_GAP}>{start ?? children}</div>
-        <div className={UI_CLASS_INLINE_GAP}>{end}</div>
-      </div>
-    </VisibilityGate>
-  )
-}
+}: TableToolbarProps) {}
 
 
killedBy: Data primitives TableToolbar renders start and end slots
statusReason: Unable to find an element by: [data-testid="toolbar"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/ui/data/TableToolbar.tsx:24:22
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <div
         className={composeClassNames(UI_CLASS_TABLE_TOOLBAR, className)}
-        data-testid={testId ?? UI_TEST_ID_TABLE_TOOLBAR}
+        data-testid={testId && UI_TEST_ID_TABLE_TOOLBAR}
       >
         <div className={UI_CLASS_INLINE_GAP}>{start ?? children}</div>
killedBy: Data primitives TableToolbar renders start and end slots
statusReason: Unable to find an element by: [data-testid="toolbar"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-wrap justify-content-between align-items-center gap-3 mb-3"
      data-testid="ui-table-toolbar"

[Killed] LogicalOperator
src/ui/data/TableToolbar.tsx:26:47
         className={composeClassNames(UI_CLASS_TABLE_TOOLBAR, className)}
         data-testid={testId ?? UI_TEST_ID_TABLE_TOOLBAR}
       >
-        <div className={UI_CLASS_INLINE_GAP}>{start ?? children}</div>
+        <div className={UI_CLASS_INLINE_GAP}>{start && children}</div>
         <div className={UI_CLASS_INLINE_GAP}>{end}</div>
       </div>
killedBy: Data primitives TableToolbar renders children fallback when start slot omitted
statusReason: Unable to find an element with the text: aiunt. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-wrap justify-content-between align-items-center gap-3 mb-3"
      data-testid="ui-table-toolbar"
