[Killed] BlockStatement
src/ui/data/TagList.tsx:19:18
   ability,
   permissionKey,
   permissionFallback,
-}: TagListProps) {
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <div className={composeClassNames(UI_CLASS_TAG_LIST, className)} data-testid={testId ?? UI_TEST_ID_TAG_LIST}>
-        {tags.map((tag) => (
-          <Badge key={tag.id} bg={tag.variant ?? UI_TAG_VARIANT_NEUTRAL}>
-            {tag.label}
-          </Badge>
-        ))}
-      </div>
-    </VisibilityGate>
-  )
-}
+}: TagListProps) {}
 
 
killedBy: Data primitives TagList renders provided tags
statusReason: Unable to find an element by: [data-testid="ui-tag-list"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/ui/data/TagList.tsx:22:85
 }: TagListProps) {
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <div className={composeClassNames(UI_CLASS_TAG_LIST, className)} data-testid={testId ?? UI_TEST_ID_TAG_LIST}>
+      <div className={composeClassNames(UI_CLASS_TAG_LIST, className)} data-testid={testId && UI_TEST_ID_TAG_LIST}>
         {tags.map((tag) => (
           <Badge key={tag.id} bg={tag.variant ?? UI_TAG_VARIANT_NEUTRAL}>
killedBy: Data primitives TagList renders provided tags
statusReason: Unable to find an element by: [data-testid="ui-tag-list"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-wrap gap-2"
    >

[Survived] ArrowFunction
src/ui/data/TagList.tsx:23:19
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <div className={composeClassNames(UI_CLASS_TAG_LIST, className)} data-testid={testId ?? UI_TEST_ID_TAG_LIST}>
-        {tags.map((tag) => (
-          <Badge key={tag.id} bg={tag.variant ?? UI_TAG_VARIANT_NEUTRAL}>
-            {tag.label}
-          </Badge>
-        ))}
+        {tags.map(() => undefined)}
       </div>
     </VisibilityGate>

[Survived] LogicalOperator
src/ui/data/TagList.tsx:24:35
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <div className={composeClassNames(UI_CLASS_TAG_LIST, className)} data-testid={testId ?? UI_TEST_ID_TAG_LIST}>
         {tags.map((tag) => (
-          <Badge key={tag.id} bg={tag.variant ?? UI_TAG_VARIANT_NEUTRAL}>
+          <Badge key={tag.id} bg={tag.variant && UI_TAG_VARIANT_NEUTRAL}>
             {tag.label}
           </Badge>
