[Killed] BlockStatement
src/ui/feedback/SectionStatus.tsx:43:24
   ability,
   permissionKey,
   permissionFallback,
-}: SectionStatusProps) {
-  const renderIndicator = () => {
-    if (status === UI_SECTION_STATUS_LOADING) {
-      return <Spinner animation="border" size="sm" />
-    }
-    const badgeVariant = STATUS_VARIANT_MAP[status] ?? UI_BADGE_VARIANT_INFO
-    return <Badge bg={badgeVariant}>{status}</Badge>
-  }
-
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <section className={composeClassNames(UI_CLASS_SECTION_STATUS, className)} data-testid={testId ?? UI_TEST_ID_SECTION_STATUS}>
-        <div className={UI_CLASS_INLINE_GAP}>{renderIndicator()}</div>
-        <div className={UI_CLASS_SECTION_STATUS_CONTENT}>
-          <strong>{title}</strong>
-          {message ? <p className={UI_CLASS_TEXT_MUTED}>{message}</p> : null}
-          {meta?.timestamp ? <p className={UI_CLASS_TEXT_MUTED}>{meta.timestamp}</p> : null}
-          {meta?.helperText ? <p className={UI_CLASS_TEXT_MUTED}>{meta.helperText}</p> : null}
-        </div>
-        {actions ? <div className={UI_CLASS_ALERT_ACTIONS}>{actions}</div> : null}
-      </section>
-    </VisibilityGate>
-  )
-}
+}: SectionStatusProps) {}
 
 
killedBy: Feedback primitives SectionStatus displays title
statusReason: Unable to find an element by: [data-testid="ui-section-status"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/ui/feedback/SectionStatus.tsx:44:33
   permissionKey,
   permissionFallback,
 }: SectionStatusProps) {
-  const renderIndicator = () => {
-    if (status === UI_SECTION_STATUS_LOADING) {
-      return <Spinner animation="border" size="sm" />
-    }
-    const badgeVariant = STATUS_VARIANT_MAP[status] ?? UI_BADGE_VARIANT_INFO
-    return <Badge bg={badgeVariant}>{status}</Badge>
-  }
+  const renderIndicator = () => {}
 
   return (
killedBy: Feedback primitives SectionStatus renders loading indicator for pending status
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] EqualityOperator
src/ui/feedback/SectionStatus.tsx:45:9
   permissionFallback,
 }: SectionStatusProps) {
   const renderIndicator = () => {
-    if (status === UI_SECTION_STATUS_LOADING) {
+    if (status !== UI_SECTION_STATUS_LOADING) {
       return <Spinner animation="border" size="sm" />
     }
killedBy: Feedback primitives SectionStatus renders loading indicator for pending status
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] ConditionalExpression
src/ui/feedback/SectionStatus.tsx:45:9
   permissionFallback,
 }: SectionStatusProps) {
   const renderIndicator = () => {
-    if (status === UI_SECTION_STATUS_LOADING) {
+    if (false) {
       return <Spinner animation="border" size="sm" />
     }
killedBy: Feedback primitives SectionStatus renders loading indicator for pending status
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Survived] LogicalOperator
src/ui/feedback/SectionStatus.tsx:48:26
     if (status === UI_SECTION_STATUS_LOADING) {
       return <Spinner animation="border" size="sm" />
     }
-    const badgeVariant = STATUS_VARIANT_MAP[status] ?? UI_BADGE_VARIANT_INFO
+    const badgeVariant = STATUS_VARIANT_MAP[status] && UI_BADGE_VARIANT_INFO
     return <Badge bg={badgeVariant}>{status}</Badge>
   }

[Killed] LogicalOperator
src/ui/feedback/SectionStatus.tsx:54:95
 
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <section className={composeClassNames(UI_CLASS_SECTION_STATUS, className)} data-testid={testId ?? UI_TEST_ID_SECTION_STATUS}>
+      <section className={composeClassNames(UI_CLASS_SECTION_STATUS, className)} data-testid={testId && UI_TEST_ID_SECTION_STATUS}>
         <div className={UI_CLASS_INLINE_GAP}>{renderIndicator()}</div>
         <div className={UI_CLASS_SECTION_STATUS_CONTENT}>
killedBy: Feedback primitives SectionStatus displays title
statusReason: Unable to find an element by: [data-testid="ui-section-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="d-flex flex-wrap align-items-center justify-content-between gap-3 p-3 border rounded"
    >

[Killed] OptionalChaining
src/ui/feedback/SectionStatus.tsx:59:12
         <div className={UI_CLASS_SECTION_STATUS_CONTENT}>
           <strong>{title}</strong>
           {message ? <p className={UI_CLASS_TEXT_MUTED}>{message}</p> : null}
-          {meta?.timestamp ? <p className={UI_CLASS_TEXT_MUTED}>{meta.timestamp}</p> : null}
+          {meta.timestamp ? <p className={UI_CLASS_TEXT_MUTED}>{meta.timestamp}</p> : null}
           {meta?.helperText ? <p className={UI_CLASS_TEXT_MUTED}>{meta.helperText}</p> : null}
         </div>
killedBy: Feedback primitives SectionStatus displays title
statusReason: Cannot read properties of undefined (reading 'timestamp')

[Killed] OptionalChaining
src/ui/feedback/SectionStatus.tsx:60:12
           <strong>{title}</strong>
           {message ? <p className={UI_CLASS_TEXT_MUTED}>{message}</p> : null}
           {meta?.timestamp ? <p className={UI_CLASS_TEXT_MUTED}>{meta.timestamp}</p> : null}
-          {meta?.helperText ? <p className={UI_CLASS_TEXT_MUTED}>{meta.helperText}</p> : null}
+          {meta.helperText ? <p className={UI_CLASS_TEXT_MUTED}>{meta.helperText}</p> : null}
         </div>
         {actions ? <div className={UI_CLASS_ALERT_ACTIONS}>{actions}</div> : null}
killedBy: Feedback primitives SectionStatus displays title
statusReason: Cannot read properties of undefined (reading 'helperText')
