[Survived] StringLiteral
src/ui/forms/FormField.tsx:21:12
   hint,
   error,
   required,
-  layout = 'vertical',
+  layout = "",
   className,
   testId,

[Survived] LogicalOperator
src/ui/forms/FormField.tsx:31:87
 }: FormFieldProps) {
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <div className={composeClassNames(UI_CLASS_FORM_FIELD, className)} data-testid={testId ?? UI_TEST_ID_FORM_FIELD}>
+      <div className={composeClassNames(UI_CLASS_FORM_FIELD, className)} data-testid={testId && UI_TEST_ID_FORM_FIELD}>
         <label
           htmlFor={htmlFor}

[Killed] ConditionalExpression
src/ui/forms/FormField.tsx:37:13
           className={composeClassNames(
             UI_CLASS_FORM_FIELD_LABEL,
             UI_CLASS_MARGIN_RESET,
-            layout === 'horizontal' ? UI_CLASS_FORM_LABEL_HORIZONTAL : undefined
+            false ? UI_CLASS_FORM_LABEL_HORIZONTAL : undefined
           )}
         >
killedBy: Form primitives FormField renders horizontal layout with error message
statusReason: expect(element).toHaveClass("col-form-label")

Expected the element to have class:
  col-form-label
Received:
  form-label fw-semibold mb-1 mb-0

[Killed] EqualityOperator
src/ui/forms/FormField.tsx:37:13
           className={composeClassNames(
             UI_CLASS_FORM_FIELD_LABEL,
             UI_CLASS_MARGIN_RESET,
-            layout === 'horizontal' ? UI_CLASS_FORM_LABEL_HORIZONTAL : undefined
+            layout !== 'horizontal' ? UI_CLASS_FORM_LABEL_HORIZONTAL : undefined
           )}
         >
killedBy: Form primitives FormField renders horizontal layout with error message
statusReason: expect(element).toHaveClass("col-form-label")

Expected the element to have class:
  col-form-label
Received:
  form-label fw-semibold mb-1 mb-0
