[Killed] BlockStatement
src/ui/forms/FormRow.tsx:19:18
   permissionKey,
   permissionFallback,
   children,
-}: FormRowProps) {
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <div
-        className={composeClassNames(UI_CLASS_FORM_ROW, UI_CLASS_FORM_ROW_COLUMNS_MAP[columns], className)}
-        data-testid={testId ?? UI_TEST_ID_FORM_ROW}
-      >
-        {children}
-      </div>
-    </VisibilityGate>
-  )
-}
+}: FormRowProps) {}
 
 
killedBy: Form primitives FormRow applies responsive grid classes
statusReason: Unable to find an element by: [data-testid="row"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/ui/forms/FormRow.tsx:24:22
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <div
         className={composeClassNames(UI_CLASS_FORM_ROW, UI_CLASS_FORM_ROW_COLUMNS_MAP[columns], className)}
-        data-testid={testId ?? UI_TEST_ID_FORM_ROW}
+        data-testid={testId && UI_TEST_ID_FORM_ROW}
       >
         {children}
killedBy: Form primitives FormRow applies responsive grid classes
statusReason: Unable to find an element by: [data-testid="row"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="row g-3 row-cols-1 row-cols-md-3"
      data-testid="ui-form-row"
