[Killed] BlockStatement
src/ui/forms/FormSection.tsx:24:22
   permissionKey,
   permissionFallback,
   children,
-}: FormSectionProps) {
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <section
-        className={composeClassNames(UI_CLASS_FORM_SECTION, className)}
-        data-testid={testId ?? UI_TEST_ID_FORM_SECTION}
-      >
-        <div className={UI_CLASS_FORM_SECTION_HEADER}>
-          <div>
-            <h2 className={UI_CLASS_FORM_SECTION_TITLE}>{title}</h2>
-            {description ? <p className={composeClassNames(UI_CLASS_TEXT_MUTED, UI_CLASS_MARGIN_RESET)}>{description}</p> : null}
-          </div>
-          {actions}
-        </div>
-        <div className={UI_CLASS_FORM_SECTION_BODY}>{children}</div>
-      </section>
-    </VisibilityGate>
-  )
-}
+}: FormSectionProps) {}
 
 
killedBy: Form primitives FormSection renders title heading
statusReason: Unable to find an element by: [data-testid="section"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/ui/forms/FormSection.tsx:29:22
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <section
         className={composeClassNames(UI_CLASS_FORM_SECTION, className)}
-        data-testid={testId ?? UI_TEST_ID_FORM_SECTION}
+        data-testid={testId && UI_TEST_ID_FORM_SECTION}
       >
         <div className={UI_CLASS_FORM_SECTION_HEADER}>
killedBy: Form primitives FormSection renders title heading
statusReason: Unable to find an element by: [data-testid="section"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="mb-5"
      data-testid="ui-form-section"
