[Killed] BlockStatement
src/ui/forms/SwitchField.tsx:7:102
 import type { SwitchFieldProps } from '../types'
 import { CheckboxField } from './CheckboxField'
 
-export function SwitchField<TFieldValues extends FieldValues>(props: SwitchFieldProps<TFieldValues>) {
-  return <CheckboxField {...props} type={UI_FORM_CHECK_TYPE_SWITCH} />
-}
+export function SwitchField<TFieldValues extends FieldValues>(props: SwitchFieldProps<TFieldValues>) {}
 
 
killedBy: Form primitives SwitchField renders switch type inputs
statusReason: Unable to find a label with the text of: claustrum

Ignored nodes: comments, script, style
<body>
  <div />
</body>
