[Killed] BlockStatement
src/ui/layout/AppShell.tsx:25:19
   permissionKey,
   permissionFallback,
   children,
-}: AppShellProps) {
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <div className={composeClassNames(UI_CLASS_APP_SHELL, className)} data-testid={testId ?? UI_TEST_ID_APP_SHELL}>
-        {topBar ? <header className={UI_CLASS_APP_SHELL_HEADER}>{topBar}</header> : null}
-        <div className={UI_CLASS_APP_SHELL_BODY}>
-          {sidebar ? (
-            <aside className={composeClassNames(UI_CLASS_APP_SHELL_SIDEBAR, sidebarWidthClass)}>{sidebar}</aside>
-          ) : null}
-          <main className={UI_CLASS_APP_SHELL_CONTENT}>{children}</main>
-        </div>
-        {bottomBar ? <footer className={UI_CLASS_APP_SHELL_FOOTER}>{bottomBar}</footer> : null}
-      </div>
-    </VisibilityGate>
-  )
-}
+}: AppShellProps) {}
 
 
killedBy: Layout primitives AppShell renders the provided content region
statusReason: Unable to find an element with the text: custodia terreo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/ui/layout/AppShell.tsx:28:86
 }: AppShellProps) {
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <div className={composeClassNames(UI_CLASS_APP_SHELL, className)} data-testid={testId ?? UI_TEST_ID_APP_SHELL}>
+      <div className={composeClassNames(UI_CLASS_APP_SHELL, className)} data-testid={testId && UI_TEST_ID_APP_SHELL}>
         {topBar ? <header className={UI_CLASS_APP_SHELL_HEADER}>{topBar}</header> : null}
         <div className={UI_CLASS_APP_SHELL_BODY}>
killedBy: Layout primitives AppShell attaches default test id to root element
statusReason: Unable to find an element by: [data-testid="ui-app-shell"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="min-vh-100 d-flex flex-column bg-body-tertiary"
    >
