[Killed] BlockStatement
src/ui/layout/Page.tsx:23:15
   permissionKey,
   permissionFallback,
   children,
-}: PageProps) {
-  const variantClass = variant === UI_PAGE_VARIANT_FULL_WIDTH ? UI_CLASS_PAGE_FULL_WIDTH : UI_CLASS_PAGE_CONSTRAINED
-  const heightClass = fullHeight ? UI_CLASS_PAGE_FULL_HEIGHT : undefined
-
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <section
-        className={composeClassNames(UI_CLASS_PAGE_BASE, variantClass, heightClass, className)}
-        data-testid={testId ?? UI_TEST_ID_PAGE}
-      >
-        {children}
-      </section>
-    </VisibilityGate>
-  )
-}
+}: PageProps) {}
 
 
killedBy: Layout primitives Page uses constrained container by default
statusReason: Unable to find an element by: [data-testid="ui-page"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/ui/layout/Page.tsx:24:24
   permissionFallback,
   children,
 }: PageProps) {
-  const variantClass = variant === UI_PAGE_VARIANT_FULL_WIDTH ? UI_CLASS_PAGE_FULL_WIDTH : UI_CLASS_PAGE_CONSTRAINED
+  const variantClass = true ? UI_CLASS_PAGE_FULL_WIDTH : UI_CLASS_PAGE_CONSTRAINED
   const heightClass = fullHeight ? UI_CLASS_PAGE_FULL_HEIGHT : undefined
 
killedBy: Layout primitives Page uses constrained container by default
statusReason: expect(element).toHaveClass("container")

Expected the element to have class:
  container
Received:
  py-4 container-fluid

[Killed] EqualityOperator
src/ui/layout/Page.tsx:24:24
   permissionFallback,
   children,
 }: PageProps) {
-  const variantClass = variant === UI_PAGE_VARIANT_FULL_WIDTH ? UI_CLASS_PAGE_FULL_WIDTH : UI_CLASS_PAGE_CONSTRAINED
+  const variantClass = variant !== UI_PAGE_VARIANT_FULL_WIDTH ? UI_CLASS_PAGE_FULL_WIDTH : UI_CLASS_PAGE_CONSTRAINED
   const heightClass = fullHeight ? UI_CLASS_PAGE_FULL_HEIGHT : undefined
 
killedBy: Layout primitives Page uses constrained container by default
statusReason: expect(element).toHaveClass("container")

Expected the element to have class:
  container
Received:
  py-4 container-fluid

[Killed] LogicalOperator
src/ui/layout/Page.tsx:31:22
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <section
         className={composeClassNames(UI_CLASS_PAGE_BASE, variantClass, heightClass, className)}
-        data-testid={testId ?? UI_TEST_ID_PAGE}
+        data-testid={testId && UI_TEST_ID_PAGE}
       >
         {children}
killedBy: Layout primitives Page uses constrained container by default
statusReason: Unable to find an element by: [data-testid="ui-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="py-4 container"
    >
