[Killed] BlockStatement
src/ui/layout/PageHeader.tsx:26:21
   ability,
   permissionKey,
   permissionFallback,
-}: PageHeaderProps) {
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <header
-        className={composeClassNames(UI_CLASS_PAGE_HEADER, className)}
-        data-testid={testId ?? UI_TEST_ID_PAGE_HEADER}
-      >
-        <div className={UI_CLASS_PAGE_HEADER_CONTENT}>
-          {breadcrumbs}
-          {eyebrow ? <span className={UI_CLASS_HEADING_EYEBROW}>{eyebrow}</span> : null}
-          <div className="d-flex flex-column gap-1">
-            <h1 className={composeClassNames(UI_CLASS_HEADING_TITLE, UI_CLASS_MARGIN_RESET)}>{title}</h1>
-            {subtitle ? (
-              <p className={composeClassNames(UI_CLASS_MUTED_TEXT, UI_CLASS_MARGIN_RESET)}>{subtitle}</p>
-            ) : null}
-          </div>
-        </div>
-        {actions ? <div className={UI_CLASS_PAGE_HEADER_ACTIONS}>{actions}</div> : null}
-      </header>
-    </VisibilityGate>
-  )
-}
+}: PageHeaderProps) {}
 
 
killedBy: Layout primitives PageHeader renders title content
statusReason: Unable to find an element with the text: arbitro traho ubi. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/ui/layout/PageHeader.tsx:31:22
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <header
         className={composeClassNames(UI_CLASS_PAGE_HEADER, className)}
-        data-testid={testId ?? UI_TEST_ID_PAGE_HEADER}
+        data-testid={testId && UI_TEST_ID_PAGE_HEADER}
       >
         <div className={UI_CLASS_PAGE_HEADER_CONTENT}>
killedBy: Layout primitives PageHeader exposes default test id
statusReason: Unable to find an element by: [data-testid="ui-page-header"]

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="d-flex flex-wrap align-items-center justify-content-between gap-3"
    >
