[Killed] BlockStatement
src/ui/layout/SidebarLayout.tsx:22:24
   permissionKey,
   permissionFallback,
   children,
-}: SidebarLayoutProps) {
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <section className={composeClassNames(UI_CLASS_SIDEBAR_LAYOUT, className)} data-testid={testId ?? UI_TEST_ID_SIDEBAR_LAYOUT}>
-        <aside
-          className={composeClassNames(
-            UI_CLASS_SIDEBAR_LAYOUT_SIDEBAR,
-            sidebarWidthClass,
-            stickySidebar ? UI_CLASS_SIDEBAR_STICKY : undefined
-          )}
-        >
-          {sidebar}
-        </aside>
-        <div className={UI_CLASS_SIDEBAR_LAYOUT_CONTENT}>{children}</div>
-      </section>
-    </VisibilityGate>
-  )
-}
+}: SidebarLayoutProps) {}
 
 
killedBy: Layout primitives SidebarLayout renders sidebar section
statusReason: Unable to find an element with the text: curo undique. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/ui/layout/SidebarLayout.tsx:25:95
 }: SidebarLayoutProps) {
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <section className={composeClassNames(UI_CLASS_SIDEBAR_LAYOUT, className)} data-testid={testId ?? UI_TEST_ID_SIDEBAR_LAYOUT}>
+      <section className={composeClassNames(UI_CLASS_SIDEBAR_LAYOUT, className)} data-testid={testId && UI_TEST_ID_SIDEBAR_LAYOUT}>
         <aside
           className={composeClassNames(
killedBy: Layout primitives SidebarLayout root exposes layout classes
statusReason: Unable to find an element by: [data-testid="ui-sidebar-layout"]

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="d-flex w-100"
    >
