[Killed] BlockStatement
src/ui/layout/Stack.tsx:31:16
   permissionKey,
   permissionFallback,
   children,
-}: StackProps) {
-  const Element = (as ?? 'div') as keyof JSX.IntrinsicElements
-
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <Element
-        className={composeClassNames(
-          UI_CLASS_STACK_BASE,
-          UI_CLASS_STACK_DIRECTION_MAP[direction],
-          UI_CLASS_STACK_GAP_MAP[gap],
-          align ? UI_CLASS_STACK_ALIGN_MAP[align] : undefined,
-          justify ? UI_CLASS_STACK_JUSTIFY_MAP[justify] : undefined,
-          wrap ? UI_CLASS_STACK_WRAP : undefined,
-          className
-        )}
-        data-testid={testId ?? UI_TEST_ID_STACK}
-      >
-        {children}
-      </Element>
-    </VisibilityGate>
-  )
-}
+}: StackProps) {}
 
 
killedBy: Layout primitives Stack composes direction and gap classes
statusReason: Unable to find an element by: [data-testid="ui-stack"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/ui/layout/Stack.tsx:46:22
           wrap ? UI_CLASS_STACK_WRAP : undefined,
           className
         )}
-        data-testid={testId ?? UI_TEST_ID_STACK}
+        data-testid={testId && UI_TEST_ID_STACK}
       >
         {children}
killedBy: Layout primitives Stack composes direction and gap classes
statusReason: Unable to find an element by: [data-testid="ui-stack"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex w-100 flex-column gap-3"
    >
