[Killed] ArrowFunction
src/ui/navigation/SidebarNav.tsx:23:24
   permissionKey,
   permissionFallback,
 }: SidebarNavProps) {
-  const handleSelect = (item: UiSidebarNavItem) => (event: MouseEvent<HTMLAnchorElement>) => {
-    if (item.href) {
-      event.preventDefault()
-    }
-    item.onClick?.()
-    onSelect?.(item)
-  }
+  const handleSelect = () => undefined
 
   return (
killedBy: Navigation primitives SidebarNav triggers onSelect and highlights active entries
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Number of calls: 0

[Killed] BlockStatement
src/ui/navigation/SidebarNav.tsx:23:94
   permissionKey,
   permissionFallback,
 }: SidebarNavProps) {
-  const handleSelect = (item: UiSidebarNavItem) => (event: MouseEvent<HTMLAnchorElement>) => {
-    if (item.href) {
-      event.preventDefault()
-    }
-    item.onClick?.()
-    onSelect?.(item)
-  }
+  const handleSelect = (item: UiSidebarNavItem) => (event: MouseEvent<HTMLAnchorElement>) => {}
 
   return (
killedBy: Navigation primitives SidebarNav triggers onSelect and highlights active entries
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Number of calls: 0

[Survived] BlockStatement
src/ui/navigation/SidebarNav.tsx:24:20
   permissionFallback,
 }: SidebarNavProps) {
   const handleSelect = (item: UiSidebarNavItem) => (event: MouseEvent<HTMLAnchorElement>) => {
-    if (item.href) {
-      event.preventDefault()
-    }
+    if (item.href) {}
     item.onClick?.()
     onSelect?.(item)

[Survived] ConditionalExpression
src/ui/navigation/SidebarNav.tsx:24:9
   permissionFallback,
 }: SidebarNavProps) {
   const handleSelect = (item: UiSidebarNavItem) => (event: MouseEvent<HTMLAnchorElement>) => {
-    if (item.href) {
+    if (false) {
       event.preventDefault()
     }

[Killed] OptionalChaining
src/ui/navigation/SidebarNav.tsx:27:5
     if (item.href) {
       event.preventDefault()
     }
-    item.onClick?.()
+    item.onClick()
     onSelect?.(item)
   }
killedBy: Navigation primitives SidebarNav triggers onSelect and highlights active entries
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Number of calls: 0

[Killed] LogicalOperator
src/ui/navigation/SidebarNav.tsx:33:88
 
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <nav className={composeClassNames(UI_CLASS_SIDEBAR_NAV, className)} data-testid={testId ?? UI_TEST_ID_SIDEBAR_NAV}>
+      <nav className={composeClassNames(UI_CLASS_SIDEBAR_NAV, className)} data-testid={testId && UI_TEST_ID_SIDEBAR_NAV}>
         {items.map((item) => (
           <VisibilityGate
killedBy: Navigation primitives SidebarNav renders navigation links
statusReason: Unable to find an element by: [data-testid="ui-sidebar-nav"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="nav flex-column gap-1"
    >

[Killed] ArrowFunction
src/ui/navigation/SidebarNav.tsx:34:20
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <nav className={composeClassNames(UI_CLASS_SIDEBAR_NAV, className)} data-testid={testId ?? UI_TEST_ID_SIDEBAR_NAV}>
-        {items.map((item) => (
-          <VisibilityGate
-            key={item.id}
-            ability={item.ability}
-            permissionKey={item.permissionKey}
-            permissionFallback={item.permissionFallback}
-          >
-            <a
-              href={item.href ?? '#'}
-              className={composeClassNames(
-                UI_CLASS_SIDEBAR_NAV_LINK,
-                UI_CLASS_INLINE_GAP,
-                item.active ? UI_CLASS_SIDEBAR_NAV_ACTIVE : undefined
-              )}
-              onClick={handleSelect(item)}
-            >
-              {item.icon}
-              <span>{item.label}</span>
-              {item.badge}
-            </a>
-          </VisibilityGate>
-        ))}
+        {items.map(() => undefined)}
       </nav>
     </VisibilityGate>
killedBy: Navigation primitives SidebarNav triggers onSelect and highlights active entries
statusReason: Unable to find an element with the text: inactive. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="nav flex-column gap-1"
      data-testid="ui-sidebar-nav"

[Survived] LogicalOperator
src/ui/navigation/SidebarNav.tsx:42:21
             permissionFallback={item.permissionFallback}
           >
             <a
-              href={item.href ?? '#'}
+              href={item.href && '#'}
               className={composeClassNames(
                 UI_CLASS_SIDEBAR_NAV_LINK,
