[Killed] BlockStatement
src/ui/navigation/TopNavBar.tsx:20:20
   ability,
   permissionKey,
   permissionFallback,
-}: TopNavBarProps) {
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <header className={composeClassNames(UI_CLASS_TOP_NAV, className)} data-testid={testId ?? UI_TEST_ID_TOP_NAV}>
-        <div className={UI_CLASS_TOP_NAV_CONTENT}>
-          <div className={UI_CLASS_INLINE_GAP}>
-            {brand ? <strong>{brand}</strong> : null}
-            {navigation}
-          </div>
-          <div className={UI_CLASS_INLINE_GAP}>{actions}</div>
-        </div>
-      </header>
-    </VisibilityGate>
-  )
-}
+}: TopNavBarProps) {}
 
 
killedBy: Navigation primitives TopNavBar applies nav styling
statusReason: Unable to find an element by: [data-testid="ui-top-nav"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/ui/navigation/TopNavBar.tsx:23:87
 }: TopNavBarProps) {
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <header className={composeClassNames(UI_CLASS_TOP_NAV, className)} data-testid={testId ?? UI_TEST_ID_TOP_NAV}>
+      <header className={composeClassNames(UI_CLASS_TOP_NAV, className)} data-testid={testId && UI_TEST_ID_TOP_NAV}>
         <div className={UI_CLASS_TOP_NAV_CONTENT}>
           <div className={UI_CLASS_INLINE_GAP}>
killedBy: Navigation primitives TopNavBar applies nav styling
statusReason: Unable to find an element by: [data-testid="ui-top-nav"]

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="navbar bg-body border-bottom shadow-sm"
    >
