[Survived] BooleanLiteral
src/ui/overlay/ModalDialog.tsx:23:14
   primaryAction,
   secondaryAction,
   size = UI_MODAL_SIZE_LG,
-  backdrop = true,
+  backdrop = false,
   centered,
   scrollable,

[Killed] BlockStatement
src/ui/overlay/ModalDialog.tsx:32:77
   permissionKey,
   permissionFallback,
 }: ModalDialogProps) {
-  const renderActionButton = (action: ModalDialogProps['primaryAction']) => {
-    if (!action) {
-      return null
-    }
-    return (
-      <Button
-        variant={action.variant ?? UI_BUTTON_VARIANT_PRIMARY}
-        onClick={action.onClick}
-        disabled={action.disabled}
-        data-testid={action.testId}
-      >
-        {action.label}
-      </Button>
-    )
-  }
+  const renderActionButton = (action: ModalDialogProps['primaryAction']) => {}
 
   return (
killedBy: Overlay primitives ModalDialog renders action buttons when footer omitted
statusReason: Unable to find an element with the text: Confirm. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] BooleanLiteral
src/ui/overlay/ModalDialog.tsx:33:9
   permissionFallback,
 }: ModalDialogProps) {
   const renderActionButton = (action: ModalDialogProps['primaryAction']) => {
-    if (!action) {
+    if (action) {
       return null
     }
killedBy: Overlay primitives ModalDialog renders when show flag is true
statusReason: Cannot read properties of undefined (reading 'variant')

[Killed] BlockStatement
src/ui/overlay/ModalDialog.tsx:33:18
   permissionFallback,
 }: ModalDialogProps) {
   const renderActionButton = (action: ModalDialogProps['primaryAction']) => {
-    if (!action) {
-      return null
-    }
+    if (!action) {}
     return (
       <Button
killedBy: Overlay primitives ModalDialog renders when show flag is true
statusReason: Cannot read properties of undefined (reading 'variant')

[Survived] LogicalOperator
src/ui/overlay/ModalDialog.tsx:38:18
     }
     return (
       <Button
-        variant={action.variant ?? UI_BUTTON_VARIANT_PRIMARY}
+        variant={action.variant && UI_BUTTON_VARIANT_PRIMARY}
         onClick={action.onClick}
         disabled={action.disabled}

[Killed] LogicalOperator
src/ui/overlay/ModalDialog.tsx:58:22
         centered={centered}
         scrollable={scrollable}
         contentClassName={className}
-        data-testid={testId ?? UI_TEST_ID_MODAL_DIALOG}
+        data-testid={testId && UI_TEST_ID_MODAL_DIALOG}
       >
         {title ? (
killedBy: Overlay primitives ModalDialog renders when show flag is true
statusReason: Unable to find an element by: [data-testid="ui-modal-dialog"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>
