[Killed] BlockStatement
src/ui/overlay/SidePanel.tsx:26:20
   permissionKey,
   permissionFallback,
   children,
-}: SidePanelProps) {
-  if (!show) {
-    return null
-  }
-
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <aside
-        className={composeClassNames(UI_CLASS_SIDE_PANEL, placement === 'start' ? 'start-0' : 'end-0', sizeClass, className)}
-        data-testid={testId ?? UI_TEST_ID_SIDE_PANEL}
-        role="dialog"
-      >
-        <div className="d-flex justify-content-between align-items-center mb-4">
-          {title ? <h2 className="h5 mb-0">{title}</h2> : null}
-          <button type="button" className="btn-close" aria-label="Close side panel" onClick={onClose} />
-        </div>
-        <div className={UI_CLASS_SIDE_PANEL_BODY}>{children}</div>
-        {actions ? <div className={UI_CLASS_SIDE_PANEL_ACTIONS}>{actions}</div> : null}
-        {footer ? <div className="border-top mt-4 pt-3">{footer}</div> : null}
-      </aside>
-    </VisibilityGate>
-  )
-}
+}: SidePanelProps) {}
 
 
killedBy: Overlay primitives SidePanel renders title content
statusReason: Unable to find an element with the text: facilis eum. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/ui/overlay/SidePanel.tsx:27:14
   permissionFallback,
   children,
 }: SidePanelProps) {
-  if (!show) {
-    return null
-  }
+  if (!show) {}
 
   return (
killedBy: Overlay primitives SidePanel returns null when not shown and defaults to end placement
statusReason: expected <aside …(3)>…(2)</aside> to be null

[Killed] ConditionalExpression
src/ui/overlay/SidePanel.tsx:27:7
   permissionFallback,
   children,
 }: SidePanelProps) {
-  if (!show) {
+  if (true) {
     return null
   }
killedBy: Overlay primitives SidePanel renders title content
statusReason: Unable to find an element with the text: curso comparo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] EqualityOperator
src/ui/overlay/SidePanel.tsx:34:59
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <aside
-        className={composeClassNames(UI_CLASS_SIDE_PANEL, placement === 'start' ? 'start-0' : 'end-0', sizeClass, className)}
+        className={composeClassNames(UI_CLASS_SIDE_PANEL, placement !== 'start' ? 'start-0' : 'end-0', sizeClass, className)}
         data-testid={testId ?? UI_TEST_ID_SIDE_PANEL}
         role="dialog"
killedBy: Overlay primitives SidePanel renders actions, footer, and supports placement variants
statusReason: expect(element).toHaveClass("start-0")

Expected the element to have class:
  start-0
Received:
  bg-body border-start shadow-lg p-4 position-fixed top-0 h-100 end-0

[Killed] ConditionalExpression
src/ui/overlay/SidePanel.tsx:34:59
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <aside
-        className={composeClassNames(UI_CLASS_SIDE_PANEL, placement === 'start' ? 'start-0' : 'end-0', sizeClass, className)}
+        className={composeClassNames(UI_CLASS_SIDE_PANEL, true ? 'start-0' : 'end-0', sizeClass, className)}
         data-testid={testId ?? UI_TEST_ID_SIDE_PANEL}
         role="dialog"
killedBy: Overlay primitives SidePanel returns null when not shown and defaults to end placement
statusReason: expect(element).toHaveClass("end-0")

Expected the element to have class:
  end-0
Received:
  bg-body border-start shadow-lg p-4 position-fixed top-0 h-100 start-0 w-50

[Killed] LogicalOperator
src/ui/overlay/SidePanel.tsx:35:22
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <aside
         className={composeClassNames(UI_CLASS_SIDE_PANEL, placement === 'start' ? 'start-0' : 'end-0', sizeClass, className)}
-        data-testid={testId ?? UI_TEST_ID_SIDE_PANEL}
+        data-testid={testId && UI_TEST_ID_SIDE_PANEL}
         role="dialog"
       >
killedBy: Overlay primitives SidePanel renders actions, footer, and supports placement variants
statusReason: Unable to find an element by: [data-testid="ui-side-panel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <aside
      class="bg-body border-start shadow-lg p-4 position-fixed top-0 h-100 start-0"
      role="dialog"
