[Killed] BlockStatement
src/ui/typography/BadgeText.tsx:23:20
   ability,
   permissionKey,
   permissionFallback,
-}: BadgeTextProps) {
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <Badge
-        bg={variant}
-        pill={pill}
-        className={composeClassNames(UI_CLASS_BADGE_TEXT, UI_CLASS_INLINE_GAP, className)}
-        data-testid={testId ?? UI_TEST_ID_BADGE_TEXT}
-      >
-        {icon}
-        <span>{text}</span>
-      </Badge>
-    </VisibilityGate>
-  )
-}
+}: BadgeTextProps) {}
 
 
killedBy: Typography primitives BadgeText renders with variant classes
statusReason: Unable to find an element by: [data-testid="ui-badge-text"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/ui/typography/BadgeText.tsx:30:22
         bg={variant}
         pill={pill}
         className={composeClassNames(UI_CLASS_BADGE_TEXT, UI_CLASS_INLINE_GAP, className)}
-        data-testid={testId ?? UI_TEST_ID_BADGE_TEXT}
+        data-testid={testId && UI_TEST_ID_BADGE_TEXT}
       >
         {icon}
killedBy: Typography primitives BadgeText renders with variant classes
statusReason: Unable to find an element by: [data-testid="ui-badge-text"]

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      class="d-inline-flex align-items-center gap-1 d-flex gap-2 badge bg-success"
    >
