[Killed] BlockStatement
src/ui/typography/BodyText.tsx:21:19
   permissionKey,
   permissionFallback,
   children,
-}: BodyTextProps) {
-  const Element = (as ?? 'p') as keyof JSX.IntrinsicElements
-
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <Element
-        className={composeClassNames(UI_CLASS_BODY_TEXT, lead ? UI_CLASS_BODY_TEXT_LEAD : undefined, className)}
-        data-testid={testId ?? UI_TEST_ID_BODY_TEXT}
-      >
-        {children}
-      </Element>
-    </VisibilityGate>
-  )
-}
+}: BodyTextProps) {}
 
 
killedBy: Typography primitives BodyText applies base typography class
statusReason: Unable to find an element with the text: eveniet sunt. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] LogicalOperator
src/ui/typography/BodyText.tsx:28:22
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <Element
         className={composeClassNames(UI_CLASS_BODY_TEXT, lead ? UI_CLASS_BODY_TEXT_LEAD : undefined, className)}
-        data-testid={testId ?? UI_TEST_ID_BODY_TEXT}
+        data-testid={testId && UI_TEST_ID_BODY_TEXT}
       >
         {children}
