[Killed] BlockStatement
src/ui/typography/EmptyState.tsx:23:21
   ability,
   permissionKey,
   permissionFallback,
-}: EmptyStateProps) {
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <div className={composeClassNames(UI_CLASS_EMPTY_STATE, className)} data-testid={testId ?? UI_TEST_ID_EMPTY_STATE}>
-        {icon ? <div className={UI_CLASS_EMPTY_STATE_ICON}>{icon}</div> : null}
-        <h3 className={UI_CLASS_MARGIN_RESET}>{title}</h3>
-        {body ? <p className={UI_CLASS_TEXT_MUTED}>{body}</p> : null}
-        {actions ? <div className={UI_CLASS_EMPTY_STATE_ACTIONS}>{actions}</div> : null}
-      </div>
-    </VisibilityGate>
-  )
-}
+}: EmptyStateProps) {}
 
 
killedBy: Typography primitives EmptyState applies wrapper styling
statusReason: Unable to find an element by: [data-testid="ui-empty-state"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/ui/typography/EmptyState.tsx:26:88
 }: EmptyStateProps) {
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <div className={composeClassNames(UI_CLASS_EMPTY_STATE, className)} data-testid={testId ?? UI_TEST_ID_EMPTY_STATE}>
+      <div className={composeClassNames(UI_CLASS_EMPTY_STATE, className)} data-testid={testId && UI_TEST_ID_EMPTY_STATE}>
         {icon ? <div className={UI_CLASS_EMPTY_STATE_ICON}>{icon}</div> : null}
         <h3 className={UI_CLASS_MARGIN_RESET}>{title}</h3>
killedBy: Typography primitives EmptyState applies wrapper styling
statusReason: Unable to find an element by: [data-testid="ui-empty-state"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="text-center p-5 border border-dashed rounded-3 bg-body-tertiary"
    >
