[Killed] BlockStatement
src/ui/typography/Heading.tsx:28:18
   permissionKey,
   permissionFallback,
   children,
-}: HeadingProps) {
-  const clampedLevel = Math.min(Math.max(level, 1), 6)
-  const HeadingTag = `h${clampedLevel}` as keyof JSX.IntrinsicElements
-
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <div
-        className={composeClassNames(UI_CLASS_HEADING, align ? UI_CLASS_TEXT_ALIGN_MAP[align] : undefined, className)}
-        data-testid={testId ?? UI_TEST_ID_HEADING}
-      >
-        {eyebrow ? <span className={UI_CLASS_HEADING_EYEBROW}>{eyebrow}</span> : null}
-        <div className={UI_CLASS_INLINE_GAP}>
-          <HeadingTag className={composeClassNames(UI_CLASS_HEADING_TITLE, UI_CLASS_MARGIN_RESET)}>{children}</HeadingTag>
-          {badge ? <span className={UI_CLASS_HEADING_BADGE}>{badge}</span> : null}
-        </div>
-      </div>
-    </VisibilityGate>
-  )
-}
+}: HeadingProps) {}
 
 
killedBy: Typography primitives Heading renders as requested level
statusReason: expected undefined to be 'commodo tepesco' // Object.is equality

[Killed] MethodExpression
src/ui/typography/Heading.tsx:29:33
   permissionFallback,
   children,
 }: HeadingProps) {
-  const clampedLevel = Math.min(Math.max(level, 1), 6)
+  const clampedLevel = Math.min(Math.min(level, 1), 6)
   const HeadingTag = `h${clampedLevel}` as keyof JSX.IntrinsicElements
 
killedBy: Typography primitives Heading renders as requested level
statusReason: expected undefined to be 'beatae perspiciatis' // Object.is equality

[Killed] MethodExpression
src/ui/typography/Heading.tsx:29:24
   permissionFallback,
   children,
 }: HeadingProps) {
-  const clampedLevel = Math.min(Math.max(level, 1), 6)
+  const clampedLevel = Math.max(Math.max(level, 1), 6)
   const HeadingTag = `h${clampedLevel}` as keyof JSX.IntrinsicElements
 
killedBy: Typography primitives Heading renders as requested level
statusReason: expected undefined to be 'crur aperte' // Object.is equality

[Survived] LogicalOperator
src/ui/typography/Heading.tsx:36:22
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <div
         className={composeClassNames(UI_CLASS_HEADING, align ? UI_CLASS_TEXT_ALIGN_MAP[align] : undefined, className)}
-        data-testid={testId ?? UI_TEST_ID_HEADING}
+        data-testid={testId && UI_TEST_ID_HEADING}
       >
         {eyebrow ? <span className={UI_CLASS_HEADING_EYEBROW}>{eyebrow}</span> : null}
