[Killed] BlockStatement
src/ui/typography/KeyValueList.tsx:21:23
   ability,
   permissionKey,
   permissionFallback,
-}: KeyValueListProps) {
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <div className={composeClassNames(UI_CLASS_KEY_VALUE_LIST, className)} data-testid={testId ?? UI_TEST_ID_KEY_VALUE_LIST}>
-        {items.map((item) => (
-          <div key={item.id} className={UI_CLASS_KEY_VALUE_ITEM} data-testid={UI_TEST_ID_KEY_VALUE_ITEM}>
-            <span className={UI_CLASS_KEY_VALUE_LABEL}>{item.label}</span>
-            <span className={composeClassNames(UI_CLASS_KEY_VALUE_VALUE, item.emphasize ? UI_CLASS_TEXT_EMPHASIS : undefined)}>
-              {item.value}
-            </span>
-          </div>
-        ))}
-      </div>
-    </VisibilityGate>
-  )
-}
+}: KeyValueListProps) {}
 
 
killedBy: Typography primitives KeyValueList renders provided items
statusReason: Unable to find an element by: [data-testid="ui-key-value-item"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] LogicalOperator
src/ui/typography/KeyValueList.tsx:24:91
 }: KeyValueListProps) {
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <div className={composeClassNames(UI_CLASS_KEY_VALUE_LIST, className)} data-testid={testId ?? UI_TEST_ID_KEY_VALUE_LIST}>
+      <div className={composeClassNames(UI_CLASS_KEY_VALUE_LIST, className)} data-testid={testId && UI_TEST_ID_KEY_VALUE_LIST}>
         {items.map((item) => (
           <div key={item.id} className={UI_CLASS_KEY_VALUE_ITEM} data-testid={UI_TEST_ID_KEY_VALUE_ITEM}>

[Killed] ArrowFunction
src/ui/typography/KeyValueList.tsx:25:20
   return (
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <div className={composeClassNames(UI_CLASS_KEY_VALUE_LIST, className)} data-testid={testId ?? UI_TEST_ID_KEY_VALUE_LIST}>
-        {items.map((item) => (
-          <div key={item.id} className={UI_CLASS_KEY_VALUE_ITEM} data-testid={UI_TEST_ID_KEY_VALUE_ITEM}>
-            <span className={UI_CLASS_KEY_VALUE_LABEL}>{item.label}</span>
-            <span className={composeClassNames(UI_CLASS_KEY_VALUE_VALUE, item.emphasize ? UI_CLASS_TEXT_EMPHASIS : undefined)}>
-              {item.value}
-            </span>
-          </div>
-        ))}
+        {items.map(() => undefined)}
       </div>
     </VisibilityGate>
killedBy: Typography primitives KeyValueList renders provided items
statusReason: Unable to find an element by: [data-testid="ui-key-value-item"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="list-unstyled mb-0"
      data-testid="ui-key-value-list"
