[Killed] BlockStatement
src/ui/typography/MutedText.tsx:17:20
   permissionKey,
   permissionFallback,
   children,
-}: MutedTextProps) {
-  return (
-    <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
-      <span
-        className={composeClassNames(UI_CLASS_MUTED_TEXT, className)}
-        data-testid={testId ?? UI_TEST_ID_MUTED_TEXT}
-      >
-        {children}
-      </span>
-    </VisibilityGate>
-  )
-}
+}: MutedTextProps) {}
 
 
killedBy: Typography primitives MutedText wraps children with muted styling
statusReason: Unable to find an element with the text: sodalitas arbitro. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] LogicalOperator
src/ui/typography/MutedText.tsx:22:22
     <VisibilityGate ability={ability} permissionKey={permissionKey} permissionFallback={permissionFallback}>
       <span
         className={composeClassNames(UI_CLASS_MUTED_TEXT, className)}
-        data-testid={testId ?? UI_TEST_ID_MUTED_TEXT}
+        data-testid={testId && UI_TEST_ID_MUTED_TEXT}
       >
         {children}
