[Killed] BlockStatement
src/ui/utils/PermissionGate.tsx:14:25
   permissionKey,
   permissionFallback,
   children,
-}: VisibilityGateProps) {
-  if (permissionKey) {
-    return (
-      <IfPermission permission={permissionKey} fallback={permissionFallback}>
-        {children}
-      </IfPermission>
-    )
-  }
-
-  if (ability) {
-    return (
-      <IfCan action={ability.action} subject={ability.subject} fallback={ability.fallback} mode={ability.mode}>
-        {children}
-      </IfCan>
-    )
-  }
-
-  return <>{children}</>
-}
+}: VisibilityGateProps) {}
 
 
killedBy: Overlay primitives ModalDialog renders when show flag is true
statusReason: Unable to find an element by: [data-testid="ui-modal-dialog"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/ui/utils/PermissionGate.tsx:15:7
   permissionFallback,
   children,
 }: VisibilityGateProps) {
-  if (permissionKey) {
+  if (false) {
     return (
       <IfPermission permission={permissionKey} fallback={permissionFallback}>
killedBy: VisibilityGate renders permission fallback when permission check fails
statusReason: Unable to find an element with the text: fallback. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    should-hide
  </div>
</body>

[Killed] BlockStatement
src/ui/utils/PermissionGate.tsx:15:22
   permissionFallback,
   children,
 }: VisibilityGateProps) {
-  if (permissionKey) {
-    return (
-      <IfPermission permission={permissionKey} fallback={permissionFallback}>
-        {children}
-      </IfPermission>
-    )
-  }
+  if (permissionKey) {}
 
   if (ability) {
killedBy: VisibilityGate renders permission fallback when permission check fails
statusReason: Unable to find an element with the text: fallback. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    should-hide
  </div>
</body>

[Killed] BlockStatement
src/ui/utils/PermissionGate.tsx:23:16
     )
   }
 
-  if (ability) {
-    return (
-      <IfCan action={ability.action} subject={ability.subject} fallback={ability.fallback} mode={ability.mode}>
-        {children}
-      </IfCan>
-    )
-  }
+  if (ability) {}
 
   return <>{children}</>
killedBy: VisibilityGate uses ability fallback when ability block occurs
statusReason: Unable to find an element with the text: ability-fallback. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    hidden-child
  </div>
</body>

[Killed] ConditionalExpression
src/ui/utils/PermissionGate.tsx:23:7
     )
   }
 
-  if (ability) {
+  if (false) {
     return (
       <IfCan action={ability.action} subject={ability.subject} fallback={ability.fallback} mode={ability.mode}>
killedBy: VisibilityGate uses ability fallback when ability block occurs
statusReason: Unable to find an element with the text: ability-fallback. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    hidden-child
  </div>
</body>
