[Killed] BlockStatement
src/utils/date.ts:5:70
 
 import { DATE_FORMAT_SHORT, DATE_FORMAT_TIME } from '../app/constants'
 
-export const formatDate = (value: Date | string | number): string => {
-  const date = typeof value === 'string' || typeof value === 'number' ? new Date(value) : value
-  return format(date, DATE_FORMAT_SHORT)
-}
+export const formatDate = (value: Date | string | number): string => {}
 
 export const formatDateTime = (value: Date | string | number): string => {
killedBy: date utilities formats a date value
statusReason: expected undefined to be 'August 20th, 2024' // Object.is equality

[Survived] ConditionalExpression
src/utils/date.ts:6:16
 import { DATE_FORMAT_SHORT, DATE_FORMAT_TIME } from '../app/constants'
 
 export const formatDate = (value: Date | string | number): string => {
-  const date = typeof value === 'string' || typeof value === 'number' ? new Date(value) : value
+  const date = false ? new Date(value) : value
   return format(date, DATE_FORMAT_SHORT)
 }

[Survived] ConditionalExpression
src/utils/date.ts:6:16
 import { DATE_FORMAT_SHORT, DATE_FORMAT_TIME } from '../app/constants'
 
 export const formatDate = (value: Date | string | number): string => {
-  const date = typeof value === 'string' || typeof value === 'number' ? new Date(value) : value
+  const date = false || typeof value === 'number' ? new Date(value) : value
   return format(date, DATE_FORMAT_SHORT)
 }

[Killed] BlockStatement
src/utils/date.ts:10:74
   return format(date, DATE_FORMAT_SHORT)
 }
 
-export const formatDateTime = (value: Date | string | number): string => {
-  const date = typeof value === 'string' || typeof value === 'number' ? new Date(value) : value
-  return `${formatDate(date)} ${format(date, DATE_FORMAT_TIME)}`
-}
+export const formatDateTime = (value: Date | string | number): string => {}
 
 
killedBy: date utilities formats a date and time value
statusReason: expected undefined to be 'August 20th, 2024 6:15 AM' // Object.is equality

[Survived] EqualityOperator
src/utils/date.ts:11:16
 }
 
 export const formatDateTime = (value: Date | string | number): string => {
-  const date = typeof value === 'string' || typeof value === 'number' ? new Date(value) : value
+  const date = typeof value !== 'string' || typeof value === 'number' ? new Date(value) : value
   return `${formatDate(date)} ${format(date, DATE_FORMAT_TIME)}`
 }

[Survived] ConditionalExpression
src/utils/date.ts:11:16
 }
 
 export const formatDateTime = (value: Date | string | number): string => {
-  const date = typeof value === 'string' || typeof value === 'number' ? new Date(value) : value
+  const date = true ? new Date(value) : value
   return `${formatDate(date)} ${format(date, DATE_FORMAT_TIME)}`
 }
