[Killed] ArrowFunction
src/app/analytics/tracking.ts:11:37
   track: () => {},
 }
 
-export const createTrackingClient = (): TrackingClient => noopTrackingClient
+export const createTrackingClient = () => undefined
 
 
killedBy: router configuration renders the not found route for unknown paths
statusReason: Tracking context is unavailable
