[Killed] StringLiteral
src/app/i18n/resources.ts:35:33
     [I18N_KEY_APP_BRAND]: APP_BRAND_NAME,
     [I18N_KEY_APP_TAGLINE]: APP_BRAND_TAGLINE,
     [I18N_KEY_APP_LOADING]: 'Loading experience is initializing',
-    [I18N_KEY_APP_ERROR_TITLE]: 'We hit a snag',
+    [I18N_KEY_APP_ERROR_TITLE]: "",
     [I18N_KEY_APP_ERROR_MESSAGE]: 'An unexpected issue prevented this screen from loading.',
     [I18N_KEY_APP_ERROR_RESET]: 'Try again',
killedBy: AppProviders renders the error fallback when a child throws
statusReason: Found multiple elements with the text: 

Here are the matching elements:

Ignored nodes: comments, script, style
<body
  class="theme-light"
  data-app-theme="light"

[Survived] StringLiteral
src/app/i18n/resources.ts:44:41
     [I18N_KEY_NOT_FOUND_BODY]: 'Verify the URL or use navigation controls to continue.',
     [I18N_KEY_FORM_USERNAME_LABEL]: 'Username',
     [I18N_KEY_FORM_PASSWORD_LABEL]: 'Password',
-    [I18N_KEY_FORM_TENANT_PLACEHOLDER]: 'Select a tenant',
+    [I18N_KEY_FORM_TENANT_PLACEHOLDER]: "",
     [I18N_KEY_SESSION_WARNING_TITLE]: 'You are about to be signed out',
     [I18N_KEY_SESSION_WARNING_BODY]: 'We have not detected any activity. Move your mouse or press a key to stay signed in.',

[Killed] ObjectLiteral
src/app/i18n/resources.ts:52:33
   },
 }
 
-export const defaultResources = {
-  [APP_DEFAULT_LANGUAGE]: i18nResources,
-  [APP_SECONDARY_LANGUAGE]: i18nResources,
-}
+export const defaultResources = {}
 
 
killedBy: AppForm submits values when inputs are valid
statusReason: Unable to find a label with the text of: Username

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      novalidate=""
    >
