[Survived] ObjectLiteral
src/app/lists/listTypes.ts:36:46
   LIST_SORT_DIRECTION_DESC,
 ] as const
 
-export const DEFAULT_LIST_STATE: ListState = {
-  pagination: {
-    page: LIST_DEFAULT_PAGE,
-    pageSize: LIST_DEFAULT_PAGE_SIZE,
-  },
-  sort: null,
-  search: null,
-  filters: {},
-}
+export const DEFAULT_LIST_STATE: ListState = {}
 
 
