[Killed] ObjectLiteral
src/app/theme/constants.ts:8:56
 export const THEME_CLASS_LIGHT = 'theme-light' as const
 export const THEME_CLASS_DARK = 'theme-dark' as const
 
-export const THEME_CLASS_MAP: Record<string, string> = {
-  [APP_THEME_LIGHT]: THEME_CLASS_LIGHT,
-  [APP_THEME_DARK]: THEME_CLASS_DARK,
-}
+export const THEME_CLASS_MAP: Record<string, string> = {}
 
 export const THEME_DEFAULT_CLASS = THEME_CLASS_MAP[APP_THEME_DEFAULT]
killedBy: AppStateProvider hydrates the stored theme preference on mount
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  dark
Received:
  light
