[Survived] StringLiteral
src/ui/constants.ts:1:39
-export const UI_CLASS_ALERT_ACTIONS = 'd-flex gap-2 mt-3'
+export const UI_CLASS_ALERT_ACTIONS = ""
 export const UI_NAMESPACE = 'ui' as const
 export const UI_TEST_ID_PREFIX = `${UI_NAMESPACE}-` as const

[Survived] StringLiteral
src/ui/constants.ts:92:39
 
 export const UI_TEST_ID_APP_SHELL = `${UI_TEST_ID_PREFIX}app-shell`
 export const UI_TEST_ID_PAGE = `${UI_TEST_ID_PREFIX}page`
-export const UI_TEST_ID_PAGE_HEADER = `${UI_TEST_ID_PREFIX}page-header`
+export const UI_TEST_ID_PAGE_HEADER = ``
 export const UI_TEST_ID_STACK = `${UI_TEST_ID_PREFIX}stack`
 export const UI_TEST_ID_SIDEBAR_LAYOUT = `${UI_TEST_ID_PREFIX}sidebar-layout`

[Survived] StringLiteral
src/ui/constants.ts:93:33
 export const UI_TEST_ID_APP_SHELL = `${UI_TEST_ID_PREFIX}app-shell`
 export const UI_TEST_ID_PAGE = `${UI_TEST_ID_PREFIX}page`
 export const UI_TEST_ID_PAGE_HEADER = `${UI_TEST_ID_PREFIX}page-header`
-export const UI_TEST_ID_STACK = `${UI_TEST_ID_PREFIX}stack`
+export const UI_TEST_ID_STACK = ``
 export const UI_TEST_ID_SIDEBAR_LAYOUT = `${UI_TEST_ID_PREFIX}sidebar-layout`
 export const UI_TEST_ID_HEADING = `${UI_TEST_ID_PREFIX}heading`

[Survived] StringLiteral
src/ui/constants.ts:95:35
 export const UI_TEST_ID_PAGE_HEADER = `${UI_TEST_ID_PREFIX}page-header`
 export const UI_TEST_ID_STACK = `${UI_TEST_ID_PREFIX}stack`
 export const UI_TEST_ID_SIDEBAR_LAYOUT = `${UI_TEST_ID_PREFIX}sidebar-layout`
-export const UI_TEST_ID_HEADING = `${UI_TEST_ID_PREFIX}heading`
+export const UI_TEST_ID_HEADING = ``
 export const UI_TEST_ID_BODY_TEXT = `${UI_TEST_ID_PREFIX}body-text`
 export const UI_TEST_ID_MUTED_TEXT = `${UI_TEST_ID_PREFIX}muted-text`

[Survived] StringLiteral
src/ui/constants.ts:96:37
 export const UI_TEST_ID_STACK = `${UI_TEST_ID_PREFIX}stack`
 export const UI_TEST_ID_SIDEBAR_LAYOUT = `${UI_TEST_ID_PREFIX}sidebar-layout`
 export const UI_TEST_ID_HEADING = `${UI_TEST_ID_PREFIX}heading`
-export const UI_TEST_ID_BODY_TEXT = `${UI_TEST_ID_PREFIX}body-text`
+export const UI_TEST_ID_BODY_TEXT = ``
 export const UI_TEST_ID_MUTED_TEXT = `${UI_TEST_ID_PREFIX}muted-text`
 export const UI_TEST_ID_BADGE_TEXT = `${UI_TEST_ID_PREFIX}badge-text`

[Survived] StringLiteral
src/ui/constants.ts:99:42
 export const UI_TEST_ID_BODY_TEXT = `${UI_TEST_ID_PREFIX}body-text`
 export const UI_TEST_ID_MUTED_TEXT = `${UI_TEST_ID_PREFIX}muted-text`
 export const UI_TEST_ID_BADGE_TEXT = `${UI_TEST_ID_PREFIX}badge-text`
-export const UI_TEST_ID_KEY_VALUE_LIST = `${UI_TEST_ID_PREFIX}key-value-list`
+export const UI_TEST_ID_KEY_VALUE_LIST = ``
 export const UI_TEST_ID_KEY_VALUE_ITEM = `${UI_TEST_ID_PREFIX}key-value-item`
 export const UI_TEST_ID_EMPTY_STATE = `${UI_TEST_ID_PREFIX}empty-state`

[Survived] StringLiteral
src/ui/constants.ts:105:38
 export const UI_TEST_ID_FORM_FIELD = `${UI_TEST_ID_PREFIX}form-field`
 export const UI_TEST_ID_FORM_ROW = `${UI_TEST_ID_PREFIX}form-row`
 export const UI_TEST_ID_FORM_SECTION = `${UI_TEST_ID_PREFIX}form-section`
-export const UI_TEST_ID_DATA_TABLE = `${UI_TEST_ID_PREFIX}data-table`
+export const UI_TEST_ID_DATA_TABLE = ``
 export const UI_TEST_ID_TABLE_TOOLBAR = `${UI_TEST_ID_PREFIX}table-toolbar`
 export const UI_TEST_ID_SUMMARY_LIST = `${UI_TEST_ID_PREFIX}summary-list`

[Survived] StringLiteral
src/ui/constants.ts:107:40
 export const UI_TEST_ID_FORM_SECTION = `${UI_TEST_ID_PREFIX}form-section`
 export const UI_TEST_ID_DATA_TABLE = `${UI_TEST_ID_PREFIX}data-table`
 export const UI_TEST_ID_TABLE_TOOLBAR = `${UI_TEST_ID_PREFIX}table-toolbar`
-export const UI_TEST_ID_SUMMARY_LIST = `${UI_TEST_ID_PREFIX}summary-list`
+export const UI_TEST_ID_SUMMARY_LIST = ``
 export const UI_TEST_ID_CARD_LIST = `${UI_TEST_ID_PREFIX}card-list`
 export const UI_TEST_ID_TAG_LIST = `${UI_TEST_ID_PREFIX}tag-list`

[Survived] StringLiteral
src/ui/constants.ts:112:35
 export const UI_TEST_ID_TAG_LIST = `${UI_TEST_ID_PREFIX}tag-list`
 export const UI_TEST_ID_CHIP = `${UI_TEST_ID_PREFIX}chip`
 export const UI_TEST_ID_SIDEBAR_NAV = `${UI_TEST_ID_PREFIX}sidebar-nav`
-export const UI_TEST_ID_TOP_NAV = `${UI_TEST_ID_PREFIX}top-nav`
+export const UI_TEST_ID_TOP_NAV = ``
 export const UI_TEST_ID_BREADCRUMBS = `${UI_TEST_ID_PREFIX}breadcrumbs`
 export const UI_TEST_ID_INLINE_ALERT = `${UI_TEST_ID_PREFIX}inline-alert`

[Survived] StringLiteral
src/ui/constants.ts:114:40
 export const UI_TEST_ID_SIDEBAR_NAV = `${UI_TEST_ID_PREFIX}sidebar-nav`
 export const UI_TEST_ID_TOP_NAV = `${UI_TEST_ID_PREFIX}top-nav`
 export const UI_TEST_ID_BREADCRUMBS = `${UI_TEST_ID_PREFIX}breadcrumbs`
-export const UI_TEST_ID_INLINE_ALERT = `${UI_TEST_ID_PREFIX}inline-alert`
+export const UI_TEST_ID_INLINE_ALERT = ``
 export const UI_TEST_ID_SECTION_STATUS = `${UI_TEST_ID_PREFIX}section-status`
 export const UI_TEST_ID_MODAL_DIALOG = `${UI_TEST_ID_PREFIX}modal-dialog`

[Survived] StringLiteral
src/ui/constants.ts:116:40
 export const UI_TEST_ID_BREADCRUMBS = `${UI_TEST_ID_PREFIX}breadcrumbs`
 export const UI_TEST_ID_INLINE_ALERT = `${UI_TEST_ID_PREFIX}inline-alert`
 export const UI_TEST_ID_SECTION_STATUS = `${UI_TEST_ID_PREFIX}section-status`
-export const UI_TEST_ID_MODAL_DIALOG = `${UI_TEST_ID_PREFIX}modal-dialog`
+export const UI_TEST_ID_MODAL_DIALOG = ``
 export const UI_TEST_ID_SIDE_PANEL = `${UI_TEST_ID_PREFIX}side-panel`
 

[Survived] StringLiteral
src/ui/constants.ts:117:38
 export const UI_TEST_ID_INLINE_ALERT = `${UI_TEST_ID_PREFIX}inline-alert`
 export const UI_TEST_ID_SECTION_STATUS = `${UI_TEST_ID_PREFIX}section-status`
 export const UI_TEST_ID_MODAL_DIALOG = `${UI_TEST_ID_PREFIX}modal-dialog`
-export const UI_TEST_ID_SIDE_PANEL = `${UI_TEST_ID_PREFIX}side-panel`
+export const UI_TEST_ID_SIDE_PANEL = ``
 
 export const UI_CLASS_APP_SHELL = 'min-vh-100 d-flex flex-column bg-body-tertiary'

[Survived] StringLiteral
src/ui/constants.ts:121:43
 
 export const UI_CLASS_APP_SHELL = 'min-vh-100 d-flex flex-column bg-body-tertiary'
 export const UI_CLASS_APP_SHELL_BODY = 'flex-grow-1 d-flex w-100'
-export const UI_CLASS_APP_SHELL_SIDEBAR = 'bg-body border-end'
+export const UI_CLASS_APP_SHELL_SIDEBAR = ""
 export const UI_CLASS_APP_SHELL_CONTENT = 'flex-grow-1'
 export const UI_CLASS_APP_SHELL_HEADER = 'border-bottom bg-body'

[Survived] StringLiteral
src/ui/constants.ts:123:42
 export const UI_CLASS_APP_SHELL_BODY = 'flex-grow-1 d-flex w-100'
 export const UI_CLASS_APP_SHELL_SIDEBAR = 'bg-body border-end'
 export const UI_CLASS_APP_SHELL_CONTENT = 'flex-grow-1'
-export const UI_CLASS_APP_SHELL_HEADER = 'border-bottom bg-body'
+export const UI_CLASS_APP_SHELL_HEADER = ""
 export const UI_CLASS_APP_SHELL_FOOTER = 'border-top bg-body'
 

[Survived] StringLiteral
src/ui/constants.ts:126:35
 export const UI_CLASS_APP_SHELL_HEADER = 'border-bottom bg-body'
 export const UI_CLASS_APP_SHELL_FOOTER = 'border-top bg-body'
 
-export const UI_CLASS_PAGE_BASE = 'py-4'
+export const UI_CLASS_PAGE_BASE = ""
 export const UI_CLASS_PAGE_CONSTRAINED = 'container'
 export const UI_CLASS_PAGE_FULL_WIDTH = 'container-fluid'

[Survived] StringLiteral
src/ui/constants.ts:129:42
 export const UI_CLASS_PAGE_BASE = 'py-4'
 export const UI_CLASS_PAGE_CONSTRAINED = 'container'
 export const UI_CLASS_PAGE_FULL_WIDTH = 'container-fluid'
-export const UI_CLASS_PAGE_FULL_HEIGHT = 'min-vh-100'
+export const UI_CLASS_PAGE_FULL_HEIGHT = ""
 
 export const UI_CLASS_PAGE_HEADER = 'd-flex flex-wrap align-items-center justify-content-between gap-3'

[Survived] StringLiteral
src/ui/constants.ts:132:45
 export const UI_CLASS_PAGE_FULL_HEIGHT = 'min-vh-100'
 
 export const UI_CLASS_PAGE_HEADER = 'd-flex flex-wrap align-items-center justify-content-between gap-3'
-export const UI_CLASS_PAGE_HEADER_CONTENT = 'd-flex flex-column gap-1'
+export const UI_CLASS_PAGE_HEADER_CONTENT = ""
 export const UI_CLASS_PAGE_HEADER_ACTIONS = 'd-flex flex-wrap gap-2'
 

[Survived] StringLiteral
src/ui/constants.ts:135:36
 export const UI_CLASS_PAGE_HEADER_CONTENT = 'd-flex flex-column gap-1'
 export const UI_CLASS_PAGE_HEADER_ACTIONS = 'd-flex flex-wrap gap-2'
 
-export const UI_CLASS_STACK_BASE = 'd-flex w-100'
+export const UI_CLASS_STACK_BASE = ""
 export const UI_CLASS_STACK_WRAP = 'flex-wrap'
 export const UI_CLASS_STACK_GAP_MAP: Record<string, string> = {

[Survived] StringLiteral
src/ui/constants.ts:138:24
 export const UI_CLASS_STACK_BASE = 'd-flex w-100'
 export const UI_CLASS_STACK_WRAP = 'flex-wrap'
 export const UI_CLASS_STACK_GAP_MAP: Record<string, string> = {
-  [UI_STACK_GAP_NONE]: 'gap-0',
+  [UI_STACK_GAP_NONE]: "",
   [UI_STACK_GAP_SMALL]: 'gap-2',
   [UI_STACK_GAP_MEDIUM]: 'gap-3',

[Survived] StringLiteral
src/ui/constants.ts:141:25
   [UI_STACK_GAP_NONE]: 'gap-0',
   [UI_STACK_GAP_SMALL]: 'gap-2',
   [UI_STACK_GAP_MEDIUM]: 'gap-3',
-  [UI_STACK_GAP_LARGE]: 'gap-4',
+  [UI_STACK_GAP_LARGE]: "",
 }
 export const UI_CLASS_STACK_DIRECTION_MAP: Record<string, string> = {

[Survived] StringLiteral
src/ui/constants.ts:144:32
   [UI_STACK_GAP_LARGE]: 'gap-4',
 }
 export const UI_CLASS_STACK_DIRECTION_MAP: Record<string, string> = {
-  [UI_STACK_DIRECTION_COLUMN]: 'flex-column',
+  [UI_STACK_DIRECTION_COLUMN]: "",
   [UI_STACK_DIRECTION_ROW]: 'flex-row',
 }

[Survived] StringLiteral
src/ui/constants.ts:150:25
 export const UI_CLASS_STACK_ALIGN_MAP: Record<string, string> = {
   [UI_STACK_ALIGN_START]: 'align-items-start',
   [UI_STACK_ALIGN_CENTER]: 'align-items-center',
-  [UI_STACK_ALIGN_END]: 'align-items-end',
+  [UI_STACK_ALIGN_END]: "",
   [UI_STACK_ALIGN_STRETCH]: 'align-items-stretch',
 }

[Survived] StringLiteral
src/ui/constants.ts:157:31
   [UI_STACK_JUSTIFY_START]: 'justify-content-start',
   [UI_STACK_JUSTIFY_CENTER]: 'justify-content-center',
   [UI_STACK_JUSTIFY_END]: 'justify-content-end',
-  [UI_STACK_JUSTIFY_BETWEEN]: 'justify-content-between',
+  [UI_STACK_JUSTIFY_BETWEEN]: "",
 }
 export const UI_CLASS_TEXT_ALIGN_MAP: Record<string, string> = {

[Survived] ObjectLiteral
src/ui/constants.ts:159:64
   [UI_STACK_JUSTIFY_END]: 'justify-content-end',
   [UI_STACK_JUSTIFY_BETWEEN]: 'justify-content-between',
 }
-export const UI_CLASS_TEXT_ALIGN_MAP: Record<string, string> = {
-  [UI_TEXT_ALIGN_START]: 'text-start',
-  [UI_TEXT_ALIGN_CENTER]: 'text-center',
-  [UI_TEXT_ALIGN_END]: 'text-end',
-}
+export const UI_CLASS_TEXT_ALIGN_MAP: Record<string, string> = {}
 export const UI_CLASS_TEXT_EMPHASIS = 'text-primary'
 

[Survived] StringLiteral
src/ui/constants.ts:160:26
   [UI_STACK_JUSTIFY_BETWEEN]: 'justify-content-between',
 }
 export const UI_CLASS_TEXT_ALIGN_MAP: Record<string, string> = {
-  [UI_TEXT_ALIGN_START]: 'text-start',
+  [UI_TEXT_ALIGN_START]: "",
   [UI_TEXT_ALIGN_CENTER]: 'text-center',
   [UI_TEXT_ALIGN_END]: 'text-end',

[Survived] StringLiteral
src/ui/constants.ts:161:27
 }
 export const UI_CLASS_TEXT_ALIGN_MAP: Record<string, string> = {
   [UI_TEXT_ALIGN_START]: 'text-start',
-  [UI_TEXT_ALIGN_CENTER]: 'text-center',
+  [UI_TEXT_ALIGN_CENTER]: "",
   [UI_TEXT_ALIGN_END]: 'text-end',
 }

[Survived] StringLiteral
src/ui/constants.ts:162:24
 export const UI_CLASS_TEXT_ALIGN_MAP: Record<string, string> = {
   [UI_TEXT_ALIGN_START]: 'text-start',
   [UI_TEXT_ALIGN_CENTER]: 'text-center',
-  [UI_TEXT_ALIGN_END]: 'text-end',
+  [UI_TEXT_ALIGN_END]: "",
 }
 export const UI_CLASS_TEXT_EMPHASIS = 'text-primary'

[Killed] StringLiteral
src/ui/constants.ts:178:35
 export const UI_CLASS_MARGIN_RESET = 'mb-0'
 export const UI_CLASS_INLINE_GAP = 'd-flex align-items-center gap-2'
 
-export const UI_CLASS_BODY_TEXT = 'text-body'
+export const UI_CLASS_BODY_TEXT = ""
 export const UI_CLASS_BODY_TEXT_LEAD = 'lead'
 export const UI_CLASS_MUTED_TEXT = 'text-muted small'
killedBy: Typography primitives BodyText applies base typography class
statusReason: expect(element).toHaveClass(expected)
At least one expected class must be provided.

[Killed] StringLiteral
src/ui/constants.ts:183:36
 export const UI_CLASS_MUTED_TEXT = 'text-muted small'
 export const UI_CLASS_TEXT_MUTED = 'text-muted'
 
-export const UI_CLASS_BADGE_TEXT = 'd-inline-flex align-items-center gap-1'
+export const UI_CLASS_BADGE_TEXT = ""
 export const UI_CLASS_EMPTY_STATE_ACTIONS = 'd-flex justify-content-center gap-2 mt-3'
 
killedBy: Typography primitives BadgeText renders with variant classes
statusReason: expect(element).toHaveClass(expected)
At least one expected class must be provided.

[Survived] StringLiteral
src/ui/constants.ts:187:40
 export const UI_CLASS_EMPTY_STATE_ACTIONS = 'd-flex justify-content-center gap-2 mt-3'
 
 export const UI_CLASS_KEY_VALUE_LIST = 'list-unstyled mb-0'
-export const UI_CLASS_KEY_VALUE_ITEM = 'd-flex justify-content-between align-items-start gap-3 py-2 border-bottom'
+export const UI_CLASS_KEY_VALUE_ITEM = ""
 export const UI_CLASS_KEY_VALUE_LABEL = 'text-muted text-uppercase small'
 export const UI_CLASS_KEY_VALUE_VALUE = 'fw-semibold text-body'

[Survived] StringLiteral
src/ui/constants.ts:189:41
 export const UI_CLASS_KEY_VALUE_LIST = 'list-unstyled mb-0'
 export const UI_CLASS_KEY_VALUE_ITEM = 'd-flex justify-content-between align-items-start gap-3 py-2 border-bottom'
 export const UI_CLASS_KEY_VALUE_LABEL = 'text-muted text-uppercase small'
-export const UI_CLASS_KEY_VALUE_VALUE = 'fw-semibold text-body'
+export const UI_CLASS_KEY_VALUE_VALUE = ""
 
 export const UI_CLASS_EMPTY_STATE = 'text-center p-5 border border-dashed rounded-3 bg-body-tertiary'

[Killed] StringLiteral
src/ui/constants.ts:192:42
 export const UI_CLASS_KEY_VALUE_VALUE = 'fw-semibold text-body'
 
 export const UI_CLASS_EMPTY_STATE = 'text-center p-5 border border-dashed rounded-3 bg-body-tertiary'
-export const UI_CLASS_EMPTY_STATE_ICON = 'display-4 text-muted'
+export const UI_CLASS_EMPTY_STATE_ICON = ""
 
 export const UI_CLASS_FORM_FIELD = 'mb-3'
killedBy: Typography primitives EmptyState renders icon content with icon class
statusReason: expect(element).toHaveClass(expected)
At least one expected class must be provided.

[Killed] StringLiteral
src/ui/constants.ts:195:42
 export const UI_CLASS_EMPTY_STATE_ICON = 'display-4 text-muted'
 
 export const UI_CLASS_FORM_FIELD = 'mb-3'
-export const UI_CLASS_FORM_FIELD_LABEL = 'form-label fw-semibold mb-1'
+export const UI_CLASS_FORM_FIELD_LABEL = ""
 export const UI_CLASS_FORM_FIELD_HINT = 'form-text text-muted'
 export const UI_CLASS_FORM_FIELD_ERROR = 'text-danger mt-1'
killedBy: Form primitives FormField renders label with required marker when flagged
statusReason: expect(element).toHaveClass(expected)
At least one expected class must be provided.

[Killed] StringLiteral
src/ui/constants.ts:196:41
 
 export const UI_CLASS_FORM_FIELD = 'mb-3'
 export const UI_CLASS_FORM_FIELD_LABEL = 'form-label fw-semibold mb-1'
-export const UI_CLASS_FORM_FIELD_HINT = 'form-text text-muted'
+export const UI_CLASS_FORM_FIELD_HINT = ""
 export const UI_CLASS_FORM_FIELD_ERROR = 'text-danger mt-1'
 export const UI_CLASS_FORM_FIELD_REQUIRED = 'text-danger ms-1'
killedBy: Form primitives FormField shows hint text content
statusReason: expect(element).toHaveClass(expected)
At least one expected class must be provided.

[Survived] StringLiteral
src/ui/constants.ts:198:45
 export const UI_CLASS_FORM_FIELD_LABEL = 'form-label fw-semibold mb-1'
 export const UI_CLASS_FORM_FIELD_HINT = 'form-text text-muted'
 export const UI_CLASS_FORM_FIELD_ERROR = 'text-danger mt-1'
-export const UI_CLASS_FORM_FIELD_REQUIRED = 'text-danger ms-1'
+export const UI_CLASS_FORM_FIELD_REQUIRED = ""
 export const UI_CLASS_FORM_LABEL_HORIZONTAL = 'col-form-label'
 

[Survived] StringLiteral
src/ui/constants.ts:207:45
   [UI_FORM_ROW_COLUMNS_THREE]: 'row-cols-1 row-cols-md-3',
 }
 export const UI_CLASS_FORM_SECTION = 'mb-5'
-export const UI_CLASS_FORM_SECTION_HEADER = 'd-flex flex-wrap justify-content-between align-items-center mb-3'
+export const UI_CLASS_FORM_SECTION_HEADER = ""
 export const UI_CLASS_FORM_SECTION_TITLE = 'mb-0'
 export const UI_CLASS_FORM_SECTION_BODY = 'd-flex flex-column gap-3'

[Survived] StringLiteral
src/ui/constants.ts:211:39
 export const UI_CLASS_FORM_SECTION_TITLE = 'mb-0'
 export const UI_CLASS_FORM_SECTION_BODY = 'd-flex flex-column gap-3'
 
-export const UI_CLASS_TABLE_WRAPPER = 'table-responsive border rounded shadow-sm bg-body'
+export const UI_CLASS_TABLE_WRAPPER = ""
 export const UI_CLASS_TABLE = 'table align-middle mb-0'
 export const UI_CLASS_TABLE_HEADER_CELL = 'text-uppercase text-muted small fw-semibold'

[Survived] StringLiteral
src/ui/constants.ts:213:43
 
 export const UI_CLASS_TABLE_WRAPPER = 'table-responsive border rounded shadow-sm bg-body'
 export const UI_CLASS_TABLE = 'table align-middle mb-0'
-export const UI_CLASS_TABLE_HEADER_CELL = 'text-uppercase text-muted small fw-semibold'
+export const UI_CLASS_TABLE_HEADER_CELL = ""
 export const UI_CLASS_TABLE_SORT_BUTTON = 'btn btn-link p-0 text-decoration-none text-body-secondary'
 export const UI_CLASS_TABLE_SELECTION_CELL = 'text-center'

[Survived] StringLiteral
src/ui/constants.ts:214:43
 export const UI_CLASS_TABLE_WRAPPER = 'table-responsive border rounded shadow-sm bg-body'
 export const UI_CLASS_TABLE = 'table align-middle mb-0'
 export const UI_CLASS_TABLE_HEADER_CELL = 'text-uppercase text-muted small fw-semibold'
-export const UI_CLASS_TABLE_SORT_BUTTON = 'btn btn-link p-0 text-decoration-none text-body-secondary'
+export const UI_CLASS_TABLE_SORT_BUTTON = ""
 export const UI_CLASS_TABLE_SELECTION_CELL = 'text-center'
 export const UI_CLASS_TABLE_EMPTY_STATE = 'text-center text-muted py-5'

[Survived] StringLiteral
src/ui/constants.ts:215:46
 export const UI_CLASS_TABLE = 'table align-middle mb-0'
 export const UI_CLASS_TABLE_HEADER_CELL = 'text-uppercase text-muted small fw-semibold'
 export const UI_CLASS_TABLE_SORT_BUTTON = 'btn btn-link p-0 text-decoration-none text-body-secondary'
-export const UI_CLASS_TABLE_SELECTION_CELL = 'text-center'
+export const UI_CLASS_TABLE_SELECTION_CELL = ""
 export const UI_CLASS_TABLE_EMPTY_STATE = 'text-center text-muted py-5'
 export const UI_CLASS_TABLE_SPINNER = 'py-5 text-center'

[Survived] StringLiteral
src/ui/constants.ts:217:39
 export const UI_CLASS_TABLE_SORT_BUTTON = 'btn btn-link p-0 text-decoration-none text-body-secondary'
 export const UI_CLASS_TABLE_SELECTION_CELL = 'text-center'
 export const UI_CLASS_TABLE_EMPTY_STATE = 'text-center text-muted py-5'
-export const UI_CLASS_TABLE_SPINNER = 'py-5 text-center'
+export const UI_CLASS_TABLE_SPINNER = ""
 export const UI_CLASS_TABLE_DENSITY_MAP: Record<string, string> = {
   [UI_TABLE_DENSITY_COMFORTABLE]: '',

[Survived] ObjectLiteral
src/ui/constants.ts:218:67
 export const UI_CLASS_TABLE_SELECTION_CELL = 'text-center'
 export const UI_CLASS_TABLE_EMPTY_STATE = 'text-center text-muted py-5'
 export const UI_CLASS_TABLE_SPINNER = 'py-5 text-center'
-export const UI_CLASS_TABLE_DENSITY_MAP: Record<string, string> = {
-  [UI_TABLE_DENSITY_COMFORTABLE]: '',
-  [UI_TABLE_DENSITY_COMPACT]: 'table-sm',
-  [UI_TABLE_DENSITY_SPACIOUS]: 'table-lg',
-}
+export const UI_CLASS_TABLE_DENSITY_MAP: Record<string, string> = {}
 
 export const UI_ARIA_LABEL_SELECT_ALL = 'Select all rows'

[Survived] StringLiteral
src/ui/constants.ts:219:35
 export const UI_CLASS_TABLE_EMPTY_STATE = 'text-center text-muted py-5'
 export const UI_CLASS_TABLE_SPINNER = 'py-5 text-center'
 export const UI_CLASS_TABLE_DENSITY_MAP: Record<string, string> = {
-  [UI_TABLE_DENSITY_COMFORTABLE]: '',
+  [UI_TABLE_DENSITY_COMFORTABLE]: "Stryker was here!",
   [UI_TABLE_DENSITY_COMPACT]: 'table-sm',
   [UI_TABLE_DENSITY_SPACIOUS]: 'table-lg',

[Survived] StringLiteral
src/ui/constants.ts:224:41
   [UI_TABLE_DENSITY_SPACIOUS]: 'table-lg',
 }
 
-export const UI_ARIA_LABEL_SELECT_ALL = 'Select all rows'
+export const UI_ARIA_LABEL_SELECT_ALL = ""
 
 export const UI_CLASS_TABLE_TOOLBAR = 'd-flex flex-wrap justify-content-between align-items-center gap-3 mb-3'

[Killed] StringLiteral
src/ui/constants.ts:226:39
 
 export const UI_ARIA_LABEL_SELECT_ALL = 'Select all rows'
 
-export const UI_CLASS_TABLE_TOOLBAR = 'd-flex flex-wrap justify-content-between align-items-center gap-3 mb-3'
+export const UI_CLASS_TABLE_TOOLBAR = ""
 
 export const UI_CLASS_SUMMARY_LIST = 'row row-cols-1 row-cols-md-2 g-3'
killedBy: Data primitives TableToolbar renders start and end slots
statusReason: expect(element).toHaveClass(expected)
At least one expected class must be provided.

[Killed] StringLiteral
src/ui/constants.ts:228:38
 
 export const UI_CLASS_TABLE_TOOLBAR = 'd-flex flex-wrap justify-content-between align-items-center gap-3 mb-3'
 
-export const UI_CLASS_SUMMARY_LIST = 'row row-cols-1 row-cols-md-2 g-3'
+export const UI_CLASS_SUMMARY_LIST = ""
 export const UI_CLASS_SUMMARY_CARD = 'p-3 border rounded bg-body'
 export const UI_CLASS_SUMMARY_VALUE = 'h4 mb-0'
killedBy: Data primitives SummaryList displays card values
statusReason: expect(element).toHaveClass(expected)
At least one expected class must be provided.

[Survived] StringLiteral
src/ui/constants.ts:233:40
 export const UI_CLASS_SUMMARY_VALUE = 'h4 mb-0'
 
 export const UI_CLASS_CARD_LIST_GRID = 'row g-4'
-export const UI_CLASS_CARD_LIST_CARD = 'h-100 shadow-sm'
+export const UI_CLASS_CARD_LIST_CARD = ""
 export const UI_CLASS_CARD_COLUMN_MAP: Record<number, string> = {
   [UI_FORM_ROW_COLUMNS_TWO]: 'col-md-6',

[Survived] ObjectLiteral
src/ui/constants.ts:234:65
 
 export const UI_CLASS_CARD_LIST_GRID = 'row g-4'
 export const UI_CLASS_CARD_LIST_CARD = 'h-100 shadow-sm'
-export const UI_CLASS_CARD_COLUMN_MAP: Record<number, string> = {
-  [UI_FORM_ROW_COLUMNS_TWO]: 'col-md-6',
-  [UI_FORM_ROW_COLUMNS_THREE]: 'col-md-4',
-}
+export const UI_CLASS_CARD_COLUMN_MAP: Record<number, string> = {}
 
 export const UI_CLASS_TAG_LIST = 'd-flex flex-wrap gap-2'

[Survived] StringLiteral
src/ui/constants.ts:244:42
 export const UI_CLASS_CHIP_REMOVE_BUTTON = 'btn-close btn-close-white btn-sm'
 
 export const UI_CLASS_SIDEBAR_NAV = 'nav flex-column gap-1'
-export const UI_CLASS_SIDEBAR_NAV_LINK = 'nav-link d-flex align-items-center gap-2'
+export const UI_CLASS_SIDEBAR_NAV_LINK = ""
 export const UI_CLASS_SIDEBAR_NAV_ACTIVE = 'active fw-semibold'
 

[Survived] StringLiteral
src/ui/constants.ts:248:41
 export const UI_CLASS_SIDEBAR_NAV_ACTIVE = 'active fw-semibold'
 
 export const UI_CLASS_TOP_NAV = 'navbar bg-body border-bottom shadow-sm'
-export const UI_CLASS_TOP_NAV_CONTENT = 'container-fluid d-flex align-items-center gap-3'
+export const UI_CLASS_TOP_NAV_CONTENT = ""
 
 export const UI_CLASS_BREADCRUMBS = 'breadcrumb mb-0'

[Killed] StringLiteral
src/ui/constants.ts:250:37
 export const UI_CLASS_TOP_NAV = 'navbar bg-body border-bottom shadow-sm'
 export const UI_CLASS_TOP_NAV_CONTENT = 'container-fluid d-flex align-items-center gap-3'
 
-export const UI_CLASS_BREADCRUMBS = 'breadcrumb mb-0'
+export const UI_CLASS_BREADCRUMBS = ""
 
 export const UI_CLASS_INLINE_ALERT = 'mb-3'
killedBy: Navigation primitives Breadcrumbs display provided trail
statusReason: expect(element).toHaveClass(expected)
At least one expected class must be provided.

[Survived] StringLiteral
src/ui/constants.ts:255:48
 export const UI_CLASS_INLINE_ALERT = 'mb-3'
 
 export const UI_CLASS_SECTION_STATUS = 'd-flex flex-wrap align-items-center justify-content-between gap-3 p-3 border rounded'
-export const UI_CLASS_SECTION_STATUS_CONTENT = 'd-flex flex-column gap-2'
+export const UI_CLASS_SECTION_STATUS_CONTENT = ""
 
 export const UI_CLASS_MODAL_BODY = 'd-flex flex-column gap-3'

[Survived] StringLiteral
src/ui/constants.ts:258:39
 export const UI_CLASS_SECTION_STATUS_CONTENT = 'd-flex flex-column gap-2'
 
 export const UI_CLASS_MODAL_BODY = 'd-flex flex-column gap-3'
-export const UI_CLASS_MODAL_ACTIONS = 'd-flex flex-wrap gap-2 justify-content-end'
+export const UI_CLASS_MODAL_ACTIONS = ""
 
 export const UI_CLASS_SIDE_PANEL_BODY = 'd-flex flex-column gap-3'

[Survived] StringLiteral
src/ui/constants.ts:262:36
 
 export const UI_CLASS_SIDE_PANEL_BODY = 'd-flex flex-column gap-3'
 export const UI_CLASS_SIDE_PANEL_ACTIONS = 'd-flex justify-content-end gap-2 mt-4'
-export const UI_CLASS_SIDE_PANEL = 'bg-body border-start shadow-lg p-4 position-fixed top-0 h-100'
+export const UI_CLASS_SIDE_PANEL = ""
 
 
